Repository: taicoding/python-docs-es
Catalog: library/*.po
Languages: ast

source: **Source code:** :source:`Lib/ast.py`
ast: **Código fuente:** :source:`Lib/ast.py`

source: The :mod:`ast` module helps Python applications to process trees of the Python abstract syntax grammar. The abstract syntax itself might change with each Python release; this module helps to find out programmatically what the current grammar looks like.
ast: El módulo :mod:`ast` ayuda a las aplicaciones de Python a procesar árboles de la gramática de sintaxis abstracta de Python. La sintaxis abstracta en sí misma puede cambiar con cada versión de Python; Este módulo ayuda a descubrir mediante programación cómo se ve la gramática actual.

source: An abstract syntax tree can be generated by passing :data:`ast.PyCF_ONLY_AST` as a flag to the :func:`compile` built-in function, or using the :func:`parse` helper provided in this module. The result will be a tree of objects whose classes all inherit from :class:`ast.AST`. An abstract syntax tree can be compiled into a Python code object using the built-in :func:`compile` function.
ast: Se puede generar un árbol de sintaxis abstracta pasando :data:`ast.PyCF_ONLY_AST` como un indicador de la función incorporada :func:`compile`, o usando el ayudante :func:`parse` provisto en este módulo. El resultado será un árbol de objetos cuyas clases todas heredan de :class:`ast.AST`. Se puede compilar un árbol de sintaxis abstracta en un objeto de código Python utilizando la función incorporada :func:`compile`.

source: Abstract Grammar
ast: Gramática abstracta

source: The abstract grammar is currently defined as follows:
ast: La gramática abstracta se define actualmente de la siguiente manera:

source: Node classes
ast: Clases nodo

source: There is one class defined for each left-hand side symbol in the abstract grammar (for example, :class:`ast.stmt` or :class:`ast.expr`). In addition, there is one class defined for each constructor on the right-hand side; these classes inherit from the classes for the left-hand side trees. For example, :class:`ast.BinOp` inherits from :class:`ast.expr`. For production rules with alternatives (aka "sums"), the left-hand side class is abstract: only instances of specific constructor nodes are ever created.
ast: Hay una clase definida para cada símbolo del lado izquierdo en la gramática abstracta (por ejemplo, :class:`ast.stmt` o :class:`ast.expr`). Además, hay una clase definida para cada constructor en el lado derecho; estas clases heredan de las clases para los árboles del lado izquierdo. Por ejemplo, :class:`ast.BinOp` hereda de :class:`ast.expr`. Para las reglas de producción con alternativas (también conocidas como "sumas"), la clase del lado izquierdo es abstracta: solo se crean instancias de nodos de constructor específicos.

source: Each instance of a concrete class has one attribute for each child node, of the type as defined in the grammar. For example, :class:`ast.BinOp` instances have an attribute :attr:`left` of type :class:`ast.expr`.
ast: Cada instancia de una clase concreta tiene un atributo para cada nodo secundario, del tipo definido en la gramática. Por ejemplo, las instancias :class:`ast.BinOp` tienen un atributo :attr:`left` de tipo :class:`ast.expr`.

source: If these attributes are marked as optional in the grammar (using a question mark), the value might be ``None``. If the attributes can have zero-or-more values (marked with an asterisk), the values are represented as Python lists. All possible attributes must be present and have valid values when compiling an AST with :func:`compile`.
ast: Si estos atributos están marcados como opcionales en la gramática (usando un signo de interrogación), el valor podría ser ``None``. Si los atributos pueden tener cero o más valores (marcados con un asterisco), los valores se representan como listas de Python. Todos los atributos posibles deben estar presentes y tener valores válidos al compilar un AST con :func:`compile`.

source: Instances of :class:`ast.expr` and :class:`ast.stmt` subclasses have :attr:`lineno`, :attr:`col_offset`, :attr:`end_lineno`, and :attr:`end_col_offset` attributes. The :attr:`lineno` and :attr:`end_lineno` are the first and last line numbers of source text span (1-indexed so the first line is line 1) and the :attr:`col_offset` and :attr:`end_col_offset` are the corresponding UTF-8 byte offsets of the first and last tokens that generated the node. The UTF-8 offset is recorded because the parser uses UTF-8 internally.
ast: Las instancias de las subclases :class:`ast.expr` y :class:`ast.stmt` tienen atributos :attr:`lineno`, :attr:`col_offset`, :attr:`lineno`, y :attr:`col_offset`. :attr:`lineno` y :attr:`end_lineno` son los números de la primera y última línea del intervalo de texto de origen (1 indexado, por lo que la primera línea es la línea 1), y :attr:`col_offset` y :attr:`end_col_offset` son las correspondientes compensaciones de bytes UTF-8 del primer y último token que generó el nodo. El desplazamiento UTF-8 se registra porque el analizador utiliza UTF-8 internamente.

source: Note that the end positions are not required by the compiler and are therefore optional. The end offset is *after* the last symbol, for example one can get the source segment of a one-line expression node using ``source_line[node.col_offset : node.end_col_offset]``.
ast: Tenga en cuenta que el compilador no requiere las posiciones finales y, por lo tanto, son opcionales. El desplazamiento final es *después* del último símbolo, por ejemplo, uno puede obtener el segmento fuente de un nodo de expresión de una línea usando ``source_line[node.col_offset: node.end_col_offset]``.

source: The constructor of a class :class:`ast.T` parses its arguments as follows:
ast: El constructor de una clase :class:`ast.T` analiza sus argumentos de la siguiente manera:

source: If there are positional arguments, there must be as many as there are items in :attr:`T._fields`; they will be assigned as attributes of these names.
ast: Si hay argumentos posicionales, debe haber tantos como elementos en :attr:`T._fields`; serán asignados como atributos de estos nombres.

source: If there are keyword arguments, they will set the attributes of the same names to the given values.
ast: Si hay argumentos de palabras clave, establecerán los atributos de los mismos nombres a los valores dados.

source: For example, to create and populate an :class:`ast.UnaryOp` node, you could use ::
ast: Por ejemplo, para crear y completar un nodo :class:`ast.UnaryOp`, puede usar ::

source: Class :class:`ast.Constant` is now used for all constants.
ast: La clase :class:`ast.Constant` ahora se usa para todas las constantes.

source: Simple indices are represented by their value, extended slices are represented as tuples.
ast: Los índices simples se representan por su valor, los segmentos extendidos se representan como tuplas.

source: The descriptions of the specific node classes displayed here were initially adapted from the fantastic `Green Tree Snakes <https://greentreesnakes.readthedocs.io/en/latest/>`__ project and all its contributors.
ast: Las descripciones de las clases de nodo específicas mostradas aquí fueron adaptadas inicialmente del fantástico proyecto `Green Tree Snakes <https://greentreesnakes.readthedocs.io/en/latest/>`__ y todos sus contribuidores.

source: Root nodes
ast: Nodos raíz

source: A Python module, as with :ref:`file input <file-input>`. Node type generated by :func:`ast.parse` in the default ``"exec"`` *mode*.
ast: Un módulo de Python, como con :ref:`archivo-entrada <file-input>`. Tipo de nodo generado por :func:`ast.parse` en el modo por defecto ``"exec"`` *mode*.*mode*.

source: A single Python :ref:`expression input <expression-input>`. Node type generated by :func:`ast.parse` when *mode* is ``"eval"``.
ast: Una única :ref:`expression input <expression-input>` de Python. Tipo de nodo generado por :func:`ast.parse` cuando *mode* es ``"eval"``.

source: A single :ref:`interactive input <interactive>`, like in :ref:`tut-interac`. Node type generated by :func:`ast.parse` when *mode* is ``"single"``.
ast: Una única :ref:`entrada interactiva <interactive>`, como en :ref:`tut-interac`. Tipo de nodo generado por :func:`ast.parse` cuando *mode* es ``"single"``.

source: A representation of an old-style type comments for functions, as Python versions prior to 3.5 didn't support :pep:`484` annotations. Node type generated by :func:`ast.parse` when *mode* is ``"func_type"``.
ast: Una interpretación de un comentario de tipo de estilo antiguo para funciones, ya que las versiones de Python anteriores a la 3.5 no soportaban anotaciones :pep:`484`. Tipo de nodo generado por :func:`ast.parse` cuando *mode* es ``"func_type"``.

source: Such type comments would look like this::
ast: Los comentarios de este tipo tendrían el siguiente aspecto::

source: Literals
ast: Literales

source: A constant value. The ``value`` attribute of the ``Constant`` literal contains the Python object it represents. The values represented can be simple types such as a number, string or ``None``, but also immutable container types (tuples and frozensets) if all of their elements are constant.
ast: Un valor constante. El atributo ``value`` del literal ``Constant`` contiene el objeto de Python que este representa. Los valores representados pueden ser de tipos simple como un número, una cadena de caracteres o ``None``; pero también pueden ser de tipos de contenedores inmutables (tuplas y ``frozensets``) si todos sus elementos son constantes.

source: Node representing a single formatting field in an f-string. If the string contains a single formatting field and nothing else the node can be isolated otherwise it appears in :class:`JoinedStr`.
ast: Nodo que representa un único campo de formato en una ``f-string``. Si la cadena de caracteres contiene un único campo de formato y nada más, el nodo puede estar aislado de otra manera aparece en :class:`JoinedStr`.

source: ``value`` is any expression node (such as a literal, a variable, or a function call).
ast: ``value`` es cualquier nodo de expresión (como un literal, una variable o una llamada a función).

source: ``conversion`` is an integer:
ast: ``conversion`` es un entero:

source: -1: no formatting
ast: -1: sin formato

source: 115: ``!s`` string formatting
ast: 115: ``!s`` formato de cadena de caracteres

source: 114: ``!r`` repr formatting
ast: 114: ``!r`` formato repr

source: 97: ``!a`` ascii formatting
ast: 97: ``!a`` formato ascii

source: ``format_spec`` is a :class:`JoinedStr` node representing the formatting of the value, or ``None`` if no format was specified. Both ``conversion`` and ``format_spec`` can be set at the same time.
ast: ``format_spec`` es un nodo :class:`JoinedStr` que representa el formato del valor, o ``None`` si no se ha especificado un formato. Ambos, ``conversion`` y ``format_spec``, pueden estar especificados al mismo tiempo.

source: An f-string, comprising a series of :class:`FormattedValue` and :class:`Constant` nodes.
ast: Un f-string que comprende una serie de nodos :class:`FormattedValue` y :class:`Constant`.

source: A list or tuple. ``elts`` holds a list of nodes representing the elements. ``ctx`` is :class:`Store` if the container is an assignment target (i.e. ``(x,y)=something``), and :class:`Load` otherwise.
ast: Una lista o tupla. ``elts`` contiene una lista de nodos que representa a los elementos. ``ctx`` es :class:`Store` si el contenedor es un objetivo de asignación (por ejemplo ``(x,y)=something``), y :class:`Load` en cualquier otro caso.

source: A set. ``elts`` holds a list of nodes representing the set's elements.
ast: Un set. ``elts`` contiene una lista de nodos que representa a un set de elementos.

source: A dictionary. ``keys`` and ``values`` hold lists of nodes representing the keys and the values respectively, in matching order (what would be returned when calling :code:`dictionary.keys()` and :code:`dictionary.values()`).
ast: Un diccionario. ``keys`` y ``values`` contienen listas de nodos que representan las claves y los valores respectivamente en el orden correspondiente (el orden que retornaría :code:`dictionary.keys()` y :code:`dictionary.values()`).

source: When doing dictionary unpacking using dictionary literals the expression to be expanded goes in the ``values`` list, with a ``None`` at the corresponding position in ``keys``.
ast: Cuando se desempaqueta un diccionario utilizando literales de diccionario, la expresión a ser expandida va en la lista ``values``, con ``None`` en la posición correspondiente en ``keys``.

source: A variable name. ``id`` holds the name as a string, and ``ctx`` is one of the following types.
ast: Un nombre de variable. ``id`` contiene el nombre de una cadena de caracteres y ``ctx`` es uno de los siguientes tipos.

source: Variable references can be used to load the value of a variable, to assign a new value to it, or to delete it. Variable references are given a context to distinguish these cases.
ast: Referencias a variables que pueden ser usadas para cargar el valor de una variable, asignar un nuevo valor o borrarlo. Las referencias a variables reciben un contexto para distinguir entre estos casos.

source: A ``*var`` variable reference. ``value`` holds the variable, typically a :class:`Name` node. This type must be used when building a :class:`Call` node with ``*args``.
ast: Una referencia a variable ``*var``. ``value`` contiene la variable, típicamente un nodo :class:`Name`. Este tipo puede ser usado cuando se construye un nodo :class:`Call` con ``*args``.

source: Expressions
ast: Expresiones

source: When an expression, such as a function call, appears as a statement by itself with its return value not used or stored, it is wrapped in this container. ``value`` holds one of the other nodes in this section, a :class:`Constant`, a :class:`Name`, a :class:`Lambda`, a :class:`Yield` or :class:`YieldFrom` node.
ast: Cuando una expresión, como un llamado a función, aparece como una declaración por sí misma sin que su valor de retorno se use o se almacene, está dentro de este contenedor. ``value`` contiene uno de los otros nodos en esta sección, un nodo :class:`Constant`, :class:`Name`, :class:`Lambda`, :class:`Yield` o :class:`YieldFrom`.

source: A unary operation. ``op`` is the operator, and ``operand`` any expression node.
ast: Una operación unaria. ``op`` es el operador y ``operand`` es cualquier nodo de expresión.

source: Unary operator tokens. :class:`Not` is the ``not`` keyword, :class:`Invert` is the ``~`` operator.
ast: Tokens de operador unario. :class:`Not` es la palabra clave ``not``, :class:`Invert` es el operador ``~``.

source: A binary operation (like addition or division). ``op`` is the operator, and ``left`` and ``right`` are any expression nodes.
ast: Una operación binaria (como la suma o división(. ``op`` es el operador, y ``left`` y ``right`` son cualquier nodo de expresión.

source: Binary operator tokens.
ast: Tokens de operador binario.

source: A boolean operation, 'or' or 'and'. ``op`` is :class:`Or` or :class:`And`. ``values`` are the values involved. Consecutive operations with the same operator, such as ``a or b or c``, are collapsed into one node with several values.
ast: Una operación booleana, 'or' y 'and'. ``op`` es :class:`Or` o :class:`And`. ``values`` son los valores involucrados. Operaciones consecutivas con el mismo operador, como ``a or b or c``, colapsan en un nodo con varios valores.

source: This doesn't include ``not``, which is a :class:`UnaryOp`.
ast: Esto no incluye ``not``, el cual es un :class:`UnaryOp`.

source: Boolean operator tokens.
ast: Tokens de operador booleano.

source: A comparison of two or more values. ``left`` is the first value in the comparison, ``ops`` the list of operators, and ``comparators`` the list of values after the first element in the comparison.
ast: Una comparación de dos o más valores. ``left`` es el primer valor en la comparación, ``ops`` es la lista de operadores, y ``comparators`` es la lista de valores después de el primer elemento en la comparación.

source: Comparison operator tokens.
ast: Tokens de operador de comparación.

source: A function call. ``func`` is the function, which will often be a :class:`Name` or :class:`Attribute` object. Of the arguments:
ast: Un llamado a función. ``func`` is la función, la cual suele ser un objeto :class:`Name` o :class:`Attribute`. De los argumentos:

source: ``args`` holds a list of the arguments passed by position.
ast: ``args`` contiene una lista de argumentos pasados por posición.

source: ``keywords`` holds a list of :class:`.keyword` objects representing arguments passed by keyword.
ast: ``keywords`` contiene una lista de objetos :class:`.keyword` que representan argumentos pasados por nombre clave.

source: A keyword argument to a function call or class definition. ``arg`` is a raw string of the parameter name, ``value`` is a node to pass in.
ast: Un argumento de palabra clave para una llamada de función o definición de clase. ``arg`` es una cadena de caracteres sin formato del nombre del parámetro, ``valor`` es un nodo para pasar.

source: An expression such as ``a if b else c``. Each field holds a single node, so in the following example, all three are :class:`Name` nodes.
ast: Una expresión como ``a if b else c``. Cada campo contiene un único nodo, por lo que en el siguiente ejemplo, todos son nodos :class:`Name`.

source: Attribute access, e.g. ``d.keys``. ``value`` is a node, typically a :class:`Name`. ``attr`` is a bare string giving the name of the attribute, and ``ctx`` is :class:`Load`, :class:`Store` or :class:`Del` according to how the attribute is acted on.
ast: Acceso a atributos, por ejemplo ``d.keys``. ``value`` es un nodo, típicamente un :class:`Name`. ``attr`` es una simple cadena de caracteres que da el nombre del atributo, y ``ctx`` es :class:`Load`, :class:`Store` o :class:`Del` de acuerdo a cómo se actúe sobre el atributo.

source: A named expression. This AST node is produced by the assignment expressions operator (also known as the walrus operator). As opposed to the :class:`Assign` node in which the first argument can be multiple nodes, in this case both ``target`` and ``value`` must be single nodes.
ast: Una expresión con nombre. Este nodo AST es producido por el operador de expresiones de asignación (también conocido como el operador walrus). A diferencia del nodo :class:`Assign` en el cual el primer argumento puede ser varios nodos, en este caso ``target`` y ``value`` deben ser nodos únicos.

source: Subscripting
ast: Subindexado

source: A subscript, such as ``l[1]``. ``value`` is the subscripted object (usually sequence or mapping). ``slice`` is an index, slice or key. It can be a :class:`Tuple` and contain a :class:`Slice`. ``ctx`` is :class:`Load`, :class:`Store` or :class:`Del` according to the action performed with the subscript.
ast: Un subíndice, como ``l[1]``. ``value`` es el objeto subindicado (usualmente una secuencia o mapeo). ``slice`` es un índice, un segmento o una clave. Este puede ser una :class:`Tuple` y contener un :class:`Slice`. ``ctx`` es :class:`Load`, :class:`Store` or :class:`Del` de acuerdo a la acción tomada con el subíndice.

source: Regular slicing (on the form ``lower:upper`` or ``lower:upper:step``). Can occur only inside the *slice* field of :class:`Subscript`, either directly or as an element of :class:`Tuple`.
ast: Una segmentación regular (en la forma ``lower:upper`` o ``lower:upper:step``). Puede ocurrir solamente dentro del campo *slice* de :class:`Subscript`, ya sea directamente o como un elemento de :class:`Tuple`.

source: Comprehensions
ast: Comprensiones

source: List and set comprehensions, generator expressions, and dictionary comprehensions. ``elt`` (or ``key`` and ``value``) is a single node representing the part that will be evaluated for each item.
ast: Listas y sets por comprensión, expresiones de generadores, y diccionarios por comprensión. ``elt`` (o ``key`` y ``value``) es un único nodo que representa la parte que va a ser evaluada por cada item.

source: ``generators`` is a list of :class:`comprehension` nodes.
ast: ``generators`` es una lista de nodos :class:`comprehension`.

source: One ``for`` clause in a comprehension. ``target`` is the reference to use for each element - typically a :class:`Name` or :class:`Tuple` node. ``iter`` is the object to iterate over. ``ifs`` is a list of test expressions: each ``for`` clause can have multiple ``ifs``.
ast: Una cláusula ``for`` en una comprensión. ``target`` es la referencia a usarse por cada elemento - típicamente un nodo :class:`Name` o :class:`Tuple`. ``iter`` es el objeto por el cual se itera. ``ifs`` es una lista de expresiones de prueba: cada cláusula ``for`` puede tener múltiples ``ifs``.

source: ``is_async`` indicates a comprehension is asynchronous (using an ``async for`` instead of ``for``). The value is an integer (0 or 1).
ast: ``is_async`` indica que una compresión es asíncrona (usando ``async for`` en lugar de ``for``). El valor es un entero (0 o 1).

source: Statements
ast: Declaraciones

source: An assignment. ``targets`` is a list of nodes, and ``value`` is a single node.
ast: Una asignación. ``targets`` es una lista de nodos, y ``value`` es un nodo único.

source: Multiple nodes in ``targets`` represents assigning the same value to each. Unpacking is represented by putting a :class:`Tuple` or :class:`List` within ``targets``.
ast: Nodos múltiples en ``targets`` representa asignar el mismo valor a cada uno. El desempaquetado se representa poniendo una :class:`Tuple` o :class:`List` en ``targets``.

source: ``type_comment`` is an optional string with the type annotation as a comment.
ast: ``type_comment`` es una cadena de caracteres opcional con la anotación de tipos como comentario.

source: Augmented assignment, such as ``a += 1``. In the following example, ``target`` is a :class:`Name` node for ``x`` (with the :class:`Store` context), ``op`` is :class:`Add`, and ``value`` is a :class:`Constant` with value for 1.
ast: Asignación aumentada, como ``a+=1``. En el siguiente ejemplo, ``target`` es un nodo :class:`Name` para ``x`` (con el contexto :class:`Store`), ``op`` es :class:`Add` y ``value`` es un :class:`Constant` con valor 1.

source: The ``target`` attribute cannot be of class :class:`Tuple` or :class:`List`, unlike the targets of :class:`Assign`.
ast: El atributo ``target`` no puede ser de clase :class:`Tuple` o :class:`List`, a diferencia de los objetivos de :class:`Assign`.

source: A ``raise`` statement. ``exc`` is the exception object to be raised, normally a :class:`Call` or :class:`Name`, or ``None`` for a standalone ``raise``. ``cause`` is the optional part for ``y`` in ``raise x from y``.
ast: Una declaración ``raise``. ``exc`` es el objeto de excepción a ser lanzado, normalmente un :class:`Call` or :class:`Name`, o ``None`` para un ``raise`` solo. ``cause`` es la parte opcional para ``y`` en ``raise x from y``.

source: An assertion. ``test`` holds the condition, such as a :class:`Compare` node. ``msg`` holds the failure message.
ast: Una aserción. ``test`` contiene la condición, como un nodo :class:`Compare`. ``msg`` contiene el mensaje de fallo.

source: Represents a ``del`` statement. ``targets`` is a list of nodes, such as :class:`Name`, :class:`Attribute` or :class:`Subscript` nodes.
ast: Contiene una declaración ``del``. ``targets`` es una lista de nodos, como nodos :class:`Name`, :class:`Attribute` o :class:`Subscript`.

source: A ``pass`` statement.
ast: Una declaración ``pass``.
