Repository: taicoding/python-docs-es
Catalog: library/*.po
Languages: ast

source: Evaluate an expression node or a string containing only a Python literal or container display. The string or node provided may only consist of the following Python literal structures: strings, bytes, numbers, tuples, lists, dicts, sets, booleans, ``None`` and ``Ellipsis``.
ast: Evalúa un nodo de expresión o una cadena de caracteres que contenga únicamente un literal de Python o visualizador de contenedor. La cadena o nodo proporcionado sólo puede consistir en las siguientes estructuras literales de Python: cadenas de caracteres, bytes, números, tuplas, listas, diccionarios, conjuntos, booleanos, ``None`` y ``Ellipsis``.

source: This can be used for evaluating strings containing Python values without the need to parse the values oneself. It is not capable of evaluating arbitrarily complex expressions, for example involving operators or indexing.
ast: Esto se puede usar para evaluar de forma segura las cadenas de caracteres que contienen valores de Python sin la necesidad de analizar los valores uno mismo. No es capaz de evaluar expresiones complejas arbitrariamente, por ejemplo, que involucran operadores o indexación.

source: This function had been documented as "safe" in the past without defining what that meant. That was misleading. This is specifically designed not to execute Python code, unlike the more general :func:`eval`. There is no namespace, no name lookups, or ability to call out. But it is not free from attack: A relatively small input can lead to memory exhaustion or to C stack exhaustion, crashing the process. There is also the possibility for excessive CPU consumption denial of service on some inputs. Calling it on untrusted data is thus not recommended.
ast: Esta función había sido documentada como "segura" en el pasado sin definir lo que eso significaba. Eso era engañoso. Está diseñada específicamente no para ejecutar código Python, a diferencia de la más general :func:`eval`. No hay espacio de nombres, ni búsqueda de nombres, ni capacidad de llamada. Pero no está libre de ataques: Una entrada relativamente pequeña puede llevar a un agotamiento de la memoria o de la pila de C, haciendo colapsar el proceso. También existe la posibilidad de denegación de servicio por consumo excesivo de CPU en algunas entradas. Por lo tanto, no se recomienda llamarlo con datos no confiables.

source: It is possible to crash the Python interpreter due to stack depth limitations in Python's AST compiler.
ast: Es posible bloquear el intérprete de Python debido a las limitaciones de profundidad de pila en el compilador AST de Python.

source: It can raise :exc:`ValueError`, :exc:`TypeError`, :exc:`SyntaxError`, :exc:`MemoryError` and :exc:`RecursionError` depending on the malformed input.
ast: Puede generar :exc:`ValueError`, :exc:`TypeError`, :exc:`SyntaxError`, :exc:`MemoryError` y :exc:`RecursionError` dependiendo de la entrada mal formada.

source: Now allows bytes and set literals.
ast: Ahora permite bytes y establece literales.

source: Now supports creating empty sets with ``'set()'``.
ast: Ahora admite la creación de conjuntos vacíos con ``'set()'``.

source: For string inputs, leading spaces and tabs are now stripped.
ast: Para las entradas de cadena, los espacios iniciales y las tabulaciones ahora se eliminan.

source: Return the docstring of the given *node* (which must be a :class:`FunctionDef`, :class:`AsyncFunctionDef`, :class:`ClassDef`, or :class:`Module` node), or ``None`` if it has no docstring. If *clean* is true, clean up the docstring's indentation with :func:`inspect.cleandoc`.
ast: Retorna la cadena de caracteres de documentación del *node* dado (que debe ser un nodo :class:`FunctionDef`, :class:`AsyncFunctionDef`, :class:`ClassDef`, o :class:`Module`), o ``None`` si no tiene docstring. Si *clean* es verdadero, limpia la sangría del docstring con :func:`inspect.cleandoc`.

source: :class:`AsyncFunctionDef` is now supported.
ast: :class:`AsyncFunctionDef` ahora está soportada.

source: If *padded* is ``True``, the first line of a multi-line statement will be padded with spaces to match its original position.
ast: Si *padded* es ``True``, la primera línea de una declaración de varias líneas se rellenará con espacios para que coincidan con su posición original.

source: Increment the line number and end line number of each node in the tree starting at *node* by *n*. This is useful to "move code" to a different location in a file.
ast: Incremente el número de línea y el número de línea final de cada nodo en el árbol comenzando en *node* por *n*. Esto es útil para "mover código" a una ubicación diferente en un archivo.

source: Yield a tuple of ``(fieldname, value)`` for each field in ``node._fields`` that is present on *node*.
ast: Produce (*yield*) una tupla de ``(fieldname, value)`` para cada campo en ``node._fields`` que está presente en *node*.

source: Yield all direct child nodes of *node*, that is, all fields that are nodes and all items of fields that are lists of nodes.
ast: Cede todos los nodos secundarios directos de *node*, es decir, todos los campos que son nodos y todos los elementos de campos que son listas de nodos.

source: Recursively yield all descendant nodes in the tree starting at *node* (including *node* itself), in no specified order. This is useful if you only want to modify nodes in place and don't care about the context.
ast: Recursivamente produce todos los nodos descendientes en el árbol comenzando en *node* (incluido *node* en sí mismo), en ningún orden especificado. Esto es útil si solo desea modificar los nodos en su lugar y no le importa el contexto.

source: A node visitor base class that walks the abstract syntax tree and calls a visitor function for every node found. This function may return a value which is forwarded by the :meth:`visit` method.
ast: Una clase base de visitante de nodo que recorre el árbol de sintaxis abstracta y llama a una función de visitante para cada nodo encontrado. Esta función puede retornar un valor que se reenvía mediante el método :meth:`visit`.

source: This class is meant to be subclassed, with the subclass adding visitor methods.
ast: Esta clase está destinada a ser subclase, con la subclase agregando métodos de visitante.

source: Visit a node. The default implementation calls the method called :samp:`self.visit_{classname}` where *classname* is the name of the node class, or :meth:`generic_visit` if that method doesn't exist.
ast: Visita un nodo. La implementación predeterminada llama al método llamado :samp:`self.visit_{classname}` donde *classname* es el nombre de la clase de nodo, o :meth:`generic_visit` si ese método no existe.

source: This visitor calls :meth:`visit` on all children of the node.
ast: Este visitante llama :meth:`visit` en todos los hijos del nodo.

source: Note that child nodes of nodes that have a custom visitor method won't be visited unless the visitor calls :meth:`generic_visit` or visits them itself.
ast: Tenga en cuenta que los nodos secundarios de los nodos que tienen un método de visitante personalizado no se visitarán a menos que el visitante llame :meth:`generic_visit` o los visite a sí mismo.

source: Don't use the :class:`NodeVisitor` if you want to apply changes to nodes during traversal. For this a special visitor exists (:class:`NodeTransformer`) that allows modifications.
ast: No use :class:`NodeVisitor` si desea aplicar cambios a los nodos durante el recorrido. Para esto existe un visitante especial (:class:`NodeTransformer`) que permite modificaciones.

source: A :class:`NodeVisitor` subclass that walks the abstract syntax tree and allows modification of nodes.
ast: Una subclase de :class:`NodeVisitor` que recorre el árbol de sintaxis abstracta y permite la modificación de nodos.

source: The :class:`NodeTransformer` will walk the AST and use the return value of the visitor methods to replace or remove the old node. If the return value of the visitor method is ``None``, the node will be removed from its location, otherwise it is replaced with the return value. The return value may be the original node in which case no replacement takes place.
ast: La clase :class:`NodeTransformer` recorrerá el AST y usará el valor de retorno de los métodos del visitante para reemplazar o eliminar el nodo anterior. Si el valor de retorno del método de visitante es ``None``, el nodo se eliminará de su ubicación; de lo contrario, se reemplazará con el valor de retorno. El valor de retorno puede ser el nodo original, en cuyo caso no se realiza ningún reemplazo.

source: Here is an example transformer that rewrites all occurrences of name lookups (``foo``) to ``data['foo']``::
ast: Aquí hay un transformador de ejemplo que reescribe todas las apariciones de búsquedas de nombres (``foo``) en ``data['foo']``::

source: For nodes that were part of a collection of statements (that applies to all statement nodes), the visitor may also return a list of nodes rather than just a single node.
ast: Para los nodos que formaban parte de una colección de declaraciones (que se aplica a todos los nodos de declaración), el visitante también puede retornar una lista de nodos en lugar de solo un nodo.

source: Usually you use the transformer like this::
ast: Usualmente usas el transformador así:

source: Return a formatted dump of the tree in *node*. This is mainly useful for debugging purposes. If *annotate_fields* is true (by default), the returned string will show the names and the values for fields. If *annotate_fields* is false, the result string will be more compact by omitting unambiguous field names. Attributes such as line numbers and column offsets are not dumped by default. If this is wanted, *include_attributes* can be set to true.
ast: Retorna un volcado formateado del árbol en *node*. Esto es principalmente útil para propósitos de depuración. Si *annotate_fields* es verdadero (por defecto), la cadena de caracteres retornada mostrará los nombres y los valores de los campos. Si *annotate_fields* es falso, la cadena de resultados será más compacta omitiendo nombres de campo no ambiguos. Los atributos como los números de línea y las compensaciones de columna no se vuelcan de forma predeterminada. Si esto se desea, *include_attributes* se puede establecer en verdadero.

source: If *indent* is a non-negative integer or string, then the tree will be pretty-printed with that indent level. An indent level of 0, negative, or ``""`` will only insert newlines. ``None`` (the default) selects the single line representation. Using a positive integer indent indents that many spaces per level. If *indent* is a string (such as ``"\t"``), that string is used to indent each level.
ast: Si *indent* es un entero no negativo o una cadena de caracteres, entonces el árbol será impreso de forma linda con ese nivel de sangría. Un nivel de sangría de 0, negativo, o ``""`` solo insertará nuevas líneas. ``None`` (el valor por defecto) selecciona la representación de línea simple. Al usar un entero positivo se sangrará esa cantidad de espacios como sangría. Si *indent* es una cadena de caracteres (como ``"\t"``), esa cadena se usa para sangrar cada nivel.

source: Added the *indent* option.
ast: Añadida la opción *indent*.

source: Compiler Flags
ast: Banderas del compilador

source: The following flags may be passed to :func:`compile` in order to change effects on the compilation of a program:
ast: Los siguientes indicadores pueden pasarse a :func:`compile` para cambiar los efectos en la compilación de un programa:

source: Enables support for top-level ``await``, ``async for``, ``async with`` and async comprehensions.
ast: Habilita el soporte para ``await``, ``async for``, ``async with`` y comprensiones asíncronas de nivel superior.

source: Generates and returns an abstract syntax tree instead of returning a compiled code object.
ast: Genera y retorna un árbol de sintaxis abstracto en lugar de retornar un objeto de código compilado.

source: Enables support for :pep:`484` and :pep:`526` style type comments (``# type: <type>``, ``# type: ignore <stuff>``).
ast: Habilita el soporte para comentarios de tipo de estilo :pep:`484` y :pep:`526` (``# type: <type>``, ``# type: ignore <stuff>``).

source: Command-Line Usage
ast: Uso en línea de comandos

source: The :mod:`ast` module can be executed as a script from the command line. It is as simple as:
ast: El módulo :mod:`ast` puede ser ejecutado como un script desde la línea de comandos. Es tan simple como:

source: The following options are accepted:
ast: Las siguientes opciones son aceptadas:

source: Show the help message and exit.
ast: Muestra el mensaje de ayuda y sale.

source: Specify what kind of code must be compiled, like the *mode* argument in :func:`parse`.
ast: Especifica qué tipo de código debe ser compilado, como el argumento *mode* en :func:`parse`.

source: Don't parse type comments.
ast: No analizar los comentarios de tipo.

source: Include attributes such as line numbers and column offsets.
ast: Incluye atributos como números de línea y sangrías.

source: Indentation of nodes in AST (number of spaces).
ast: Sangría de nodos en AST (número de espacios).

source: If :file:`infile` is specified its contents are parsed to AST and dumped to stdout. Otherwise, the content is read from stdin.
ast: Si :file:`infile` es especificado, su contenido es analizado a AST y mostrado en stdout. De otra forma, el contenido es leído desde stdin.

source: `Green Tree Snakes <https://greentreesnakes.readthedocs.io/>`_, an external documentation resource, has good details on working with Python ASTs.
ast: `Green Tree Snakes <https://greentreesnakes.readthedocs.io/>`_, un recurso de documentación externo, tiene buenos detalles sobre cómo trabajar con Python AST.

source: `ASTTokens <https://asttokens.readthedocs.io/en/latest/user-guide.html>`_ annotates Python ASTs with the positions of tokens and text in the source code that generated them. This is helpful for tools that make source code transformations.
ast: `ASTTokens <https://asttokens.readthedocs.io/en/latest/user-guide.html>`_ anota ASTs de Python con la posición de tokens y texto en el código fuente que los genera. Esto es de ayuda para herramientas que hacen transformaciones de código fuente.

source: `LibCST <https://libcst.readthedocs.io/>`_ parses code as a Concrete Syntax Tree that looks like an ast tree and keeps all formatting details. It's useful for building automated refactoring (codemod) applications and linters.
ast: `LibCST <https://libcst.readthedocs.io/>`_ analiza código como Árboles de Sintaxis Concreta que se ven como ASTs y mantienen todos los detalles de formato. Es útil para construir herramientas de refactor automáticas y linters.

source: in AST grammar
ast: Gramática abstracta
