Repository: taicoding/python-docs-es
Catalog: library/*.po
Languages: ast

source: A :ref:`type alias <type-aliases>` created through the :keyword:`type` statement. ``name`` is the name of the alias, ``type_params`` is a list of :ref:`type parameters <ast-type-params>`, and ``value`` is the value of the type alias.
ast: Un alias :ref:`type alias <type-aliases>` creado mediante la sentencia :keyword:`type`. ``name`` es el nombre del alias, ``type_params`` es una lista de parámetros :ref:`type <ast-type-params>`, y ``value`` es el valor del alias de tipo.

source: Other statements which are only applicable inside functions or loops are described in other sections.
ast: Otras declaraciones que solo son aplicables dentro de funciones o bucles descritos en otras secciones.

source: Imports
ast: Importaciones

source: An import statement. ``names`` is a list of :class:`alias` nodes.
ast: Una declaración de importación. ``names`` es una lista de nodos :class:`alias`.

source: Represents ``from x import y``. ``module`` is a raw string of the 'from' name, without any leading dots, or ``None`` for statements such as ``from . import foo``. ``level`` is an integer holding the level of the relative import (0 means absolute import).
ast: Representa ``form x import y``. ``module`` es una cadena de caracteres sin formato del nombre 'from', sin puntos, o ``None`` para declaraciones como ``from . import foo``. ``level`` es un entero que contiene el nivel relativo de la importación (0 significa una importación absoluta).

source: Both parameters are raw strings of the names. ``asname`` can be ``None`` if the regular name is to be used.
ast: Ambos parámetros son cadenas de caracteres sin formato para los nombres. ``asname`` puede ser ``None`` si se va a usar el nombre regular.

source: Control flow
ast: Control de flujo

source: Optional clauses such as ``else`` are stored as an empty list if they're not present.
ast: Cláusulas opcionales como ``else`` se guardan como una lista vacía si no están presentes.

source: An ``if`` statement. ``test`` holds a single node, such as a :class:`Compare` node. ``body`` and ``orelse`` each hold a list of nodes.
ast: Una declaración ``if``. ``test`` contiene un único nodo, como un nodo :class:`Compare`. ``body`` y ``orelse`` contiene cada uno una lista de nodos.

source: ``elif`` clauses don't have a special representation in the AST, but rather appear as extra :class:`If` nodes within the ``orelse`` section of the previous one.
ast: Cláusulas ``elif`` no tienen una representación especial en AST, pero pueden aparecer como nodos extra :class:`If` dentro de la sección ``orelse`` del nodo anterior.

source: A ``for`` loop. ``target`` holds the variable(s) the loop assigns to, as a single :class:`Name`, :class:`Tuple`, :class:`List`, :class:`Attribute` or :class:`Subscript` node. ``iter`` holds the item to be looped over, again as a single node. ``body`` and ``orelse`` contain lists of nodes to execute. Those in ``orelse`` are executed if the loop finishes normally, rather than via a ``break`` statement.
ast: Un bucle ``for``. ``target`` contiene las variables a las que asigna el bucle, como un único nodo :class:`Name`, :class:`Tuple`, :class:`List`, :class:`Attribute` o :class:`Subscript`. ``iter`` contiene el elemento sobre el que se realizará el bucle, nuevamente como un solo nodo. ``body`` y ``orelse`` contienen listas de nodos para ejecutar. Los de ``orelse`` se ejecutan si el ciclo finaliza normalmente, en lugar de mediante una instrucción ``break``.

source: A ``while`` loop. ``test`` holds the condition, such as a :class:`Compare` node.
ast: Un bucle ``while``. ``test`` contiene la condición, como un nodo :class:`Compare`.

source: The ``break`` and ``continue`` statements.
ast: Las declaraciones ``break`` y ``continue``.

source: ``try`` blocks. All attributes are list of nodes to execute, except for ``handlers``, which is a list of :class:`ExceptHandler` nodes.
ast: Bloques ``try``. Todos los atributos son listas de nodos a ejecutar, excepto para ``handlers``, el cual es una lista de nodos :class:`ExceptHandler`.

source: ``try`` blocks which are followed by ``except*`` clauses. The attributes are the same as for :class:`Try` but the :class:`ExceptHandler` nodes in ``handlers`` are interpreted as ``except*`` blocks rather then ``except``.
ast: Bloques ``try`` que van seguidos de cláusulas ``except*``. Los atributos son los mismos que para :class:`Try` pero los nodos :class:`ExceptHandler` en ``handlers`` se interpretan como bloques ``except*`` en lugar de ``except``.

source: A single ``except`` clause. ``type`` is the exception type it will match, typically a :class:`Name` node (or ``None`` for a catch-all ``except:`` clause). ``name`` is a raw string for the name to hold the exception, or ``None`` if the clause doesn't have ``as foo``. ``body`` is a list of nodes.
ast: Una sola cláusula ``except``. ``type`` es el tipo de excepción con el que coincidirá, normalmente un nodo :class:`Name` (o ``None`` para una cláusula ``except:`` generalizada). ``name`` es una cadena sin formato para que el nombre contenga la excepción, o ``None`` si la cláusula no tiene ``as foo``. ``body`` es una lista de nodos.

source: A ``with`` block. ``items`` is a list of :class:`withitem` nodes representing the context managers, and ``body`` is the indented block inside the context.
ast: Un bloque ``with``. ``items`` es una lista de nodos :class:`withitem` que representan los administradores de contexto, y ``body`` es el bloque con sangría dentro del contexto.

source: A single context manager in a ``with`` block. ``context_expr`` is the context manager, often a :class:`Call` node. ``optional_vars`` is a :class:`Name`, :class:`Tuple` or :class:`List` for the ``as foo`` part, or ``None`` if that isn't used.
ast: Un administrador de contexto único en un bloque ``with``. ``context_expr`` es el administrador de contexto, a menudo un nodo :class:`Call`. ``optional_vars`` es un :class:`Name`, :class:`Tuple` o :class:`List` para la parte ``as foo``, o ``None`` si no se usa.

source: Pattern matching
ast: La coincidencia de patrones

source: A ``match`` statement. ``subject`` holds the subject of the match (the object that is being matched against the cases) and ``cases`` contains an iterable of :class:`match_case` nodes with the different cases.
ast: Una declaración ``match``. ``subject`` contiene el sujeto de la coincidencia (el objeto que se compara con los casos) y ``cases`` contiene un iterable de nodos :class:`match_case` con los diferentes casos.

source: A single case pattern in a ``match`` statement. ``pattern`` contains the match pattern that the subject will be matched against. Note that the :class:`AST` nodes produced for patterns differ from those produced for expressions, even when they share the same syntax.
ast: Un patrón de caso único en una declaración ``match``. ``pattern`` contiene el patrón de coincidencia con el que se comparará el sujeto. Tenga en cuenta que los nodos :class:`AST` producidos para patrones difieren de los producidos para expresiones, incluso cuando comparten la misma sintaxis.

source: The ``guard`` attribute contains an expression that will be evaluated if the pattern matches the subject.
ast: El atributo ``guard`` contiene una expresión que se evaluará si el patrón coincide con el sujeto.

source: ``body`` contains a list of nodes to execute if the pattern matches and the result of evaluating the guard expression is true.
ast: ``body`` contiene una lista de nodos para ejecutar si el patrón coincide y el resultado de evaluar la expresión de protección es verdadero.

source: A match literal or value pattern that compares by equality. ``value`` is an expression node. Permitted value nodes are restricted as described in the match statement documentation. This pattern succeeds if the match subject is equal to the evaluated value.
ast: Un patrón de valor o literal de coincidencia que se compara por igualdad. ``value`` es un nodo de expresión. Los nodos de valores permitidos están restringidos como se describe en la documentación de la declaración de coincidencia. Este patrón tiene éxito si el sujeto de la coincidencia es igual al valor evaluado.

source: A match literal pattern that compares by identity. ``value`` is the singleton to be compared against: ``None``, ``True``, or ``False``. This pattern succeeds if the match subject is the given constant.
ast: Un patrón literal de coincidencia que se compara por identidad. ``value`` es el singleton que se va a comparar con: ``None``, ``True`` o ``False``. Este patrón tiene éxito si el sujeto de la coincidencia es la constante dada.

source: A match sequence pattern. ``patterns`` contains the patterns to be matched against the subject elements if the subject is a sequence. Matches a variable length sequence if one of the subpatterns is a ``MatchStar`` node, otherwise matches a fixed length sequence.
ast: Un patrón de secuencia de coincidencia. ``patterns`` contiene los patrones que se compararán con los elementos del sujeto si el sujeto es una secuencia. Coincide con una secuencia de longitud variable si uno de los subpatrones es un nodo ``MatchStar``; de lo contrario, coincide con una secuencia de longitud fija.

source: Matches the rest of the sequence in a variable length match sequence pattern. If ``name`` is not ``None``, a list containing the remaining sequence elements is bound to that name if the overall sequence pattern is successful.
ast: Coincide con el resto de la secuencia en un patrón de secuencia de coincidencia de longitud variable. Si ``name`` no es ``None``, una lista que contiene los elementos de secuencia restantes está vinculada a ese nombre si el patrón de secuencia general es exitoso.

source: A match mapping pattern. ``keys`` is a sequence of expression nodes. ``patterns`` is a corresponding sequence of pattern nodes. ``rest`` is an optional name that can be specified to capture the remaining mapping elements. Permitted key expressions are restricted as described in the match statement documentation.
ast: Un patrón de mapeo de coincidencias. ``keys`` es una secuencia de nodos de expresión. ``patterns`` es una secuencia correspondiente de nodos de patrón. ``rest`` es un nombre opcional que se puede especificar para capturar los elementos de mapeo restantes. Las expresiones clave permitidas están restringidas como se describe en la documentación de la declaración de coincidencia.

source: This pattern succeeds if the subject is a mapping, all evaluated key expressions are present in the mapping, and the value corresponding to each key matches the corresponding subpattern. If ``rest`` is not ``None``, a dict containing the remaining mapping elements is bound to that name if the overall mapping pattern is successful.
ast: Este patrón tiene éxito si el sujeto es un mapeo, todas las expresiones clave evaluadas están presentes en el mapeo y el valor correspondiente a cada clave coincide con el subpatrón correspondiente. Si ``rest`` no es ``None``, un dict que contiene los elementos de mapeo restantes se vincula a ese nombre si el patrón de mapeo general es exitoso.

source: A match class pattern. ``cls`` is an expression giving the nominal class to be matched. ``patterns`` is a sequence of pattern nodes to be matched against the class defined sequence of pattern matching attributes. ``kwd_attrs`` is a sequence of additional attributes to be matched (specified as keyword arguments in the class pattern), ``kwd_patterns`` are the corresponding patterns (specified as keyword values in the class pattern).
ast: Un patrón de clase coincidente. ``cls`` es una expresión que da la clase nominal que se va a emparejar. ``patterns`` es una secuencia de nodos de patrón que se compararán con la secuencia definida por la clase de atributos de coincidencia de patrones. ``kwd_attrs`` es una secuencia de atributos adicionales que deben coincidir (especificados como argumentos de palabra clave en el patrón de clase), ``kwd_patterns`` son los patrones correspondientes (especificados como valores de palabras clave en el patrón de clase).

source: This pattern succeeds if the subject is an instance of the nominated class, all positional patterns match the corresponding class-defined attributes, and any specified keyword attributes match their corresponding pattern.
ast: Este patrón tiene éxito si el sujeto es una instancia de la clase nominada, todos los patrones posicionales coinciden con los atributos definidos por la clase correspondientes y cualquier atributo de palabra clave especificado coincide con su patrón correspondiente.

source: Note: classes may define a property that returns self in order to match a pattern node against the instance being matched. Several builtin types are also matched that way, as described in the match statement documentation.
ast: Nota: las clases pueden definir una propiedad que retorna self para hacer coincidir un nodo de patrón con la instancia que se está comparando. Varios tipos incorporados también se combinan de esa manera, como se describe en la documentación de la declaración de coincidencia.

source: A match "as-pattern", capture pattern or wildcard pattern. ``pattern`` contains the match pattern that the subject will be matched against. If the pattern is ``None``, the node represents a capture pattern (i.e a bare name) and will always succeed.
ast: Una coincidencia "como patrón", patrón de captura o patrón comodín. ``pattern`` contiene el patrón de coincidencia con el que se comparará el sujeto. Si el patrón es ``None``, el nodo representa un patrón de captura (es decir, un nombre simple) y siempre tendrá éxito.

source: The ``name`` attribute contains the name that will be bound if the pattern is successful. If ``name`` is ``None``, ``pattern`` must also be ``None`` and the node represents the wildcard pattern.
ast: El atributo ``name`` contiene el nombre que se vinculará si el patrón tiene éxito. Si ``name`` es ``None``, ``pattern`` también debe ser ``None`` y el nodo representa el patrón comodín.

source: A match "or-pattern". An or-pattern matches each of its subpatterns in turn to the subject, until one succeeds. The or-pattern is then deemed to succeed. If none of the subpatterns succeed the or-pattern fails. The ``patterns`` attribute contains a list of match pattern nodes that will be matched against the subject.
ast: Una coincidencia "o patrón". Un patrón-o hace coincidir cada uno de sus subpatrones con el sujeto, hasta que uno tiene éxito. Entonces se considera que el patrón-o tiene éxito. Si ninguno de los subpatrones tiene éxito, el patrón o falla. El atributo ``patterns`` contiene una lista de nodos de patrones de coincidencia que se compararán con el sujeto.

source: Type parameters
ast: Tipos de parámetro

source: :ref:`Type parameters <type-params>` can exist on classes, functions, and type aliases.
ast: ":ref:`Parámetros de tipo <type-params>` pueden existir en clases, funciones y tipos de alias"

source: Function and class definitions
ast: Definiciones de función y clase

source: A function definition.
ast: Una definición de función.

source: ``name`` is a raw string of the function name.
ast: ``name`` es una cadena de caracteres sin formato del nombre de la función.

source: ``args`` is an :class:`arguments` node.
ast: ``args`` es un nodo :class:`arguments`.

source: ``body`` is the list of nodes inside the function.
ast: ``body`` es la lista de nodos dentro de la función.

source: ``decorator_list`` is the list of decorators to be applied, stored outermost first (i.e. the first in the list will be applied last).
ast: ``decorator_list`` es la lista de decoradores que se aplicarán, almacenados en el exterior primero (es decir, el primero de la lista se aplicará al final).

source: ``returns`` is the return annotation.
ast: ``returns`` es la anotación de retorno.

source: ``type_params`` is a list of :ref:`type parameters <ast-type-params>`.
ast: ``type_params`` es una lista de :ref:`parametros de tipo <ast-type-params>`.

source: Added ``type_params``.
ast: Se ha añadido ``type_params``.

source: ``lambda`` is a minimal function definition that can be used inside an expression. Unlike :class:`FunctionDef`, ``body`` holds a single node.
ast: ``lambda`` es una definición de función mínima que se puede utilizar dentro de una expresión. A diferencia de :class:`FunctionDef`, ``body`` tiene un solo nodo.

source: The arguments for a function.
ast: Los argumentos para una función.

source: ``posonlyargs``, ``args`` and ``kwonlyargs`` are lists of :class:`arg` nodes.
ast: ``posonlyargs``, ``args`` y ``kwonlyargs`` son listas de nodos :class:`arg`.

source: ``vararg`` and ``kwarg`` are single :class:`arg` nodes, referring to the ``*args, **kwargs`` parameters.
ast: ``vararg`` y ``kwarg`` son nodos :class:`arg` únicos, en referencia a los parámetros ``*args, **kwargs``.

source: ``kw_defaults`` is a list of default values for keyword-only arguments. If one is ``None``, the corresponding argument is required.
ast: ``kw_defaults`` es una lista de valores predeterminados para argumentos de solo palabras clave. Si uno es ``None``, se requiere el argumento correspondiente.

source: ``defaults`` is a list of default values for arguments that can be passed positionally. If there are fewer defaults, they correspond to the last n arguments.
ast: ``defaults`` es una lista de valores predeterminados para argumentos que se pueden pasar posicionalmente. Si hay menos valores predeterminados, corresponden a los últimos n argumentos.

source: ``type_comment`` is an optional string with the type annotation as a comment
ast: ``type_comment`` es una cadena opcional con la anotación de tipo como comentario

source: A ``return`` statement.
ast: Una declaración ``return``.

source: ``global`` and ``nonlocal`` statements. ``names`` is a list of raw strings.
ast: Declaraciones ``global`` y ``nonlocal``. ``names`` es una lista de cadenas sin formato.

source: A class definition.
ast: Una definición de clase.

source: ``name`` is a raw string for the class name
ast: ``name`` es una cadena sin formato para el nombre de la clase

source: ``bases`` is a list of nodes for explicitly specified base classes.
ast: ``bases`` es una lista de nodos para clases base especificadas explícitamente.

source: ``body`` is a list of nodes representing the code within the class definition.
ast: ``body`` es una lista de nodos que representan el código dentro de la definición de clase.

source: ``decorator_list`` is a list of nodes, as in :class:`FunctionDef`.
ast: ``decorator_list`` es una lista de nodos, como en :class:`FunctionDef`.

source: Async and await
ast: Async y await

source: An ``async def`` function definition. Has the same fields as :class:`FunctionDef`.
ast: Una definición de función ``async def``. Tiene los mismos campos que :class:`FunctionDef`.

source: An ``await`` expression. ``value`` is what it waits for. Only valid in the body of an :class:`AsyncFunctionDef`.
ast: Una expresión ``await``. ``value`` es lo que espera. Solo válido en el cuerpo de un :class:`AsyncFunctionDef`.

source: ``async for`` loops and ``async with`` context managers. They have the same fields as :class:`For` and :class:`With`, respectively. Only valid in the body of an :class:`AsyncFunctionDef`.
ast: Bucles ``async for`` y administradores de contexto ``async with``. Tienen los mismos campos que :class:`For` y :class:`With`, respectivamente. Solo válido en el cuerpo de un :class:`AsyncFunctionDef`.

source: When a string is parsed by :func:`ast.parse`, operator nodes (subclasses of :class:`ast.operator`, :class:`ast.unaryop`, :class:`ast.cmpop`, :class:`ast.boolop` and :class:`ast.expr_context`) on the returned tree will be singletons. Changes to one will be reflected in all other occurrences of the same value (e.g. :class:`ast.Add`).
ast: Cuando :func:`ast.parse` analiza una cadena, los nodos de operador (subclases de :class:`ast.operator`, :class:`ast.unaryop`, :class:`ast.cmpop`, :class:`ast.boolop` y :class:`ast.expr_context`) en el árbol retornado serán singletons. Los cambios en uno se reflejarán en todas las demás ocurrencias del mismo valor (por ejemplo, :class:`ast.Add`).

source: :mod:`ast` Helpers
ast: Ayudantes de :mod:`ast`

source: Apart from the node classes, the :mod:`ast` module defines these utility functions and classes for traversing abstract syntax trees:
ast: Además de las clases de nodo, el módulo :mod:`ast` define estas funciones y clases de utilidad para atravesar árboles de sintaxis abstracta:

source: In addition, if ``mode`` is ``'func_type'``, the input syntax is modified to correspond to :pep:`484` "signature type comments", e.g. ``(str, int) -> List[str]``.
ast: Además, si ``modo`` es ``'func_type'``, la sintaxis de entrada se modifica para corresponder a :pep:`484` "comentarios de tipo de firma", por ejemplo ``(str, int) -> List[str]``.

source: Note that successfully parsing source code into an AST object doesn't guarantee that the source code provided is valid Python code that can be executed as the compilation step can raise further :exc:`SyntaxError` exceptions. For instance, the source ``return 42`` generates a valid AST node for a return statement, but it cannot be compiled alone (it needs to be inside a function node).
ast: Tenga en cuenta que analizar correctamente el código fuente en un objeto AST no garantiza que el código fuente proporcionado sea un código Python válido que se pueda ejecutar, ya que el paso de compilación puede lanzar más excepciones :exc:`SyntaxError`. Por ejemplo, la fuente ``return 42`` genera un nodo AST válido para una declaración de retorno, pero no se puede compilar solo (debe estar dentro de un nodo de función).

source: In particular, :func:`ast.parse` won't do any scoping checks, which the compilation step does.
ast: En particular, :func:`ast.parse` no realizará ninguna verificación de alcance, lo que hace el paso de compilación.

source: It is possible to crash the Python interpreter with a sufficiently large/complex string due to stack depth limitations in Python's AST compiler.
ast: Es posible bloquear el intérprete de Python con una cadena de caracteres suficientemente grande/compleja debido a las limitaciones de profundidad de pila en el compilador AST de Python.

source: Added ``type_comments``, ``mode='func_type'`` and ``feature_version``.
ast: Se agregaron ``type_comments``, ``mode='func_type'`` y ``feature_version``.

source: Unparse an :class:`ast.AST` object and generate a string with code that would produce an equivalent :class:`ast.AST` object if parsed back with :func:`ast.parse`.
ast: Analice un objeto :class:`ast.AST` y genere una cadena con código que produciría un objeto :class:`ast.AST` equivalente si se analiza con :func:`ast.parse`.

source: The produced code string will not necessarily be equal to the original code that generated the :class:`ast.AST` object (without any compiler optimizations, such as constant tuples/frozensets).
ast: La cadena de código producida no será necesariamente igual al código original que generó el objeto :class:`ast.AST` (sin ninguna optimización del compilador, como tuplas constantes / frozensets).

source: Trying to unparse a highly complex expression would result with :exc:`RecursionError`.
ast: Intentar descomprimir una expresión muy compleja daría como resultado :exc:`RecursionError`.
