Repository: taicoding/python-docs-es
Catalog: library/copy.po
Languages: es_co

source: **Source code:** :source:`Lib/copy.py`
es_co: **Código fuente:** :source:`Lib/copy.py`

source: Assignment statements in Python do not copy objects, they create bindings between a target and an object. For collections that are mutable or contain mutable items, a copy is sometimes needed so one can change one copy without changing the other. This module provides generic shallow and deep copy operations (explained below).
es_co: Las declaraciones de asignación en Python no copian objetos, crean enlaces entre un objetivo y un objeto. Para colecciones que son mutables o que contienen elementos mutables, a veces se necesita una copia para que uno pueda cambiar una copia sin cambiar la otra. Este módulo proporciona operaciones genéricas de copia superficial y profunda (explicadas a continuación).

source: Interface summary:
es_co: Resumen de la interfaz:

source: Raised for module specific errors.
es_co: Levantado para errores específicos del módulo.

source: The difference between shallow and deep copying is only relevant for compound objects (objects that contain other objects, like lists or class instances):
es_co: La diferencia entre copia superficial y profunda solo es relevante para objetos compuestos (objetos que contienen otros objetos, como listas o instancias de clase):

source: A *shallow copy* constructs a new compound object and then (to the extent possible) inserts *references* into it to the objects found in the original.
es_co: Una copia superficial (*shallow copy*) construye un nuevo objeto compuesto y luego (en la medida de lo posible) inserta *references* en él a los objetos encontrados en el original.

source: A *deep copy* constructs a new compound object and then, recursively, inserts *copies* into it of the objects found in the original.
es_co: Una copia profunda (*deep copy*) construye un nuevo objeto compuesto y luego, recursivamente, inserta *copias* en él de los objetos encontrados en el original.

source: Two problems often exist with deep copy operations that don't exist with shallow copy operations:
es_co: A menudo existen dos problemas con las operaciones de copia profunda que no existen con las operaciones de copia superficial:

source: Recursive objects (compound objects that, directly or indirectly, contain a reference to themselves) may cause a recursive loop.
es_co: Los objetos recursivos (objetos compuestos que, directa o indirectamente, contienen una referencia a sí mismos) pueden causar un bucle recursivo.

source: Because deep copy copies everything it may copy too much, such as data which is intended to be shared between copies.
es_co: Debido a que la copia profunda copia todo, puede copiar demasiado, como los datos que deben compartirse entre copias.

source: The :func:`deepcopy` function avoids these problems by:
es_co: La función :func:`deepcopy` evita estos problemas al:

source: keeping a ``memo`` dictionary of objects already copied during the current copying pass; and
es_co: mantener un diccionario ``memo`` de objetos ya copiados durante la aprobación de copia actual; y

source: letting user-defined classes override the copying operation or the set of components copied.
es_co: permitiendo que las clases definidas por el usuario anulen la operación de copia o el conjunto de componentes copiados.

source: This module does not copy types like module, method, stack trace, stack frame, file, socket, window, or any similar types. It does "copy" functions and classes (shallow and deeply), by returning the original object unchanged; this is compatible with the way these are treated by the :mod:`pickle` module.
es_co: Este módulo no copia tipos como módulo, método, seguimiento de pila, marco de pila, archivo, socket, ventana, o cualquier tipo similar. Sí "copia" funciones y clases (superficiales y profundas), retornando el objeto original sin cambios; Esto es compatible con la forma en que son tratados por el módulo :mod:`pickle`.

source: Shallow copies of dictionaries can be made using :meth:`dict.copy`, and of lists by assigning a slice of the entire list, for example, ``copied_list = original_list[:]``.
es_co: Se pueden hacer copias superficiales de los diccionarios usando :meth:`dict.copy`, y de las listas mediante la asignación de una porción de la lista completa, por ejemplo, ``lista_copiada = lista_original[:]``.

source: Classes can use the same interfaces to control copying that they use to control pickling. See the description of module :mod:`pickle` for information on these methods. In fact, the :mod:`copy` module uses the registered pickle functions from the :mod:`copyreg` module.
es_co: Las clases pueden usar las mismas interfaces para controlar la copia que usan para controlar el *pickling*. Consulte la descripción del módulo :mod:`pickle` para obtener información sobre estos métodos. De hecho, el módulo :mod:`copy` utiliza las funciones de *pickle* registradas del módulo :mod:`copyreg`.

source: Module :mod:`pickle`
es_co: Módulo :mod:`pickle`

source: Discussion of the special methods used to support object state retrieval and restoration.
es_co: Discusión de los métodos especiales utilizados para apoyar la recuperación y restauración del estado del objeto.

source: module
es_co: módulo

source: __copy__() (copy protocol)
es_co: __copy__() (protocolo de copia)

source: __deepcopy__() (copy protocol)
es_co: __deepcopy__() (protocolo de copia)
