Repository: taicoding/python-docs-es
Catalog: using/cmdline.po
Languages: es_ar

source: The *lineno* field matches the line number, where zero matches all line numbers and is thus equivalent to an omitted line number.
es_ar: El campo *lineno* coincide con el número de línea, donde cero corresponde a todos los números de línea y, por lo tanto, es equivalente a número de línea omitido.

source: Multiple :option:`-W` options can be given; when a warning matches more than one option, the action for the last matching option is performed. Invalid :option:`-W` options are ignored (though, a warning message is printed about invalid options when the first warning is issued).
es_ar: Se pueden dar varias opciones :option:`-W`; cuando una advertencia coincide con más de una opción, se realiza la acción para la última opción de coincidencia. Las opciones invalidas :option:`-W` son ignoradas (aunque se imprime un mensaje de advertencia sobre opciones no válidas cuando se emite la primera advertencia).

source: Warnings can also be controlled using the :envvar:`PYTHONWARNINGS` environment variable and from within a Python program using the :mod:`warnings` module. For example, the :func:`warnings.filterwarnings` function can be used to use a regular expression on the warning message.
es_ar: Las advertencias también se pueden controlar utilizando la variable de entorno :envvar:`PYTHONWARNINGS` y desde un programa Python utilizando el módulo :mod:`warnings`. Por ejemplo, la función :func:`warnings.filterwarnings` puede ser usarse con una expresión regular en el mensaje de advertencia.

source: See :ref:`warning-filter` and :ref:`describing-warning-filters` for more details.
es_ar: Consulte :ref:`warning-filter` y :ref:`describing-warning-filters` para obtener más detalles.

source: Skip the first line of the source, allowing use of non-Unix forms of ``#!cmd``. This is intended for a DOS specific hack only.
es_ar: Omita la primera línea de la fuente, permitiendo el uso de formas que no sean de Unix de ``#!cmd``. Esto está destinado a un hackeo específico de DOS solamente.

source: Reserved for various implementation-specific options. CPython currently defines the following possible values:
es_ar: Reservado para varias opciones específicas de la implementación. CPython define actualmente los siguientes valores posibles:

source: ``-X faulthandler`` to enable :mod:`faulthandler`. See also :envvar:`PYTHONFAULTHANDLER`.
es_ar: ``-X faulthandler`` para habilitar :mod:`faulthandler`. Véase :envvar:`PYTHONFAULTHANDLER` para obtener más información.

source: ``-X showrefcount`` to output the total reference count and number of used memory blocks when the program finishes or after each statement in the interactive interpreter. This only works on :ref:`debug builds <debug-build>`.
es_ar: ``-X showrefcount`` para generar el recuento total de referencias y el número de bloques de memoria utilizados cuando finalice el programa o después de cada instrucción en el intérprete interactivo. Esto sólo funciona en :ref:`compilaciones de depuración <debug-build>`.

source: ``-X tracemalloc`` to start tracing Python memory allocations using the :mod:`tracemalloc` module. By default, only the most recent frame is stored in a traceback of a trace. Use ``-X tracemalloc=NFRAME`` to start tracing with a traceback limit of *NFRAME* frames. See :func:`tracemalloc.start` and :envvar:`PYTHONTRACEMALLOC` for more information.
es_ar: ``-X tracemalloc`` para iniciar el seguimiento de las asignaciones de memoria de Python mediante el módulo :mod:`tracemalloc`. De forma predeterminada, solo el marco más reciente se almacena en un seguimiento de un seguimiento. Utilice ``-X tracemalloc=NFRAME`` para iniciar el seguimiento con un límite de rastreo de marcos *NFRAME*. Consulte el :func:`tracemalloc.start` y :envvar:`PYTHONTRACEMALLOC` para obtener más información.

source: ``-X int_max_str_digits`` configures the :ref:`integer string conversion length limitation <int_max_str_digits>`. See also :envvar:`PYTHONINTMAXSTRDIGITS`.
es_ar: ``-X int_max_str_digits`` configura la :ref:`limitación de longitud de conversión de cadena de tipo entero <int_max_str_digits>`. Véase también :envvar:`PYTHONINTMAXSTRDIGITS`.

source: ``-X importtime`` to show how long each import takes. It shows module name, cumulative time (including nested imports) and self time (excluding nested imports). Note that its output may be broken in multi-threaded application. Typical usage is ``python3 -X importtime -c 'import asyncio'``. See also :envvar:`PYTHONPROFILEIMPORTTIME`.
es_ar: ``-X importtime`` para mostrar cuánto tiempo tarda cada importación. Muestra el nombre del módulo, el tiempo acumulado (incluidas las importaciones anidadas) y el tiempo de autoestima (excluyendo las importaciones anidadas). Tenga en cuenta que su salida puede romperse en aplicaciones multiproceso. El uso típico es ``python3 -X importtime -c 'import asyncio'``. Véase también :envvar:`PYTHONPROFILEIMPORTTIME`.

source: ``-X utf8`` enables the :ref:`Python UTF-8 Mode <utf8-mode>`. ``-X utf8=0`` explicitly disables :ref:`Python UTF-8 Mode <utf8-mode>` (even when it would otherwise activate automatically). See also :envvar:`PYTHONUTF8`.
es_ar: ``-X utf8`` habilita el :ref:`modo Python UTF-8 <utf8-mode>`. ``-X utf8=0`` desactiva explícitamente el :ref:`modo Python UTF-8 <utf8-mode>` (incluso cuando al contrario se activaría automáticamente). Véase :envvar:`PYTHONUTF8`.

source: ``-X pycache_prefix=PATH`` enables writing ``.pyc`` files to a parallel tree rooted at the given directory instead of to the code tree. See also :envvar:`PYTHONPYCACHEPREFIX`.
es_ar: ``-X pycache_prefix=PATH`` permite escribir archivos ``.pyc`` en un árbol paralelo enraizado en el directorio dado en lugar de en el árbol de código. Véase también :envvar:`PYTHONPYCACHEPREFIX`.

source: ``-X warn_default_encoding`` issues a :class:`EncodingWarning` when the locale-specific default encoding is used for opening files. See also :envvar:`PYTHONWARNDEFAULTENCODING`.
es_ar: ``-X warn_default_encoding`` emite un :class:`EncodingWarning` cuando se usa la codificación predeterminada específica de la configuración regional para abrir archivos. Vea también :envvar:`PYTHONWARNDEFAULTENCODING`.

source: ``-X no_debug_ranges`` disables the inclusion of the tables mapping extra location information (end line, start column offset and end column offset) to every instruction in code objects. This is useful when smaller code objects and pyc files are desired as well as suppressing the extra visual location indicators when the interpreter displays tracebacks. See also :envvar:`PYTHONNODEBUGRANGES`.
es_ar: ``-X no_debug_ranges`` deshabilita la inclusión de tablas que asignan información de ubicación adicional (línea final, desplazamiento de columna inicial y desplazamiento de columna final) a cada instrucción en los objetos de código. Esto es útil cuando se desean objetos de código más pequeños y archivos pyc, además de suprimir los indicadores de ubicación visuales adicionales cuando el intérprete muestra rastreos. Véase también :envvar:`PYTHONNODEBUGRANGES`.

source: ``-X perf`` enables support for the Linux ``perf`` profiler. When this option is provided, the ``perf`` profiler will be able to report Python calls. This option is only available on some platforms and will do nothing if is not supported on the current system. The default value is "off". See also :envvar:`PYTHONPERFSUPPORT` and :ref:`perf_profiling`.
es_ar: ``-X perf`` habilita el soporte para el perfilador ``perf`` de Linux. Cuando se proporciona esta opción, el perfilador ``perf`` podrá informar llamadas de Python. Esta opción sólo está disponible en algunas plataformas y no hará nada si no es compatible con el sistema actual. El valor predeterminado es "off". Consulte también :envvar:`PYTHONPERFSUPPORT` y :ref:`perf_profiling`.

source: It also allows passing arbitrary values and retrieving them through the :data:`sys._xoptions` dictionary.
es_ar: También permite pasar valores arbitrarios y recuperarlos a través del diccionario :data:`sys._xoptions`.

source: Options you shouldn't use
es_ar: Opciones que no se deben usar

source: Reserved for use by Jython_.
es_ar: Reservado para su uso por Jython_.

source: Environment variables
es_ar: Variables de entorno

source: These environment variables influence Python's behavior, they are processed before the command-line switches other than -E or -I. It is customary that command-line switches override environmental variables where there is a conflict.
es_ar: Estas variables de entorno influyen en el comportamiento de Python, se procesan antes de que los modificadores de línea de comandos distintos de -E o -I. Es habitual que los modificadores de línea de comandos anulen variables de entorno donde hay un conflicto.

source: Change the location of the standard Python libraries. By default, the libraries are searched in :file:`{prefix}/lib/python{version}` and :file:`{exec_prefix}/lib/python{version}`, where :file:`{prefix}` and :file:`{exec_prefix}` are installation-dependent directories, both defaulting to :file:`/usr/local`.
es_ar: Cambie la ubicación de las bibliotecas estándar de Python. De forma predeterminada, las bibliotecas se buscan en :file:`{prefix}/lib/python{version}` y :file:`{exec_prefix}/lib/python{version}`, donde :file:`{prefix}` y :file:`{exec_prefix}` son directorios dependientes de la instalación, ambos predeterminados :file:`/usr/local`.

source: When :envvar:`PYTHONHOME` is set to a single directory, its value replaces both :file:`{prefix}` and :file:`{exec_prefix}`. To specify different values for these, set :envvar:`PYTHONHOME` to :file:`{prefix}:{exec_prefix}`.
es_ar: Cuando :envvar:`PYTHONHOME` se establece en un único directorio, su valor reemplaza tanto al :file:`{prefix}` como a :file:`{exec_prefix}`. Para especificar valores diferentes para estos, establezca :envvar:`PYTHONHOME` en :file:`{prefix}:{exec_prefix}`.

source: Augment the default search path for module files. The format is the same as the shell's :envvar:`PATH`: one or more directory pathnames separated by :data:`os.pathsep` (e.g. colons on Unix or semicolons on Windows). Non-existent directories are silently ignored.
es_ar: Aumente la ruta de búsqueda predeterminada para los archivos de módulo. El formato es el mismo que el de shell :envvar:`PATH`: uno o más nombres de ruta de directorio separados por :data:`os.pathsep` (por ejemplo, dos puntos en Unix o punto y coma en Windows). Los directorios inexistentes se omiten silenciosamente.

source: In addition to normal directories, individual :envvar:`PYTHONPATH` entries may refer to zipfiles containing pure Python modules (in either source or compiled form). Extension modules cannot be imported from zipfiles.
es_ar: Además de los directorios normales, las entradas individuales :envvar:`PYTHONPATH` pueden referirse a archivos zip que contienen módulos Python puros (ya sea en forma de origen o compilado). Los módulos de extensión no se pueden importar desde zipfiles.

source: The default search path is installation dependent, but generally begins with :file:`{prefix}/lib/python{version}` (see :envvar:`PYTHONHOME` above). It is *always* appended to :envvar:`PYTHONPATH`.
es_ar: La ruta de búsqueda predeterminada depende de la instalación, pero generalmente comienza con :file:`{prefix}/lib/python{version}` (consulte :envvar:`PYTHONHOME` arriba). Es *always* anexado a :envvar:`PYTHONPATH`.

source: An additional directory will be inserted in the search path in front of :envvar:`PYTHONPATH` as described above under :ref:`using-on-interface-options`. The search path can be manipulated from within a Python program as the variable :data:`sys.path`.
es_ar: Se insertará un directorio adicional en la ruta de búsqueda delante de :envvar:`PYTHONPATH` como se describió anteriormente en :ref:`using-on-interface-options`. La ruta de búsqueda se puede manipular desde un programa Python como la variable :data:`sys.path`.

source: If this is set to a non-empty string, don't prepend a potentially unsafe path to :data:`sys.path`: see the :option:`-P` option for details.
es_ar: Si se establece en una cadena no vacía, no anteponga una ruta potencialmente insegura a :data:`sys.path`: véase la opción :option:`-u` para más información.

source: If this is set to a non-empty string, it overrides the :data:`sys.platlibdir` value.
es_ar: Si se establece en una cadena no vacía, anula el valor :data:`sys.platlibdir`.

source: If this is the name of a readable file, the Python commands in that file are executed before the first prompt is displayed in interactive mode. The file is executed in the same namespace where interactive commands are executed so that objects defined or imported in it can be used without qualification in the interactive session. You can also change the prompts :data:`sys.ps1` and :data:`sys.ps2` and the hook :data:`sys.__interactivehook__` in this file.
es_ar: Si este es el nombre de un archivo legible, los comandos de Python de ese archivo se ejecutan antes de que el primer mensaje se muestre en modo interactivo. El archivo se ejecuta en el mismo espacio de nombres donde se ejecutan comandos interactivos para que los objetos definidos o importados en él se puedan usar sin calificación en la sesión interactiva. También puede cambiar las solicitudes :data:`sys.ps1` y :data:`sys.ps2` y el enlace :data:`sys.__interactivehook__` en este archivo.

source: Raises an :ref:`auditing event <auditing>` ``cpython.run_startup`` with the filename as the argument when called on startup.
es_ar: Lanza :ref:`auditing event <auditing>` ``cpython.run_startup`` con el nombre de archivo como argumento cuando se llama al inicio.

source: If this is set to a non-empty string it is equivalent to specifying the :option:`-O` option. If set to an integer, it is equivalent to specifying :option:`-O` multiple times.
es_ar: Si se establece en una cadena no vacía, equivale a especificar la opción :option:`-O`. Si se establece en un entero, es equivalente a especificar :option:`-O` varias veces.

source: If this is set, it names a callable using dotted-path notation. The module containing the callable will be imported and then the callable will be run by the default implementation of :func:`sys.breakpointhook` which itself is called by built-in :func:`breakpoint`. If not set, or set to the empty string, it is equivalent to the value "pdb.set_trace". Setting this to the string "0" causes the default implementation of :func:`sys.breakpointhook` to do nothing but return immediately.
es_ar: Si se establece, nombra un nombre que se puede llamar mediante la notación de trayecto de puntos. El módulo que contiene el invocable se importará y, a continuación, el invocable se ejecutará por la implementación predeterminada de :func:`sys.breakpointhook` que a su vez se llama por incorporado :func:`breakpoint`. Si no se establece o se establece en la cadena vacía, es equivalente al valor "pdb.set_trace". Establecer esto en la cadena "0" hace que la implementación predeterminada de :func:`sys.breakpointhook` no haga nada más que retornar inmediatamente.

source: If this is set to a non-empty string it is equivalent to specifying the :option:`-d` option. If set to an integer, it is equivalent to specifying :option:`-d` multiple times.
es_ar: Si se establece en una cadena no vacía, equivale a especificar la opción :option:`-d`. Si se establece en un entero, equivale a especificar :option:`-d` varias veces.

source: This environment variable requires a :ref:`debug build of Python <debug-build>`, otherwise it's ignored.
es_ar: Esta variable de entorno necesita una :ref:`compilación de depuración de Python <debug-build>`, de lo contrario será ignorada.

source: If this is set to a non-empty string it is equivalent to specifying the :option:`-i` option.
es_ar: Si se establece en una cadena no vacía, equivale a especificar la opción :option:`-i`.

source: This variable can also be modified by Python code using :data:`os.environ` to force inspect mode on program termination.
es_ar: Esta variable también se puede modificar mediante código Python mediante :data:`os.environ` para forzar el modo de inspección en la terminación del programa.

source: If this is set to a non-empty string it is equivalent to specifying the :option:`-u` option.
es_ar: Si se establece en una cadena no vacía, equivale a especificar la opción :option:`-u`.

source: If this is set to a non-empty string it is equivalent to specifying the :option:`-v` option. If set to an integer, it is equivalent to specifying :option:`-v` multiple times.
es_ar: Si se establece en una cadena no vacía, equivale a especificar la opción :option:`-v`. Si se establece en un entero, equivale a especificar :option:`-v` varias veces.

source: If this is set, Python ignores case in :keyword:`import` statements. This only works on Windows and macOS.
es_ar: Si se establece, Python omite mayúsculas y minúsculas en las instrucciones :keyword:`import`. Esto sólo funciona en Windows y macOS.

source: If this is set to a non-empty string, Python won't try to write ``.pyc`` files on the import of source modules. This is equivalent to specifying the :option:`-B` option.
es_ar: Si se establece en una cadena no vacía, Python no intentará escribir archivos ``.pyc`` en la importación de módulos de origen. Esto equivale a especificar la opción :option:`-B`.

source: If this is set, Python will write ``.pyc`` files in a mirror directory tree at this path, instead of in ``__pycache__`` directories within the source tree. This is equivalent to specifying the :option:`-X` ``pycache_prefix=PATH`` option.
es_ar: Si se establece, Python escribirá archivos ``.pyc`` en un árbol de directorios reflejado en esta ruta de acceso, en lugar de en directorios ``__pycache__`` dentro del árbol de origen. Esto equivale a especificar la opción :option:`-X` ``pycache_prefix=PATH``.

source: If this variable is not set or set to ``random``, a random value is used to seed the hashes of str and bytes objects.
es_ar: Si esta variable no se establece o se establece en ``random``, se utiliza un valor aleatorio para sembrar los hashes de los objetos str y bytes.

source: If :envvar:`PYTHONHASHSEED` is set to an integer value, it is used as a fixed seed for generating the hash() of the types covered by the hash randomization.
es_ar: Si :envvar:`PYTHONHASHSEED` se establece en un valor entero, se utiliza como una semilla fija para generar el hash() de los tipos cubiertos por la aleatorización hash.

source: Its purpose is to allow repeatable hashing, such as for selftests for the interpreter itself, or to allow a cluster of python processes to share hash values.
es_ar: Su propósito es permitir el hash repetible, como para las autocomprobaciónes para el propio intérprete, o permitir que un grupo de procesos python comparta valores hash.

source: The integer must be a decimal number in the range [0,4294967295]. Specifying the value 0 will disable hash randomization.
es_ar: El entero debe ser un número decimal en el intervalo [0,4294967295]. Especificar el valor 0 deshabilitará la aleatorización de hash.

source: If this variable is set to an integer, it is used to configure the interpreter's global :ref:`integer string conversion length limitation <int_max_str_digits>`.
es_ar: Si esta variable se establece en un número entero, se utiliza para configurar la :ref:`limitación de longitud de conversión de cadena entera <int_max_str_digits>`.

source: If this is set before running the interpreter, it overrides the encoding used for stdin/stdout/stderr, in the syntax ``encodingname:errorhandler``. Both the ``encodingname`` and the ``:errorhandler`` parts are optional and have the same meaning as in :func:`str.encode`.
es_ar: Si se establece antes de ejecutar el intérprete, invalida la codificación utilizada para stdin/stdout/stderr, en la sintaxis ``encodingname:errorhandler``. Tanto las partes ``encodingname`` como ``:errorhandler`` son opcionales y tienen el mismo significado que en :func:`str.encode`.

source: For stderr, the ``:errorhandler`` part is ignored; the handler will always be ``'backslashreplace'``.
es_ar: Para stderr, se omite la parte ``:errorhandler``; el manejador siempre será ``'backslashreplace'``.

source: The ``encodingname`` part is now optional.
es_ar: La parte ``encodingname`` ahora es opcional.

source: On Windows, the encoding specified by this variable is ignored for interactive console buffers unless :envvar:`PYTHONLEGACYWINDOWSSTDIO` is also specified. Files and pipes redirected through the standard streams are not affected.
es_ar: En Windows, la codificación especificada por esta variable se omite para los búferes de consola interactivos a menos que también se especifique :envvar:`PYTHONLEGACYWINDOWSSTDIO`. Los archivos y canalizaciones redirigidos a través de las corrientes estándar no se ven afectados.

source: If this is set, Python won't add the :data:`user site-packages directory <site.USER_SITE>` to :data:`sys.path`.
es_ar: Si se establece, Python no agregará :data:`user site-packages directory <site.USER_SITE>` a :data:`sys.path`.

source: Defines the :data:`user base directory <site.USER_BASE>`, which is used to compute the path of the :data:`user site-packages directory <site.USER_SITE>` and :ref:`installation paths <sysconfig-user-scheme>` for ``python -m pip install --user``.
es_ar: Define el :data:`user base directory <site.USER_BASE>`, que se utiliza para calcular la ruta de acceso de :data:`user site-packages directory <site.USER_SITE>` y :ref:`installation paths <sysconfig-user-scheme>` para ``python -m pie install --user``.

source: If this environment variable is set, ``sys.argv[0]`` will be set to its value instead of the value got through the C runtime. Only works on macOS.
es_ar: Si se establece esta variable de entorno, ``sys.argv[0]`` se establecerá en su valor en lugar del valor conseguido a través del tiempo de ejecución de C. Sólo funciona en macOS.

source: This is equivalent to the :option:`-W` option. If set to a comma separated string, it is equivalent to specifying :option:`-W` multiple times, with filters later in the list taking precedence over those earlier in the list.
es_ar: Esto es equivalente a la opción :option:`-W`. Si se establece en una cadena separada por comas, es equivalente a especificar :option:`-W` varias veces, con filtros más adelante en la lista que tienen prioridad sobre los anteriores de la lista.

source: If this environment variable is set to a non-empty string, start tracing Python memory allocations using the :mod:`tracemalloc` module. The value of the variable is the maximum number of frames stored in a traceback of a trace. For example, ``PYTHONTRACEMALLOC=1`` stores only the most recent frame. See the :func:`tracemalloc.start` function for more information. This is equivalent to setting the :option:`-X` ``tracemalloc`` option.
es_ar: Si esta variable de entorno se establece en una cadena no vacía, comience a trazar las asignaciones de memoria de Python mediante el módulo :mod:`tracemalloc`. El valor de la variable es el número máximo de marcos almacenados en un rastreo de un seguimiento. Por ejemplo, ``PYTHONTRACEMALLOC=1`` almacena sólo el marco más reciente. Consulte la función :func:`tracemalloc.start` para obtener más información. Esto equivale a configurar la opción :option:`-X` ``tracemalloc``.

source: If this environment variable is set to a non-empty string, Python will show how long each import takes. This is equivalent to setting the :option:`-X` ``importtime`` option.
es_ar: Si esta variable de entorno se establece en una cadena no vacía, Python mostrará cuánto tiempo tarda cada importación. Esto equivale exactamente a establecer :option:`-X` ``importtime`` en la línea de comandos.
