Repository: taicoding/python-docs-es
Catalog: using/cmdline.po
Languages: es_ar

source: Command line and environment
es_ar: Línea de comandos y entorno

source: The CPython interpreter scans the command line and the environment for various settings.
es_ar: El intérprete de CPython analiza la línea de comandos y el entorno en busca de varias configuraciones.

source: Other implementations' command line schemes may differ. See :ref:`implementations` for further resources.
es_ar: Los esquemas de línea de comandos de otras implementaciones pueden diferir. Véase :ref:`implementations` para obtener más recursos.

source: Command line
es_ar: Línea de comando

source: When invoking Python, you may specify any of these options::
es_ar: Al invocar Python, puede especificar cualquiera de estas opciones::

source: The most common use case is, of course, a simple invocation of a script::
es_ar: El caso de uso más común es, por supuesto, una simple invocación de un script::

source: Interface options
es_ar: Opciones de interfaz

source: The interpreter interface resembles that of the UNIX shell, but provides some additional methods of invocation:
es_ar: La interfaz del intérprete es similar a la del shell UNIX, pero proporciona algunos métodos adicionales de invocación:

source: When called with a file name argument or with a file as standard input, it reads and executes a script from that file.
es_ar: Cuando se llama con un argumento de nombre de archivo o con un archivo como entrada estándar, lee y ejecuta un script de ese archivo.

source: When called with a directory name argument, it reads and executes an appropriately named script from that directory.
es_ar: Cuando se llama con un argumento de nombre de directorio, lee y ejecuta un script con el nombre adecuado desde ese directorio.

source: When called with ``-c command``, it executes the Python statement(s) given as *command*. Here *command* may contain multiple statements separated by newlines. Leading whitespace is significant in Python statements!
es_ar: Cuando se llama con ``-c comando``, ejecuta las instrucciones de Python dadas como *command*. Aquí *comando* puede contener varias instrucciones separadas por nuevas líneas. ¡El espacio en blanco principal es significativo en las instrucciones de Python!

source: When called with ``-m module-name``, the given module is located on the Python module path and executed as a script.
es_ar: Cuando se llama con ``-m module-name``, el módulo dado se encuentra en la ruta del módulo Python y se ejecuta como un script.

source: In non-interactive mode, the entire input is parsed before it is executed.
es_ar: En el modo no interactivo, toda la entrada se analiza antes de ejecutarse.

source: An interface option terminates the list of options consumed by the interpreter, all consecutive arguments will end up in :data:`sys.argv` -- note that the first element, subscript zero (``sys.argv[0]``), is a string reflecting the program's source.
es_ar: Una opción de interfaz termina la lista de opciones consumidas por el intérprete, todos los argumentos consecutivos terminarán en :data:`sys.argv` -- tenga en cuenta que el primer elemento, subíndice cero (``sys.argv[0]``), es una cadena que refleja el origen del programa.

source: Execute the Python code in *command*. *command* can be one or more statements separated by newlines, with significant leading whitespace as in normal module code.
es_ar: Ejecute el código de Python en *comando*. *comando* puede ser una o más sentencias separadas por nuevas líneas, con espacio en blanco inicial significativo como en el código normal del módulo.

source: If this option is given, the first element of :data:`sys.argv` will be ``"-c"`` and the current directory will be added to the start of :data:`sys.path` (allowing modules in that directory to be imported as top level modules).
es_ar: Si se proporciona esta opción, el primer elemento de :data:`sys.argv` será ``"-c"`` y el directorio actual se agregará al inicio de :data:`sys.path` (permitiendo que los módulos de ese directorio se importen como módulos de nivel superior).

source: Raises an :ref:`auditing event <auditing>` ``cpython.run_command`` with argument ``command``.
es_ar: Lanza un :ref:`auditing event <auditing>` ``cpython.run_command`` con el argumento ``command``.

source: Search :data:`sys.path` for the named module and execute its contents as the :mod:`__main__` module.
es_ar: Busque :data:`sys.path` para el módulo con nombre y ejecute su contenido como el módulo :mod:`__main__`.

source: Since the argument is a *module* name, you must not give a file extension (``.py``). The module name should be a valid absolute Python module name, but the implementation may not always enforce this (e.g. it may allow you to use a name that includes a hyphen).
es_ar: Dado que el argumento es un nombre *módulo*, no debe dar una extensión de archivo (``.py``). El nombre del módulo debe ser un nombre de módulo Python absoluto válido, pero es posible que la implementación no siempre lo aplique (por ejemplo, puede permitirle usar un nombre que incluya un guión).

source: Package names (including namespace packages) are also permitted. When a package name is supplied instead of a normal module, the interpreter will execute ``<pkg>.__main__`` as the main module. This behaviour is deliberately similar to the handling of directories and zipfiles that are passed to the interpreter as the script argument.
es_ar: También se permiten los nombres de paquetes (incluidos los paquetes de espacio de nombres). Cuando se proporciona un nombre de paquete en lugar de un módulo normal, el intérprete ejecutará ``<pkg>.__main__`` como módulo principal. Este comportamiento es deliberadamente similar al manejo de directorios y archivos zip que se pasan al intérprete como argumento del script.

source: This option cannot be used with built-in modules and extension modules written in C, since they do not have Python module files. However, it can still be used for precompiled modules, even if the original source file is not available.
es_ar: Esta opción no se puede utilizar con módulos integrados y módulos de extensión escritos en C, ya que no tienen archivos de módulo Python. Sin embargo, todavía se puede utilizar para módulos precompilados, incluso si el archivo de origen original no está disponible.

source: If this option is given, the first element of :data:`sys.argv` will be the full path to the module file (while the module file is being located, the first element will be set to ``"-m"``). As with the :option:`-c` option, the current directory will be added to the start of :data:`sys.path`.
es_ar: Si se da esta opción, el primer elemento de :data:`sys.argv` será la ruta de acceso completa al archivo de módulo (mientras se encuentra el archivo de módulo, el primer elemento se establecerá en ``"-m"``). Al igual que con la opción :option:`-c`, el directorio actual se agregará al inicio de :data:`sys.path`.

source: Many standard library modules contain code that is invoked on their execution as a script. An example is the :mod:`timeit` module::
es_ar: Muchos módulos de biblioteca estándar contienen código que se invoca en su ejecución como script. Un ejemplo es el módulo :mod:`timeit`::

source: Raises an :ref:`auditing event <auditing>` ``cpython.run_module`` with argument ``module-name``.
es_ar: Retorna un :ref:`auditing event <auditing>` ``cpython.run_module`` con el argumento ``nombre-módulo``.

source: Equivalent functionality directly available to Python code
es_ar: Funcionalidad equivalente directamente disponible para el código Python

source: :pep:`338` -- Executing modules as scripts
es_ar: :pep:`338` -- Ejecución de módulos como scripts

source: Supply the package name to run a ``__main__`` submodule.
es_ar: Proporcione el nombre del paquete para ejecutar un submódulo ``__main__``.

source: namespace packages are also supported
es_ar: paquetes de espacio de nombres también son compatibles

source: Read commands from standard input (:data:`sys.stdin`). If standard input is a terminal, :option:`-i` is implied.
es_ar: Leer comandos de entrada estándar (:data:`sys.stdin`). Si la entrada estándar es un terminal, :option:`-i` está implícita.

source: If this option is given, the first element of :data:`sys.argv` will be ``"-"`` and the current directory will be added to the start of :data:`sys.path`.
es_ar: Si se da esta opción, el primer elemento de :data:`sys.argv` será ``"-"`` y el directorio actual se agregará al inicio de :data:`sys.path`.

source: Raises an :ref:`auditing event <auditing>` ``cpython.run_stdin`` with no arguments.
es_ar: Lanza un evento :ref:`auditing event <auditing>` ``cpython.run_stdin`` sin argumentos.

source: Execute the Python code contained in *script*, which must be a filesystem path (absolute or relative) referring to either a Python file, a directory containing a ``__main__.py`` file, or a zipfile containing a ``__main__.py`` file.
es_ar: Ejecute el código Python contenido en *script*, que debe ser una ruta de acceso del sistema de archivos (absoluta o relativa) que haga referencia a un archivo Python, un directorio que contenga un archivo ``__main__.py`` o un archivo zip que contenga un archivo ``__main__.py``.

source: If this option is given, the first element of :data:`sys.argv` will be the script name as given on the command line.
es_ar: Si se proporciona esta opción, el primer elemento de :data:`sys.argv` será el nombre del script como se indica en la línea de comandos.

source: If the script name refers directly to a Python file, the directory containing that file is added to the start of :data:`sys.path`, and the file is executed as the :mod:`__main__` module.
es_ar: Si el nombre del script hace referencia directamente a un archivo Python, el directorio que contiene ese archivo se agrega al inicio de :data:`sys.path`, y el archivo se ejecuta como el módulo :mod:`__main__`.

source: If the script name refers to a directory or zipfile, the script name is added to the start of :data:`sys.path` and the ``__main__.py`` file in that location is executed as the :mod:`__main__` module.
es_ar: Si el nombre del script hace referencia a un directorio o zipfile, el nombre del script se agrega al inicio de :data:`sys.path` y el archivo ``__main__.py`` en esa ubicación se ejecuta como el módulo :mod:`__main__`.

source: Raises an :ref:`auditing event <auditing>` ``cpython.run_file`` with argument ``filename``.
es_ar: Lanza un :ref:`auditing event <auditing>` ``cpython.run_file`` con el argumento ``filename``.

source: If no interface option is given, :option:`-i` is implied, ``sys.argv[0]`` is an empty string (``""``) and the current directory will be added to the start of :data:`sys.path`. Also, tab-completion and history editing is automatically enabled, if available on your platform (see :ref:`rlcompleter-config`).
es_ar: Si no se da ninguna opción de interfaz, :option:`-i` está implícita, ``sys.argv[0]`` es una cadena vacía (``"``) y el directorio actual se agregará al inicio de :data:`sys.path`. Además, la finalización de tabulación y la edición del historial se habilitan automáticamente, si están disponibles en su plataforma (consulte :ref:`rlcompleter-config`).

source: Automatic enabling of tab-completion and history editing.
es_ar: Habilitación automática de la finalización de pestañas y edición del historial.

source: Generic options
es_ar: Opciones genéricas

source: Print a short description of all command line options and corresponding environment variables and exit.
es_ar: Imprime una breve descripción de todas las opciones de la línea de comandos.

source: Print a short description of Python-specific environment variables and exit.
es_ar: Imprima una breve descripción de las variables de entorno específicas de Python y salga.

source: Print a description of implementation-specific :option:`-X` options and exit.
es_ar: Imprima una descripción de las opciones :option:`-X` específicas de la implementación y salga.

source: Print complete usage information and exit.
es_ar: Imprima información completa de uso y salga.

source: Print the Python version number and exit. Example output could be:
es_ar: Imprima el número de versión de Python y salga. Ejemplo de salida podría ser:

source: When given twice, print more information about the build, like:
es_ar: Cuando se le dé dos veces, imprima más información sobre la compilación, como:

source: The ``-VV`` option.
es_ar: La opción ``-VV``.

source: Miscellaneous options
es_ar: Opciones diversas

source: If given, Python won't try to write ``.pyc`` files on the import of source modules. See also :envvar:`PYTHONDONTWRITEBYTECODE`.
es_ar: Si se da, Python no intentará escribir archivos ``.pyc`` en la importación de módulos de origen. Véase también :envvar:`PYTHONDONTWRITEBYTECODE`.

source: Control the validation behavior of hash-based ``.pyc`` files. See :ref:`pyc-invalidation`. When set to ``default``, checked and unchecked hash-based bytecode cache files are validated according to their default semantics. When set to ``always``, all hash-based ``.pyc`` files, whether checked or unchecked, are validated against their corresponding source file. When set to ``never``, hash-based ``.pyc`` files are not validated against their corresponding source files.
es_ar: Controle el comportamiento de validación de los archivos ``.pyc`` basados en hash. Véase :ref:`pyc-invalidation`. Cuando se establece en ``default``, los archivos de caché de código de bytes basados en hash marcados y desmarcados se validan según su semántica predeterminada. Cuando se establece en ``always``, todos los archivos basados en hash ``.pyc``, ya estén marcados o desmarcados, se validan con su archivo de origen correspondiente. Cuando se establece en ``never``, los archivos basados en hash ``.pyc`` no se validan con sus archivos de origen correspondientes.

source: The semantics of timestamp-based ``.pyc`` files are unaffected by this option.
es_ar: Esta opción no afecta a la semántica de los archivos ``.pyc`` basados en la marca de tiempo.

source: Turn on parser debugging output (for expert only). See also the :envvar:`PYTHONDEBUG` environment variable.
es_ar: Activa la salida de depuración (solo para expertos, dependiendo de las opciones de compilación). Véase también la variable de ambiente :envvar:`PYTHONDEBUG`.

source: This option requires a :ref:`debug build of Python <debug-build>`, otherwise it's ignored.
es_ar: Esta opción necesita una :ref:`compilación de depuración de Python <debug-build>`, de lo contrario será ignorado.

source: See also the :option:`-P` and :option:`-I` (isolated) options.
es_ar: Véase también las opciones :option:`-P` e :option:`-I` (aisladas).

source: When a script is passed as first argument or the :option:`-c` option is used, enter interactive mode after executing the script or the command, even when :data:`sys.stdin` does not appear to be a terminal. The :envvar:`PYTHONSTARTUP` file is not read.
es_ar: Cuando se pasa un script como primer argumento o se utiliza la opción :option:`-c`, entre en modo interactivo después de ejecutar el script o el comando, incluso cuando :data:`sys.stdin` no parece ser un terminal. El archivo :envvar:`PYTHONSTARTUP` no se lee.

source: This can be useful to inspect global variables or a stack trace when a script raises an exception. See also :envvar:`PYTHONINSPECT`.
es_ar: Esto puede ser útil para inspeccionar variables globales o un seguimiento de pila cuando un script lanza una excepción. Véase también :envvar:`PYTHONINSPECT`.

source: Run Python in isolated mode. This also implies :option:`-E`, :option:`-P` and :option:`-s` options.
es_ar: Ejecute Python en modo aislado. Esto también implica las opciones :option:`-E`, :option:`-P` y :option:`-s`.

source: Remove assert statements and any code conditional on the value of :const:`__debug__`. Augment the filename for compiled (:term:`bytecode`) files by adding ``.opt-1`` before the ``.pyc`` extension (see :pep:`488`). See also :envvar:`PYTHONOPTIMIZE`.
es_ar: Quite las instrucciones assert y cualquier código condicionado al valor de :const:`__debug__`. Aumente el nombre de archivo para los archivos compilados (:term:`bytecode`) agregando ``.opt-1`` antes de la extensión ``.pyc`` (consulte :pep:`488`). Véase también :envvar:`PYTHONOPTIMIZE`.

source: Modify ``.pyc`` filenames according to :pep:`488`.
es_ar: Modifique los nombres de archivo ``.pyc`` según :pep:`488`.

source: Do :option:`-O` and also discard docstrings. Augment the filename for compiled (:term:`bytecode`) files by adding ``.opt-2`` before the ``.pyc`` extension (see :pep:`488`).
es_ar: Haga :option:`-O` y también deseche las docstrings. Aumente el nombre de archivo para los archivos compilados (:term:`bytecode`) agregando ``.opt-2`` antes de la extensión ``.pyc`` (consulte :pep:`488`).

source: Don't prepend a potentially unsafe path to :data:`sys.path`:
es_ar: No anteponga una ruta potencialmente insegura a :data:`sys.path`:

source: ``python -m module`` command line: Don't prepend the current working directory.
es_ar: ``python -m module`` command line: No anteponga el directorio de trabajo actual.

source: ``python script.py`` command line: Don't prepend the script's directory. If it's a symbolic link, resolve symbolic links.
es_ar: ``python script.py`` command line: No anteponga el directorio del script. Si es un enlace simbólico, resuelva los enlaces simbólicos.

source: ``python -c code`` and ``python`` (REPL) command lines: Don't prepend an empty string, which means the current working directory.
es_ar: ``python -c code`` y ``python`` (REPL) command lines: No anteponga una cadena vacía, lo que significa el directorio de trabajo actual.

source: See also the :envvar:`PYTHONSAFEPATH` environment variable, and :option:`-E` and :option:`-I` (isolated) options.
es_ar: Consulte también la variable de entorno :envvar:`PYTHONSAFEPATH` y las opciones :option:`-E` y :option:`-I` (aisladas).

source: Don't display the copyright and version messages even in interactive mode.
es_ar: No muestres los mensajes de copyright y versión incluso en modo interactivo.

source: Turn on hash randomization. This option only has an effect if the :envvar:`PYTHONHASHSEED` environment variable is set to ``0``, since hash randomization is enabled by default.
es_ar: Active la aleatorización de hash. Esta opción solo tiene efecto si la variable de entorno :envvar:`PYTHONHASHSEED` está establecida en ``0``, ya que la aleatorización de hash está habilitada de forma predeterminada.

source: :envvar:`PYTHONHASHSEED` allows you to set a fixed value for the hash seed secret.
es_ar: :envvar:`PYTHONHASHSEED` le permite establecer un valor fijo para el secreto de inicialización hash.

source: The option is no longer ignored.
es_ar: La opción ya no se omite.

source: Don't add the :data:`user site-packages directory <site.USER_SITE>` to :data:`sys.path`.
es_ar: No agregue el :data:`user site-packages directory <site.USER_SITE>` a :data:`sys.path`.

source: :pep:`370` -- Per user site-packages directory
es_ar: :pep:`370` -- Directorio de paquetes de sitio por usuario

source: Disable the import of the module :mod:`site` and the site-dependent manipulations of :data:`sys.path` that it entails. Also disable these manipulations if :mod:`site` is explicitly imported later (call :func:`site.main` if you want them to be triggered).
es_ar: Deshabilite la importación del módulo :mod:`site` y las manipulaciones dependientes del sitio de :data:`sys.path` que conlleva. También deshabilite estas manipulaciones si :mod:`site` se importa explícitamente más tarde (llame a :func:`site.main` si desea que se activen).

source: Force the stdout and stderr streams to be unbuffered. This option has no effect on the stdin stream.
es_ar: Forzar que las corrientes stdout y stderr no estén en búfer. Esta opción no tiene ningún efecto en la secuencia stdin.

source: See also :envvar:`PYTHONUNBUFFERED`.
es_ar: Véase también :envvar:`PYTHONUNBUFFERED`.

source: The text layer of the stdout and stderr streams now is unbuffered.
es_ar: La capa de texto de las secuencias stdout y stderr ahora no está en búfer.

source: Print a message each time a module is initialized, showing the place (filename or built-in module) from which it is loaded. When given twice (:option:`!-vv`), print a message for each file that is checked for when searching for a module. Also provides information on module cleanup at exit.
es_ar: Imprime un mensaje cada vez que se inicialice un módulo, mostrando el lugar (nombre de archivo o módulo integrado) desde el que se carga. Cuando se le pasa dos veces (:option:`!-vv`), imprime un mensaje para cada archivo que se comprueba al buscar un módulo. También proporciona información sobre la limpieza del módulo en la salida.

source: The :mod:`site` module reports the site-specific paths and :file:`.pth` files being processed.
es_ar: El módulo :mod:`site` informa las rutas específicas del sitio y los archivos :file:`.pth` que se están procesando.

source: See also :envvar:`PYTHONVERBOSE`.
es_ar: Véase también :envvar:`PYTHONVERBOSE`.

source: Warning control. Python's warning machinery by default prints warning messages to :data:`sys.stderr`.
es_ar: Control de advertencia. La maquinaria de advertencia de Python por defecto imprime mensajes de advertencia en :data:`sys.stderr`.

source: The simplest settings apply a particular action unconditionally to all warnings emitted by a process (even those that are otherwise ignored by default)::
es_ar: La configuración más sencilla aplica una acción determinada incondicionalmente a todas las advertencias emitidas por un proceso (incluso aquellas que de otro modo se ignoran de forma predeterminada)::

source: The action names can be abbreviated as desired and the interpreter will resolve them to the appropriate action name. For example, ``-Wi`` is the same as ``-Wignore``.
es_ar: Los nombres de acción se pueden abreviar como se desee y el intérprete los resolverá con el nombre de acción adecuado. Por ejemplo, ``-Wi`` es lo mismo que ``-Wignore``.

source: The full form of argument is::
es_ar: La forma completa del argumento es::

source: Empty fields match all values; trailing empty fields may be omitted. For example ``-W ignore::DeprecationWarning`` ignores all DeprecationWarning warnings.
es_ar: Los campos vacíos cuadran con todos los valores; los campos vacíos finales pueden omitirse. Por ejemplo, ``-W ignore::DeprecationWarning`` ignora todas las advertencias de DeprecationWarning.

source: The *action* field is as explained above but only applies to warnings that match the remaining fields.
es_ar: El campo *action* es como se explicó anteriormente, pero solo se aplica a las advertencias que coinciden con los campos restantes.

source: The *message* field must match the whole warning message; this match is case-insensitive.
es_ar: El campo *message* debe coincidir con el mensaje de advertencia completo; esta coincidencia no distingue entre mayúsculas y minúsculas.

source: The *category* field matches the warning category (ex: ``DeprecationWarning``). This must be a class name; the match test whether the actual warning category of the message is a subclass of the specified warning category.
es_ar: El campo *category* coincide con la categoría de advertencia (por ej. ``DeprecationWarning``). Debe ser un nombre de clase; la coincidencia prueba si la categoría de advertencia real del mensaje es una subclase de la categoría de advertencia especificada.

source: The *module* field matches the (fully qualified) module name; this match is case-sensitive.
es_ar: El campo *module* coincide con el nombre de dominio completo del módulo; esta coincidencia distingue entre mayúsculas y minúsculas.
