Repository: taicoding/python-docs-es
Catalog: using/cmdline.po
Languages: es_ar

source: If this environment variable is set to a non-empty string, enable the :ref:`debug mode <asyncio-debug-mode>` of the :mod:`asyncio` module.
es_ar: Si esta variable de entorno se establece en una cadena no vacía, habilite el modo :ref:`debug mode <asyncio-debug-mode>` del módulo :mod:`asyncio`.

source: Set the Python memory allocators and/or install debug hooks.
es_ar: Establezca los asignadores de memoria de Python y/o instale enlaces de depuración.

source: Set the family of memory allocators used by Python:
es_ar: Establezca la familia de asignadores de memoria utilizados por Python:

source: ``default``: use the :ref:`default memory allocators <default-memory-allocators>`.
es_ar: ``default``: utilice :ref:`default memory allocators <default-memory-allocators>`.

source: ``malloc``: use the :c:func:`malloc` function of the C library for all domains (:c:macro:`PYMEM_DOMAIN_RAW`, :c:macro:`PYMEM_DOMAIN_MEM`, :c:macro:`PYMEM_DOMAIN_OBJ`).
es_ar: ``malloc``: utilice la función :c:func:`malloc` de la biblioteca C para todos los dominios (:c:macro:`PYMEM_DOMAIN_RAW`, :c:macro:`PYMEM_DOMAIN_MEM`, :c:macro:`PYMEM_DOMAIN_OBJ`).

source: ``pymalloc``: use the :ref:`pymalloc allocator <pymalloc>` for :c:macro:`PYMEM_DOMAIN_MEM` and :c:macro:`PYMEM_DOMAIN_OBJ` domains and use the :c:func:`malloc` function for the :c:macro:`PYMEM_DOMAIN_RAW` domain.
es_ar: ``pymalloc``: utilice el :ref:`pymalloc allocator <pymalloc>` para :c:macro:`PYMEM_DOMAIN_MEM` y dominios :c:macro:`PYMEM_DOMAIN_OBJ` y utilice la función :c:func:`malloc` para el dominio :c:macro:`PYMEM_DOMAIN_RAW`.

source: Install :ref:`debug hooks <pymem-debug-hooks>`:
es_ar: Instalar :ref:`enlaces de depuración <pymem-debug-hooks>`:

source: ``debug``: install debug hooks on top of the :ref:`default memory allocators <default-memory-allocators>`.
es_ar: ``debug``: instale los enlaces de depuración encima de :ref:`default memory allocators <default-memory-allocators>`.

source: ``malloc_debug``: same as ``malloc`` but also install debug hooks.
es_ar: ``malloc_debug``: igual que ``malloc`` pero también instalar ganchos de depuración.

source: ``pymalloc_debug``: same as ``pymalloc`` but also install debug hooks.
es_ar: ``pymalloc_debug``: igual que ``pymalloc`` pero también instalar enlaces de depuración.

source: Added the ``"default"`` allocator.
es_ar: Se ha añadido el asignador ``"predeterminado"``.

source: If set to a non-empty string, Python will print statistics of the :ref:`pymalloc memory allocator <pymalloc>` every time a new pymalloc object arena is created, and on shutdown.
es_ar: Si se establece en una cadena no vacía, Python imprimirá estadísticas de :ref:`pymalloc memory allocator <pymalloc>` cada vez que se crea una nueva arena de objetos pymalloc y al apagarse.

source: This variable is ignored if the :envvar:`PYTHONMALLOC` environment variable is used to force the :c:func:`malloc` allocator of the C library, or if Python is configured without ``pymalloc`` support.
es_ar: Esta variable se omite si la variable de entorno :envvar:`PYTHONMALLOC` se utiliza para forzar el asignador :c:func:`malloc` de la biblioteca C, o si Python está configurado sin compatibilidad con ``pymalloc``.

source: This variable can now also be used on Python compiled in release mode. It now has no effect if set to an empty string.
es_ar: Esta variable ahora también se puede utilizar en Python compilado en modo de versión. Ahora no tiene ningún efecto si se establece en una cadena vacía.

source: If set to a non-empty string, the default :term:`filesystem encoding and error handler` mode will revert to their pre-3.6 values of 'mbcs' and 'replace', respectively. Otherwise, the new defaults 'utf-8' and 'surrogatepass' are used.
es_ar: Si se establece en una cadena no vacía, el :term:`filesystem encoding and error handler` predeterminado volverá a sus valores pre-3.6 de `mbcs` y `replace`, respectivamente. De lo contrario, se utilizan los nuevos valores predeterminados 'utf-8' y 'surrogatepass'.

source: See :pep:`529` for more details.
es_ar: Consulte :pep:`529` para obtener más detalles.

source: If set to a non-empty string, does not use the new console reader and writer. This means that Unicode characters will be encoded according to the active console code page, rather than using utf-8.
es_ar: Si se establece en una cadena no vacía, no utiliza el nuevo lector y escritor de consola. Esto significa que los caracteres Unicode se codificarán de acuerdo con la página de códigos de la consola activa, en lugar de usar utf-8.

source: This variable is ignored if the standard streams are redirected (to files or pipes) rather than referring to console buffers.
es_ar: Esta variable se omite si se redirigen las secuencias estándar (a archivos o canalizaciones) en lugar de hacer referencia a búferes de consola.

source: If set to the value ``0``, causes the main Python command line application to skip coercing the legacy ASCII-based C and POSIX locales to a more capable UTF-8 based alternative.
es_ar: Si se establece en el valor ``0``, hace que la aplicación principal de línea de comandos de Python omita la coerción de las configuraciones regionales C y POSIX basadas en ASCII heredadas a una alternativa basada en UTF-8 más capaz.

source: If this variable is *not* set (or is set to a value other than ``0``), the ``LC_ALL`` locale override environment variable is also not set, and the current locale reported for the ``LC_CTYPE`` category is either the default ``C`` locale, or else the explicitly ASCII-based ``POSIX`` locale, then the Python CLI will attempt to configure the following locales for the ``LC_CTYPE`` category in the order listed before loading the interpreter runtime:
es_ar: Si esta variable es *no* establecida (o se establece en un valor distinto de ``0``), tampoco se establece la variable de entorno de invalidación local ``LC_ALL``, y la configuración local actual notificada para la categoría ``LC_CTYPE`` es la configuración local ``C`` predeterminada, o bien la configuración local basada explícitamente en ASCII ``POSIX``, entonces la CLI de Python intentará configurar las siguientes configuraciones locales para la categoría ``LC_CTYPE`` en el orden indicado antes de cargar el tiempo de ejecución del intérprete:

source: If setting one of these locale categories succeeds, then the ``LC_CTYPE`` environment variable will also be set accordingly in the current process environment before the Python runtime is initialized. This ensures that in addition to being seen by both the interpreter itself and other locale-aware components running in the same process (such as the GNU ``readline`` library), the updated setting is also seen in subprocesses (regardless of whether or not those processes are running a Python interpreter), as well as in operations that query the environment rather than the current C locale (such as Python's own :func:`locale.getdefaultlocale`).
es_ar: Si la configuración de una de estas categorías de configuración local se realiza correctamente, la variable de entorno ``LC_CTYPE`` también se establecerá en consecuencia en el entorno de proceso actual antes de que se inicialice el tiempo de ejecución de Python. Esto garantiza que, además de ser visto tanto por el propio intérprete como por otros componentes compatibles con la configuración local que se ejecutan en el mismo proceso (como la biblioteca GNU ``readline``), la configuración actualizada también se ve en los subprocesos (independientemente de si esos procesos están ejecutando o no un intérprete de Python), así como en las operaciones que consultan el entorno en lugar de la configuración regional de C actual (como la propia de Python :func:`locale.getdefaultlocale`).

source: Configuring one of these locales (either explicitly or via the above implicit locale coercion) automatically enables the ``surrogateescape`` :ref:`error handler <error-handlers>` for :data:`sys.stdin` and :data:`sys.stdout` (:data:`sys.stderr` continues to use ``backslashreplace`` as it does in any other locale). This stream handling behavior can be overridden using :envvar:`PYTHONIOENCODING` as usual.
es_ar: La configuración de una de estas configuraciones regionales (ya sea explícitamente o a través de la coerción de configuración regional implícita anterior) habilita automáticamente el ``surrogateescape`` :ref:`error handler <error-handlers>` para :data:`sys.stdin` y :data:`sys.stdout` (:data:`sys.stderr` continúa utilizando ``backslashreplace`` como lo hace en cualquier otra configuración local). Este comportamiento de control de secuencias se puede invalidar mediante :envvar:`PYTHONIOENCODING` como de costumbre.

source: For debugging purposes, setting ``PYTHONCOERCECLOCALE=warn`` will cause Python to emit warning messages on ``stderr`` if either the locale coercion activates, or else if a locale that *would* have triggered coercion is still active when the Python runtime is initialized.
es_ar: Para fines de depuración, establecer ``PYTHONCOERCECLOCALE-warn`` hará que Python emita mensajes de advertencia en ``stderr`` si se activa la coerción de configuración regional, o si una configuración regional que *would* ha activado la coerción sigue activa cuando se inicializa el tiempo de ejecución de Python.

source: Also note that even when locale coercion is disabled, or when it fails to find a suitable target locale, :envvar:`PYTHONUTF8` will still activate by default in legacy ASCII-based locales. Both features must be disabled in order to force the interpreter to use ``ASCII`` instead of ``UTF-8`` for system interfaces.
es_ar: También tenga en cuenta que incluso cuando la coerción de configuración regional está desactivada, o cuando no puede encontrar una configuración regional de destino adecuada, :envvar:`PYTHONUTF8` se activará de forma predeterminada en las configuraciones regionales heredadas basadas en ASCII. Ambas funciones deben estar deshabilitadas para obligar al intérprete a usar ``ASCII`` en lugar de ``UTF-8`` para las interfaces del sistema.

source: See :pep:`538` for more details.
es_ar: Consulte :pep:`538` para obtener más detalles.

source: If this environment variable is set to a non-empty string, enable :ref:`Python Development Mode <devmode>`, introducing additional runtime checks that are too expensive to be enabled by default. This is equivalent to setting the :option:`-X` ``dev`` option.
es_ar: Si esta variable de entorno se establece en una cadena no vacía, habilite :ref:`Python Development Mode <devmode>`, introduciendo comprobaciones de tiempo de ejecución adicionales que son demasiado caras para habilitarse de forma predeterminada. Esto equivale a configurar la opción :option:`-X` ``dev``.

source: If set to ``1``, enable the :ref:`Python UTF-8 Mode <utf8-mode>`.
es_ar: Si se establece en ``1``, habilita el :ref:`modo Python UTF-8 <utf8-mode>`.

source: If set to ``0``, disable the :ref:`Python UTF-8 Mode <utf8-mode>`.
es_ar: Si se establece en ``0``, deshabilita el :ref:`modo Python UTF-8 <utf8-mode>`.

source: Setting any other non-empty string causes an error during interpreter initialisation.
es_ar: Establecer cualquier otra cadena no vacía produce un error durante la inicialización del intérprete.

source: If this environment variable is set to a non-empty string, issue a :class:`EncodingWarning` when the locale-specific default encoding is used.
es_ar: Si esta variable de entorno se establece como una cadena de caracteres no vacía, emite un :class:`EncodingWarning` cuando se utilice la codificación predeterminada específica de la configuración regional.

source: See :ref:`io-encoding-warning` for details.
es_ar: Ver :ref:`io-encoding-warning` para más detalles.

source: If this variable is set, it disables the inclusion of the tables mapping extra location information (end line, start column offset and end column offset) to every instruction in code objects. This is useful when smaller code objects and pyc files are desired as well as suppressing the extra visual location indicators when the interpreter displays tracebacks.
es_ar: Si se establece esta variable, deshabilita la inclusión de tablas que asignan información de ubicación adicional (línea final, desplazamiento de columna inicial y desplazamiento de columna final) a cada instrucción en los objetos de código. Esto es útil cuando se desean objetos de código más pequeños y archivos pyc, además de suprimir los indicadores de ubicación visuales adicionales cuando el intérprete muestra rastreos.

source: If this variable is set to a nonzero value, it enables support for the Linux ``perf`` profiler so Python calls can be detected by it.
es_ar: Si esta variable se establece en un valor distinto de cero, habilita la compatibilidad con el perfilador ``perf`` de Linux para que pueda detectar las llamadas de Python.

source: If set to ``0``, disable Linux ``perf`` profiler support.
es_ar: Si se establece en ``0``, deshabilite la compatibilidad con el generador de perfiles ``perf`` de Linux.

source: See also the :option:`-X perf <-X>` command-line option and :ref:`perf_profiling`.
es_ar: Consulte también la opción de línea de comandos :option:`-X perf <-X>` y :ref:`perf_profiling`.

source: Debug-mode variables
es_ar: Variables de modo de depuración

source: If set, Python will dump objects and reference counts still alive after shutting down the interpreter.
es_ar: Si se establece, Python volcará objetos y recuentos de referencias aún vivos después de apagar el intérprete.
