Repository: taicoding/python-docs-es
Catalog: howto/enum.po
Languages: es_us

source: only canonical flags are returned during iteration::
es_us: solo se retornan banderas canónicas durante la iteración:

source: negating a flag or flag set returns a new flag/flag set with the corresponding positive integer value::
es_us: negar una bandera o un conjunto de banderas retorna una nueva bandera/conjunto de banderas con el valor entero positivo correspondiente:

source: names of pseudo-flags are constructed from their members' names::
es_us: los nombres de las pseudo-banderas se construyen a partir de los nombres de sus miembros:

source: >>> (Color.RED | Color.GREEN).name 'RED|GREEN' >>> class Perm(IntFlag): ... R = 4 ... W = 2 ... X = 1 ... >>> (Perm.R & Perm.W).name is None # effectively Perm(0) True
es_us: >>> (Color.RED | Color.GREEN).name 'RED|GREEN' >>> class Perm(IntFlag): ... R = 4 ... W = 2 ... X = 1 ... >>> (Perm.R & Perm.W).name is None # efectivamente Perm(0) True

source: multi-bit flags, aka aliases, can be returned from operations::
es_us: las banderas de varios bits, también conocidas como alias, se pueden devolver desde las operaciones:

source: membership / containment checking: zero-valued flags are always considered to be contained::
es_us: comprobación de pertenencia / contención: las banderas de valor cero siempre se consideran contenidas:

source: otherwise, only if all bits of one flag are in the other flag will True be returned::
es_us: de lo contrario, solo si todos los bits de una bandera están en la otra bandera, se devolverá True:

source: There is a new boundary mechanism that controls how out-of-range / invalid bits are handled: ``STRICT``, ``CONFORM``, ``EJECT``, and ``KEEP``:
es_us: Hay un nuevo mecanismo de límite que controla cómo se manejan los bits no válidos/fuera de rango: ``STRICT``, ``CONFORM``, ``EJECT`` y ``KEEP``:

source: STRICT --> raises an exception when presented with invalid values
es_us: STRICT --> lanza una excepción cuando se presentan valores no válidos

source: CONFORM --> discards any invalid bits
es_us: CONFORM --> descarta cualquier bit inválido

source: EJECT --> lose Flag status and become a normal int with the given value
es_us: EJECT -> pierde el estado de la bandera y se convierte en un int normal con el valor dado

source: KEEP --> keep the extra bits
es_us: KEEP --> mantener los bits adicionales

source: keeps Flag status and extra bits
es_us: mantiene el estado de la bandera y bits adicionales

source: extra bits do not show up in iteration
es_us: los bits adicionales no aparecen en la iteración

source: extra bits do show up in repr() and str()
es_us: bits adicionales aparecen en repr() y str()

source: The default for Flag is ``STRICT``, the default for ``IntFlag`` is ``EJECT``, and the default for ``_convert_`` is ``KEEP`` (see ``ssl.Options`` for an example of when ``KEEP`` is needed).
es_us: El valor predeterminado para Flag es ``STRICT``, el valor predeterminado para ``IntFlag`` es ``EJECT`` y el valor predeterminado para ``_convert_`` es ``KEEP`` (consulte ``ssl.Options`` para ver un ejemplo de cuándo se necesita ``KEEP``).

source: How are Enums and Flags different?
es_us: ¿En qué se diferencian las Enumeraciones (Enums) y las Banderas (Flags)?

source: Enums have a custom metaclass that affects many aspects of both derived :class:`Enum` classes and their instances (members).
es_us: Las enumeraciones tienen una metaclase personalizada que afecta a muchos aspectos de las clases :class:`Enum` derivadas y sus instancias (miembros).

source: Enum Classes
es_us: Clases de enumeración

source: The :class:`EnumType` metaclass is responsible for providing the :meth:`__contains__`, :meth:`__dir__`, :meth:`__iter__` and other methods that allow one to do things with an :class:`Enum` class that fail on a typical class, such as ``list(Color)`` or ``some_enum_var in Color``. :class:`EnumType` is responsible for ensuring that various other methods on the final :class:`Enum` class are correct (such as :meth:`__new__`, :meth:`__getnewargs__`, :meth:`__str__` and :meth:`__repr__`).
es_us: La metaclase :class:`EnumType` es responsable de proporcionar :meth:`__contains__`, :meth:`__dir__`, :meth:`__iter__` y otros métodos que permiten hacer cosas con una clase :class:`Enum` que fallan en una clase típica, como ``list(Color)`` o ``some_enum_var in Color``. :class:`EnumType` es responsable de garantizar que varios otros métodos en la clase :class:`Enum` final sean correctos (como :meth:`__new__`, :meth:`__getnewargs__`, :meth:`__str__` y :meth:`__repr__`).

source: Flag Classes
es_us: Clases de Banderas

source: Flags have an expanded view of aliasing: to be canonical, the value of a flag needs to be a power-of-two value, and not a duplicate name. So, in addition to the :class:`Enum` definition of alias, a flag with no value (a.k.a. ``0``) or with more than one power-of-two value (e.g. ``3``) is considered an alias.
es_us: Las banderas tienen una vista ampliada de la creación de alias: para ser canónico, el valor de una bandera debe ser un valor de potencia de dos y no un nombre duplicado. Por lo tanto, además de la definición de alias de :class:`Enum`, una bandera sin valor (también conocida como ``0``) o con más de un valor de potencia de dos (por ejemplo, ``3``) se considera un alias.

source: Enum Members (aka instances)
es_us: Miembros de enumeración (también conocidos como instancias)

source: The most interesting thing about enum members is that they are singletons. :class:`EnumType` creates them all while it is creating the enum class itself, and then puts a custom :meth:`__new__` in place to ensure that no new ones are ever instantiated by returning only the existing member instances.
es_us: Lo más interesante de los miembros de la enumeración es que son únicos. :class:`EnumType` los crea a todos mientras crea la propia clase de enumeración, y luego coloca un :meth:`__new__` personalizado para garantizar que nunca se creen instancias nuevas al devolver solo las instancias de miembros existentes.

source: Flag Members
es_us: Miembros de Banderas

source: Flag members can be iterated over just like the :class:`Flag` class, and only the canonical members will be returned. For example::
es_us: Los miembros de las Banderas se pueden recorrer de la misma manera que la clase :class:`Flag`, y solo se devolverán los miembros canónicos. Por ejemplo::

source: (Note that ``BLACK``, ``PURPLE``, and ``WHITE`` do not show up.)
es_us: (Note que ``BLACK``, ``PURPLE``, y ``WHITE`` no se muestran.)

source: Inverting a flag member returns the corresponding positive value, rather than a negative value --- for example::
es_us: Invertir un miembro de la bandera devuelve el valor positivo correspondiente, en lugar de un valor negativo --- por ejemplo::

source: Flag members have a length corresponding to the number of power-of-two values they contain. For example::
es_us: Los miembros de las Banderas tienen una longitud que corresponde al número de valores de potencia de dos que contienen. Por ejemplo::

source: Enum Cookbook
es_us: Recetario de Enumeraciones

source: While :class:`Enum`, :class:`IntEnum`, :class:`StrEnum`, :class:`Flag`, and :class:`IntFlag` are expected to cover the majority of use-cases, they cannot cover them all. Here are recipes for some different types of enumerations that can be used directly, or as examples for creating one's own.
es_us: Si bien se espera que :class:`Enum`, :class:`IntEnum`, :class:`StrEnum`, :class:`Flag` y :class:`IntFlag` cubran la mayoría de los casos de uso, no pueden cubrirlos todos. Aquí hay recetas para algunos tipos diferentes de enumeraciones que se pueden usar directamente o como ejemplos para crear las propias.

source: Omitting values
es_us: Omitir valores

source: In many use-cases, one doesn't care what the actual value of an enumeration is. There are several ways to define this type of simple enumeration:
es_us: En muchos casos de uso, a uno no le importa cuál es el valor real de una enumeración. Hay varias formas de definir este tipo de enumeración simple:

source: use instances of :class:`auto` for the value
es_us: usar instancias de :class:`auto` para el valor

source: use instances of :class:`object` as the value
es_us: usar instancias de :class:`object` como valor

source: use a descriptive string as the value
es_us: use una cadena descriptiva como el valor

source: use a tuple as the value and a custom :meth:`__new__` to replace the tuple with an :class:`int` value
es_us: use una tupla como valor y un :meth:`__new__` personalizado para reemplazar la tupla con un valor :class:`int`

source: Using any of these methods signifies to the user that these values are not important, and also enables one to add, remove, or reorder members without having to renumber the remaining members.
es_us: El uso de cualquiera de estos métodos significa para el usuario que estos valores no son importantes y también permite agregar, eliminar o reordenar miembros sin tener que volver a numerar los miembros restantes.

source: Using :class:`auto`
es_us: Usando :class:`auto`

source: Using :class:`auto` would look like::
es_us: El uso de :class:`auto` se vería así:

source: Using :class:`object`
es_us: Usando :class:`object`

source: Using :class:`object` would look like::
es_us: El uso de :class:`object` se vería así:

source: This is also a good example of why you might want to write your own :meth:`__repr__`::
es_us: Este también es un buen ejemplo de por qué es posible que desee escribir su propio :meth:`__repr__`::

source: Using a descriptive string
es_us: Usar una cadena descriptiva

source: Using a string as the value would look like::
es_us: Usando una cadena como el valor se vería así:

source: Using a custom :meth:`__new__`
es_us: Usando un :meth:`__new__` personalizado

source: Using an auto-numbering :meth:`__new__` would look like::
es_us: El uso de un :meth:`__new__` de numeración automática se vería así:

source: To make a more general purpose ``AutoNumber``, add ``*args`` to the signature::
es_us: Para hacer un ``AutoNumber`` de uso más general, agregue ``*args`` a la firma:

source: >>> class AutoNumber(Enum): ... def __new__(cls, *args): # this is the only change from above ... value = len(cls.__members__) + 1 ... obj = object.__new__(cls) ... obj._value_ = value ... return obj ...
es_us: >>> class AutoNumber(Enum): ... def __new__(cls, *args): # éste es el único cambio respecto a lo anterior ... value = len(cls.__members__) + 1 ... obj = object.__new__(cls) ... obj._value_ = value ... return obj ...

source: Then when you inherit from ``AutoNumber`` you can write your own ``__init__`` to handle any extra arguments::
es_us: Luego, cuando hereda de ``AutoNumber``, puede escribir su propio ``__init__`` para manejar cualquier argumento adicional:

source: >>> class Swatch(AutoNumber): ... def __init__(self, pantone='unknown'): ... self.pantone = pantone ... AUBURN = '3497' ... SEA_GREEN = '1246' ... BLEACHED_CORAL = () # New color, no Pantone code yet! ... >>> Swatch.SEA_GREEN <Swatch.SEA_GREEN: 2> >>> Swatch.SEA_GREEN.pantone '1246' >>> Swatch.BLEACHED_CORAL.pantone 'unknown'
es_us: >>> class Swatch(AutoNumber): ... def __init__(self, pantone='unknown'): ... self.pantone = pantone ... AUBURN = '3497' ... SEA_GREEN = '1246' ... BLEACHED_CORAL = () # ¡Nuevo color, aún sin código Pantone! ... >>> Swatch.SEA_GREEN <Swatch.SEA_GREEN: 2> >>> Swatch.SEA_GREEN.pantone '1246' >>> Swatch.BLEACHED_CORAL.pantone 'unknown'

source: The :meth:`__new__` method, if defined, is used during creation of the Enum members; it is then replaced by Enum's :meth:`__new__` which is used after class creation for lookup of existing members.
es_us: El método :meth:`__new__`, si está definido, se usa durante la creación de los miembros de Enum; luego se reemplaza por :meth:`__new__` de Enum, que se usa después de la creación de clases para buscar miembros existentes.

source: *Do not* call ``super().__new__()``, as the lookup-only ``__new__`` is the one that is found; instead, use the data type directly -- e.g.::
es_us: *No* llame a ``super().__new__()``, ya que encontrará el ``__new__`` de solo búsqueda; en su lugar, utilice directamente el tipo de datos -- por ejemplo::

source: OrderedEnum
es_us: Enum ordenado

source: An ordered enumeration that is not based on :class:`IntEnum` and so maintains the normal :class:`Enum` invariants (such as not being comparable to other enumerations)::
es_us: Una enumeración ordenada que no se basa en :class:`IntEnum` y, por lo tanto, mantiene las invariantes normales de :class:`Enum` (como no ser comparable con otras enumeraciones):

source: Raises an error if a duplicate member value is found instead of creating an alias::
es_us: Lanza un error si se encuentra un nombre de miembro duplicado en lugar de crear un alias::

source: This is a useful example for subclassing Enum to add or change other behaviors as well as disallowing aliases. If the only desired change is disallowing aliases, the :func:`unique` decorator can be used instead.
es_us: Este es un ejemplo útil para subclasificar Enum para agregar o cambiar otros comportamientos, así como para no permitir alias. Si el único cambio deseado es prohibir los alias, se puede usar el decorador :func:`unique` en su lugar.

source: Supports having more than one value per member::
es_us: Soporta tener más de un valor por miembro:

source: Planet
es_us: Planeta

source: If :meth:`__new__` or :meth:`__init__` is defined, the value of the enum member will be passed to those methods::
es_us: Si se define :meth:`__new__` o :meth:`__init__`, el valor del miembro de enumeración se pasará a esos métodos:

source: TimePeriod
es_us: Periodo de tiempo

source: An example to show the :attr:`_ignore_` attribute in use::
es_us: Un ejemplo para mostrar el atributo :attr:`_ignore_` en uso:

source: Subclassing EnumType
es_us: Subclase EnumType

source: While most enum needs can be met by customizing :class:`Enum` subclasses, either with class decorators or custom functions, :class:`EnumType` can be subclassed to provide a different Enum experience.
es_us: Si bien la mayoría de las necesidades de enumeración se pueden satisfacer mediante la personalización de las subclases :class:`Enum`, ya sea con decoradores de clase o funciones personalizadas, :class:`EnumType` se puede dividir en subclases para proporcionar una experiencia de enumeración diferente.
