Repository: taicoding/python-docs-es
Catalog: howto/enum.po
Languages: es_us

source: Enum HOWTO
es_us: HOWTO - Enum

source: An :class:`Enum` is a set of symbolic names bound to unique values. They are similar to global variables, but they offer a more useful :func:`repr`, grouping, type-safety, and a few other features.
es_us: Un :class:`Enum` es un conjunto de nombres simbólicos vinculados a valores únicos. Son similares a las variables globales, pero ofrecen un :func:`repr()` más útil, agrupación, seguridad de tipos y algunas otras características.

source: They are most useful when you have a variable that can take one of a limited selection of values. For example, the days of the week::
es_us: Son más útiles cuando tiene una variable que puede tomar uno de una selección limitada de valores. Por ejemplo, los días de la semana:

source: Or perhaps the RGB primary colors::
es_us: O quizás los colores primarios RGB::

source: As you can see, creating an :class:`Enum` is as simple as writing a class that inherits from :class:`Enum` itself.
es_us: Como puede ver, crear un :class:`Enum` es tan simple como escribir una clase que herede del propio :class:`Enum`.

source: Case of Enum Members
es_us: Caso de miembros de Enum

source: Because Enums are used to represent constants, and to help avoid issues with name clashes between mixin-class methods/attributes and enum names, we strongly recommend using UPPER_CASE names for members, and will be using that style in our examples.
es_us: Dado que las enumeraciones se utilizan para representar constantes y para evitar problemas con conflictos de nombres entre los métodos/atributos de las clases mixin y los nombres de las enumeraciones, recomendamos encarecidamente utilizar nombres en MAYÚSCULAS para los miembros, y utilizaremos ese estilo en nuestros ejemplos.

source: Depending on the nature of the enum a member's value may or may not be important, but either way that value can be used to get the corresponding member::
es_us: Dependiendo de la naturaleza de la enumeración, el valor de un miembro puede o no ser importante, pero de cualquier manera ese valor puede usarse para obtener el miembro correspondiente:

source: As you can see, the ``repr()`` of a member shows the enum name, the member name, and the value. The ``str()`` of a member shows only the enum name and member name::
es_us: Como puede ver, el ``repr()`` de un miembro muestra el nombre de enumeración, el nombre del miembro y el valor. El ``str()`` de un miembro muestra solo el nombre de enumeración y el nombre del miembro:

source: The *type* of an enumeration member is the enum it belongs to::
es_us: El *type* de un miembro de la enumeración es la enumeración a la que pertenece:

source: Enum members have an attribute that contains just their :attr:`name`::
es_us: Los miembros de enumeración tienen un atributo que contiene solo su :attr:`name`::

source: Likewise, they have an attribute for their :attr:`value`::
es_us: Asimismo, tienen un atributo para su :attr:`value`:

source: Unlike many languages that treat enumerations solely as name/value pairs, Python Enums can have behavior added. For example, :class:`datetime.date` has two methods for returning the weekday: :meth:`weekday` and :meth:`isoweekday`. The difference is that one of them counts from 0-6 and the other from 1-7. Rather than keep track of that ourselves we can add a method to the :class:`Weekday` enum to extract the day from the :class:`date` instance and return the matching enum member::
es_us: A diferencia de muchos lenguajes que tratan las enumeraciones únicamente como pares de nombre/valor, Python Enums puede tener un comportamiento agregado. Por ejemplo, :class:`datetime.date` tiene dos métodos para retornar el día de la semana: :meth:`weekday` y :meth:`isoweekday`. La diferencia es que uno de ellos cuenta de 0 a 6 y el otro de 1 a 7. En lugar de hacer un seguimiento de eso nosotros mismos, podemos agregar un método a la enumeración :class:`Weekday` para extraer el día de la instancia :class:`date` y retornar el miembro de enumeración coincidente:

source: The complete :class:`Weekday` enum now looks like this::
es_us: La enumeración :class:`Weekday` completa ahora se ve así:

source: Now we can find out what today is! Observe::
es_us: ¡Ahora podemos averiguar qué día de la semana es hoy! Observe::

source: Of course, if you're reading this on some other day, you'll see that day instead.
es_us: Por supuesto, si estás leyendo esto en otro día, verás ese día en su lugar.

source: This :class:`Weekday` enum is great if our variable only needs one day, but what if we need several? Maybe we're writing a function to plot chores during a week, and don't want to use a :class:`list` -- we could use a different type of :class:`Enum`::
es_us: Esta enumeración :class:`Weekday` es excelente si nuestra variable solo necesita un día, pero ¿y si necesitamos varios? Tal vez estamos escribiendo una función para trazar tareas durante una semana y no queremos usar un :class:`list`; podríamos usar un tipo diferente de :class:`Enum`:

source: We've changed two things: we're inherited from :class:`Flag`, and the values are all powers of 2.
es_us: Hemos cambiado dos cosas: somos heredados de :class:`Flag` y los valores son todos potencia de 2.

source: Just like the original :class:`Weekday` enum above, we can have a single selection::
es_us: Al igual que la enumeración :class:`Weekday` original anterior, podemos tener una sola selección:

source: But :class:`Flag` also allows us to combine several members into a single variable::
es_us: Pero :class:`Flag` también nos permite combinar varios miembros en una sola variable:

source: You can even iterate over a :class:`Flag` variable::
es_us: Incluso puede iterar sobre una variable :class:`Flag`:

source: Okay, let's get some chores set up::
es_us: Bien, preparemos algunas tareas::

source: And a function to display the chores for a given day::
es_us: Y una función para mostrar las tareas de un día determinado:

source: In cases where the actual values of the members do not matter, you can save yourself some work and use :func:`auto` for the values::
es_us: En los casos en que los valores reales de los miembros no importen, puede ahorrarse algo de trabajo y usar :func:`auto()` para los valores:

source: Programmatic access to enumeration members and their attributes
es_us: Acceso programático a los miembros de la enumeración y sus atributos

source: Sometimes it's useful to access members in enumerations programmatically (i.e. situations where ``Color.RED`` won't do because the exact color is not known at program-writing time). ``Enum`` allows such access::
es_us: A veces es útil acceder a los miembros en las enumeraciones programáticamente (es decir, situaciones en las que ``Color.RED`` no funcionará porque no se conoce el color exacto en el momento de escribir el programa). ``Enum`` permite dicho acceso::

source: If you want to access enum members by *name*, use item access::
es_us: Si desea acceder a los miembros de la enumeración por *name*, use el acceso a elementos::

source: If you have an enum member and need its :attr:`name` or :attr:`value`::
es_us: Si tiene un miembro de enumeración y necesita su :attr:`name` o :attr:`value`:

source: Duplicating enum members and values
es_us: Duplicar miembros y valores de enumeración

source: Having two enum members with the same name is invalid::
es_us: Tener dos miembros de enumeración con el mismo nombre no es válido::

source: However, an enum member can have other names associated with it. Given two entries ``A`` and ``B`` with the same value (and ``A`` defined first), ``B`` is an alias for the member ``A``. By-value lookup of the value of ``A`` will return the member ``A``. By-name lookup of ``A`` will return the member ``A``. By-name lookup of ``B`` will also return the member ``A``::
es_us: Sin embargo, un miembro de enumeración puede tener otros nombres asociados. Dadas dos entradas ``A`` y ``B`` con el mismo valor (y ``A`` definido primero), ``B`` es un alias para el miembro ``A``. La búsqueda por valor del valor de ``A`` retornará el miembro ``A``. La búsqueda por nombre de ``A`` retornará el miembro ``A``. La búsqueda por nombre de ``B`` también retornará el miembro ``A``::

source: Attempting to create a member with the same name as an already defined attribute (another member, a method, etc.) or attempting to create an attribute with the same name as a member is not allowed.
es_us: No está permitido intentar crear un miembro con el mismo nombre que un atributo ya definido (otro miembro, un método, etc.) o intentar crear un atributo con el mismo nombre que un miembro.

source: Ensuring unique enumeration values
es_us: Garantizar valores de enumeración únicos

source: By default, enumerations allow multiple names as aliases for the same value. When this behavior isn't desired, you can use the :func:`unique` decorator::
es_us: De forma predeterminada, las enumeraciones permiten múltiples nombres como alias para el mismo valor. Cuando no se desea este comportamiento, puede usar el decorador :func:`unique`:

source: Using automatic values
es_us: Uso de valores automáticos

source: If the exact value is unimportant you can use :class:`auto`::
es_us: Si el valor exacto no es importante, puede usar :class:`auto`::

source: The values are chosen by :func:`_generate_next_value_`, which can be overridden::
es_us: Los valores son elegidos por :func:`_generate_next_value_`, que se pueden anular:

source: The :meth:`_generate_next_value_` method must be defined before any members.
es_us: El método :meth:`_generate_next_value_` debe definirse antes que cualquier miembro.

source: Iteration
es_us: Iteración

source: Iterating over the members of an enum does not provide the aliases::
es_us: Iterar sobre los miembros de una enumeración no proporciona los alias:

source: Note that the aliases ``Shape.ALIAS_FOR_SQUARE`` and ``Weekday.WEEKEND`` aren't shown.
es_us: Note que los alias ``Shape.ALIAS_FOR_SQUARE`` y ``Weekday.WEEKEND`` no se muestran.

source: The special attribute ``__members__`` is a read-only ordered mapping of names to members. It includes all names defined in the enumeration, including the aliases::
es_us: El atributo especial ``__members__`` es una asignación ordenada de solo lectura de nombres a miembros. Incluye todos los nombres definidos en la enumeración, incluidos los alias::

source: The ``__members__`` attribute can be used for detailed programmatic access to the enumeration members. For example, finding all the aliases::
es_us: El atributo ``__members__`` se puede utilizar para el acceso programático detallado a los miembros de la enumeración. Por ejemplo, encontrar todos los alias::

source: Aliases for flags include values with multiple flags set, such as ``3``, and no flags set, i.e. ``0``.
es_us: Los alias para las banderas incluyen valores con múltiples banderas establecidas, como ``3``, y ningún conjunto de banderas, es decir, ``0``.

source: Comparisons
es_us: Comparaciones

source: Enumeration members are compared by identity::
es_us: Los miembros de la enumeración se comparan por identidad::

source: Ordered comparisons between enumeration values are *not* supported. Enum members are not integers (but see `IntEnum`_ below)::
es_us: Las comparaciones ordenadas entre valores de enumeración son compatibles con *not*. Los miembros de la enumeración no son números enteros (pero consulte `IntEnum`_ a continuación):

source: Equality comparisons are defined though::
es_us: Las comparaciones de igualdad se definen aunque:

source: Comparisons against non-enumeration values will always compare not equal (again, :class:`IntEnum` was explicitly designed to behave differently, see below)::
es_us: Las comparaciones con valores que no son de enumeración siempre comparan no iguales (nuevamente, :class:`IntEnum` se diseñó explícitamente para comportarse de manera diferente, consulte a continuación):

source: It is possible to reload modules -- if a reloaded module contains enums, they will be recreated, and the new members may not compare identical/equal to the original members.
es_us: Es posible recargar módulos; si un módulo recargado contiene enumeraciones, estas se crearán de nuevo y los nuevos miembros pueden no compararse como idénticos/iguales a los miembros originales.

source: Allowed members and attributes of enumerations
es_us: Miembros permitidos y atributos de enumeraciones

source: Most of the examples above use integers for enumeration values. Using integers is short and handy (and provided by default by the `Functional API`_), but not strictly enforced. In the vast majority of use-cases, one doesn't care what the actual value of an enumeration is. But if the value *is* important, enumerations can have arbitrary values.
es_us: La mayoría de los ejemplos anteriores usan números enteros para los valores de enumeración. El uso de números enteros es corto y práctico (y proporcionado por defecto por el `Functional API`_), pero no se aplica estrictamente. En la gran mayoría de los casos de uso, a uno no le importa cuál es el valor real de una enumeración. Pero si el valor *is* es importante, las enumeraciones pueden tener valores arbitrarios.

source: Enumerations are Python classes, and can have methods and special methods as usual. If we have this enumeration::
es_us: Las enumeraciones son clases de Python y pueden tener métodos y métodos especiales como de costumbre. Si tenemos esta enumeración:

source: >>> class Mood(Enum): ... FUNKY = 1 ... HAPPY = 3 ... ... def describe(self): ... # self is the member here ... return self.name, self.value ... ... def __str__(self): ... return 'my custom str! {0}'.format(self.value) ... ... @classmethod ... def favorite_mood(cls): ... # cls here is the enumeration ... return cls.HAPPY ...
es_us: >>> class Mood(Enum): ... FUNKY = 1 ... HAPPY = 3 ... ... def describe(self): ... # self es el miembro aquí ... return self.name, self.value ... ... def __str__(self): ... return 'my custom str! {0}'.format(self.value) ... ... @classmethod ... def favorite_mood(cls): ... # cls es la enumeración aquí ... return cls.HAPPY ...

source: Then::
es_us: Después::

source: The rules for what is allowed are as follows: names that start and end with a single underscore are reserved by enum and cannot be used; all other attributes defined within an enumeration will become members of this enumeration, with the exception of special methods (:meth:`__str__`, :meth:`__add__`, etc.), descriptors (methods are also descriptors), and variable names listed in :attr:`_ignore_`.
es_us: Las reglas para lo que está permitido son las siguientes: los nombres que comienzan y terminan con un solo guión bajo están reservados por enumeración y no se pueden usar; todos los demás atributos definidos dentro de una enumeración se convertirán en miembros de esta enumeración, con la excepción de métodos especiales (:meth:`__str__`, :meth:`__add__`, etc.), descriptores (los métodos también son descriptores) y nombres de variables enumerados en :attr:`_ignore_`.

source: Note: if your enumeration defines :meth:`__new__` and/or :meth:`__init__`, any value(s) given to the enum member will be passed into those methods. See `Planet`_ for an example.
es_us: Nota: si su enumeración define :meth:`__new__` y/o :meth:`__init__`, cualquier valor(es) dado(s) al miembro de la enumeración se pasará a esos métodos. Consulte `Planet`_ para ver un ejemplo.

source: The :meth:`__new__` method, if defined, is used during creation of the Enum members; it is then replaced by Enum's :meth:`__new__` which is used after class creation for lookup of existing members. See :ref:`new-vs-init` for more details.
es_us: El método :meth:`__new__`, si está definido, se usa durante la creación de los miembros de Enum; luego se reemplaza por :meth:`__new__` de Enum, que se usa después de la creación de clases para buscar miembros existentes. Consulte :ref:`new-vs-init` para obtener más detalles.

source: Restricted Enum subclassing
es_us: Subclases de Enum restringidas

source: A new :class:`Enum` class must have one base enum class, up to one concrete data type, and as many :class:`object`-based mixin classes as needed. The order of these base classes is::
es_us: Una nueva clase :class:`Enum` debe tener una clase de enumeración base, hasta un tipo de datos concreto y tantas clases mixtas basadas en :class:`object` como sea necesario. El orden de estas clases base es:

source: Also, subclassing an enumeration is allowed only if the enumeration does not define any members. So this is forbidden::
es_us: Además, la subclasificación de una enumeración solo se permite si la enumeración no define ningún miembro. Así que esto está prohibido::

source: But this is allowed::
es_us: Pero esto está permitido:

source: Allowing subclassing of enums that define members would lead to a violation of some important invariants of types and instances. On the other hand, it makes sense to allow sharing some common behavior between a group of enumerations. (See `OrderedEnum`_ for an example.)
es_us: Permitir la subclasificación de enumeraciones que definen miembros conduciría a una violación de algunas invariantes importantes de tipos e instancias. Por otro lado, tiene sentido permitir compartir algún comportamiento común entre un grupo de enumeraciones. (Consulte `OrderedEnum`_ para ver un ejemplo).

source: Dataclass support
es_us: Soporte de Dataclass

source: When inheriting from a :class:`~dataclasses.dataclass`, the :meth:`~Enum.__repr__` omits the inherited class' name. For example::
es_us: Cuando se hereda de una :class:`~dataclasses.dataclass`, el :meth:`~Enum.__repr__` omite el nombre de la clase heredada. Por ejemplo::

source: Use the :func:`~dataclasses.dataclass` argument ``repr=False`` to use the standard :func:`repr`.
es_us: Utilice el argumento ``repr=False`` de :func:`~dataclasses.dataclass` para utilizar el :func:`repr` estándar.

source: Only the dataclass fields are shown in the value area, not the dataclass' name.
es_us: Solo se muestran los campos de la dataclass en el área de valores, no el nombre de la dataclass.

source: Adding :func:`~dataclasses.dataclass` decorator to :class:`Enum` and its subclasses is not supported. It will not raise any errors, but it will produce very strange results at runtime, such as members being equal to each other::
es_us: Añadir el decorador :func:`~dataclasses.dataclass` a :class:`Enum` y sus subclases no está soportado. No lanzará ningún error, pero producirá resultados bastante extraños en tiempo de ejecución, como miembros siendo iguales a otros:

source: >>> @dataclass # don't do this: it does not make any sense ... class Color(Enum): ... RED = 1 ... BLUE = 2 ... >>> Color.RED is Color.BLUE False >>> Color.RED == Color.BLUE # problem is here: they should not be equal True
es_us: >>> @dataclass # no haga esto: no tiene ningún sentido ... class Color(Enum): ... RED = 1 ... BLUE = 2 ... >>> Color.RED is Color.BLUE False >>> Color.RED == Color.BLUE # problema aquí:: no deberían ser iguales True

source: Pickling
es_us: Serialización (Pickling)

source: Enumerations can be pickled and unpickled::
es_us: Las enumeraciones se pueden serializar y deserializar:

source: The usual restrictions for pickling apply: picklable enums must be defined in the top level of a module, since unpickling requires them to be importable from that module.
es_us: Se aplican las restricciones habituales para el *pickling*: las enumeraciones serializables deben definirse en el nivel superior de un módulo, ya que el decapado requiere que se puedan importar desde ese módulo.

source: With pickle protocol version 4 it is possible to easily pickle enums nested in other classes.
es_us: Con la versión 4 del protocolo pickle es posible deserializar fácilmente enumeraciones anidadas en otras clases.

source: It is possible to modify how enum members are pickled/unpickled by defining :meth:`__reduce_ex__` in the enumeration class. The default method is by-value, but enums with complicated values may want to use by-name::
es_us: Es posible modificar la forma en que los miembros de la enumeración se serialicen / deserialicen definiendo :meth:`__reduce_ex__` en la clase de enumeración. El método predeterminado es por valor, pero las enumeraciones con valores complicados pueden querer utilizar por nombre::

source: Using by-name for flags is not recommended, as unnamed aliases will not unpickle.
es_us: No se recomienda usar banderas por nombre , ya que los alias sin nombre no se desempaquetarán.

source: Functional API
es_us: API funcional

source: The :class:`Enum` class is callable, providing the following functional API::
es_us: Se puede llamar a la clase :class:`Enum`, que proporciona la siguiente API funcional:

source: The semantics of this API resemble :class:`~collections.namedtuple`. The first argument of the call to :class:`Enum` is the name of the enumeration.
es_us: La semántica de esta API se asemeja a :class:`~collections.namedtuple`. El primer argumento de la llamada a :class:`Enum` es el nombre de la enumeración.

source: The second argument is the *source* of enumeration member names. It can be a whitespace-separated string of names, a sequence of names, a sequence of 2-tuples with key/value pairs, or a mapping (e.g. dictionary) of names to values. The last two options enable assigning arbitrary values to enumerations; the others auto-assign increasing integers starting with 1 (use the ``start`` parameter to specify a different starting value). A new class derived from :class:`Enum` is returned. In other words, the above assignment to :class:`Animal` is equivalent to::
es_us: El segundo argumento es el *source* de nombres de miembros de enumeración. Puede ser una cadena de nombres separados por espacios en blanco, una secuencia de nombres, una secuencia de 2 tuplas con pares clave/valor o una asignación (por ejemplo, un diccionario) de nombres a valores. Las dos últimas opciones permiten asignar valores arbitrarios a las enumeraciones; los otros asignan automáticamente números enteros crecientes que comienzan con 1 (use el parámetro ``start`` para especificar un valor inicial diferente). Se retorna una nueva clase derivada de :class:`Enum`. En otras palabras, la asignación anterior a :class:`Animal` es equivalente a:

source: The reason for defaulting to ``1`` as the starting number and not ``0`` is that ``0`` is ``False`` in a boolean sense, but by default enum members all evaluate to ``True``.
es_us: La razón por la que se toma por defecto ``1`` como el número inicial y no ``0`` es que ``0`` es ``False`` en un sentido booleano, pero por defecto todos los miembros de la enumeración se evalúan como ``True``.

source: Pickling enums created with the functional API can be tricky as frame stack implementation details are used to try and figure out which module the enumeration is being created in (e.g. it will fail if you use a utility function in a separate module, and also may not work on IronPython or Jython). The solution is to specify the module name explicitly as follows::
es_us: Deserializar las enumeraciones creadas con la API funcional puede ser complicado, ya que los detalles de implementación de la pila de marcos se usan para tratar de averiguar en qué módulo se está creando la enumeración (por ejemplo, fallará si usa una función de utilidad en un módulo separado, y también puede no trabajar en IronPython o Jython). La solución es especificar el nombre del módulo explícitamente de la siguiente manera:
