Repository: taicoding/python-docs-es
Catalog: howto/enum.po
Languages: es_us

source: If ``module`` is not supplied, and Enum cannot determine what it is, the new Enum members will not be unpicklable; to keep errors closer to the source, pickling will be disabled.
es_us: Si no se proporciona ``module`` y Enum no puede determinar de qué se trata, los nuevos miembros de Enum no serán seleccionables; para mantener los errores más cerca de la fuente, se desactivará el decapado.

source: The new pickle protocol 4 also, in some circumstances, relies on :attr:`~type.__qualname__` being set to the location where pickle will be able to find the class. For example, if the class was made available in class SomeData in the global scope::
es_us: El nuevo protocolo pickle 4 también, en algunas circunstancias, depende de que :attr:`~type.__qualname__` se establezca en la ubicación donde pickle podrá encontrar la clase. Por ejemplo, si la clase estuvo disponible en la clase SomeData en el ámbito global:

source: The complete signature is::
es_us: La firma completa es::

source: *value*: What the new enum class will record as its name.
es_us: *value*: Lo que la nueva clase de enumeración registrará como su nombre.

source: *names*: The enum members. This can be a whitespace- or comma-separated string (values will start at 1 unless otherwise specified)::
es_us: *names*: Los miembros de la enumeración. Puede ser una cadena separada por comas o espacios en blanco (los valores comenzarán en 1 a menos que se especifique lo contrario):

source: or an iterator of names::
es_us: o un iterador de nombres::

source: or an iterator of (name, value) pairs::
es_us: o un iterador de (nombre, valor) pares::

source: or a mapping::
es_us: o un mapeo::

source: *module*: name of module where new enum class can be found.
es_us: *module*: nombre del módulo donde se puede encontrar la nueva clase de enumeración.

source: *qualname*: where in module new enum class can be found.
es_us: *qualname*: donde en el módulo se puede encontrar la nueva clase de enumeración.

source: *type*: type to mix in to new enum class.
es_us: *type*: tipo para mezclar en la nueva clase de enumeración.

source: *start*: number to start counting at if only names are passed in.
es_us: *start*: número para comenzar a contar si solo se pasan nombres.

source: The *start* parameter was added.
es_us: Se agregó el parámetro *start*.

source: Derived Enumerations
es_us: Enumeraciones derivadas

source: The first variation of :class:`Enum` that is provided is also a subclass of :class:`int`. Members of an :class:`IntEnum` can be compared to integers; by extension, integer enumerations of different types can also be compared to each other::
es_us: La primera variación de :class:`Enum` que se proporciona también es una subclase de :class:`int`. Los miembros de un :class:`IntEnum` se pueden comparar con números enteros; por extensión, las enumeraciones enteras de diferentes tipos también se pueden comparar entre sí:

source: However, they still can't be compared to standard :class:`Enum` enumerations::
es_us: Sin embargo, aún no se pueden comparar con las enumeraciones :class:`Enum` estándar:

source: :class:`IntEnum` values behave like integers in other ways you'd expect::
es_us: Los valores :class:`IntEnum` se comportan como números enteros en otras formas que esperaría:

source: The second variation of :class:`Enum` that is provided is also a subclass of :class:`str`. Members of a :class:`StrEnum` can be compared to strings; by extension, string enumerations of different types can also be compared to each other.
es_us: La segunda variación de :class:`Enum` que se proporciona también es una subclase de :class:`str`. Los miembros de un :class:`StrEnum` se pueden comparar con cadenas; por extensión, las enumeraciones de cadenas de diferentes tipos también se pueden comparar entre sí.

source: The next variation of :class:`Enum` provided, :class:`IntFlag`, is also based on :class:`int`. The difference being :class:`IntFlag` members can be combined using the bitwise operators (&, \|, ^, ~) and the result is still an :class:`IntFlag` member, if possible. Like :class:`IntEnum`, :class:`IntFlag` members are also integers and can be used wherever an :class:`int` is used.
es_us: La siguiente variación de :class:`Enum` proporcionada, :class:`IntFlag`, también se basa en :class:`int`. La diferencia es que los miembros :class:`IntFlag` se pueden combinar usando los operadores bit a bit (&, \|, ^, ~) y el resultado sigue siendo un miembro :class:`IntFlag`, si es posible. Al igual que :class:`IntEnum`, los miembros :class:`IntFlag` también son números enteros y se pueden utilizar siempre que se utilice un :class:`int`.

source: Any operation on an :class:`IntFlag` member besides the bit-wise operations will lose the :class:`IntFlag` membership.
es_us: Cualquier operación en un miembro :class:`IntFlag` además de las operaciones bit a bit perderá la pertenencia a :class:`IntFlag`.

source: Bit-wise operations that result in invalid :class:`IntFlag` values will lose the :class:`IntFlag` membership. See :class:`FlagBoundary` for details.
es_us: Las operaciones bit a bit que den como resultado valores :class:`IntFlag` no válidos perderán la pertenencia a :class:`IntFlag`. Ver :class:`FlagBoundary` para más detalles.

source: Sample :class:`IntFlag` class::
es_us: Ejemplo de clase :class:`IntFlag`::

source: It is also possible to name the combinations::
es_us: También es posible nombrar las combinaciones:

source: Named combinations are considered aliases. Aliases do not show up during iteration, but can be returned from by-value lookups.
es_us: Las combinaciones con nombre se consideran alias. Los alias no aparecen durante la iteración, pero se pueden devolver a partir de búsquedas por valor.

source: Another important difference between :class:`IntFlag` and :class:`Enum` is that if no flags are set (the value is 0), its boolean evaluation is :data:`False`::
es_us: Otra diferencia importante entre :class:`IntFlag` y :class:`Enum` es que si no se establecen banderas (el valor es 0), su evaluación booleana es :data:`False`::

source: Because :class:`IntFlag` members are also subclasses of :class:`int` they can be combined with them (but may lose :class:`IntFlag` membership::
es_us: Debido a que los miembros :class:`IntFlag` también son subclases de :class:`int`, se pueden combinar con ellos (pero pueden perder la membresía :class:`IntFlag`::

source: The negation operator, ``~``, always returns an :class:`IntFlag` member with a positive value::
es_us: El operador de negación, ``~``, siempre retorna un miembro :class:`IntFlag` con un valor positivo:

source: :class:`IntFlag` members can also be iterated over::
es_us: Los miembros :class:`IntFlag` también se pueden iterar sobre:

source: Flag
es_us: Bandera

source: The last variation is :class:`Flag`. Like :class:`IntFlag`, :class:`Flag` members can be combined using the bitwise operators (&, \|, ^, ~). Unlike :class:`IntFlag`, they cannot be combined with, nor compared against, any other :class:`Flag` enumeration, nor :class:`int`. While it is possible to specify the values directly it is recommended to use :class:`auto` as the value and let :class:`Flag` select an appropriate value.
es_us: La última variación es :class:`Flag`. Al igual que :class:`IntFlag`, los miembros de :class:`Flag` se pueden combinar mediante los operadores bit a bit (&, \|, ^, ~). A diferencia de :class:`IntFlag`, no se pueden combinar ni comparar con ninguna otra enumeración :class:`Flag` ni con :class:`int`. Si bien es posible especificar los valores directamente, se recomienda usar :class:`auto` como valor y dejar que :class:`Flag` seleccione un valor apropiado.

source: Like :class:`IntFlag`, if a combination of :class:`Flag` members results in no flags being set, the boolean evaluation is :data:`False`::
es_us: Al igual que :class:`IntFlag`, si una combinación de miembros :class:`Flag` da como resultado que no se establezcan indicadores, la evaluación booleana es :data:`False`::

source: Individual flags should have values that are powers of two (1, 2, 4, 8, ...), while combinations of flags will not::
es_us: Las banderas individuales deben tener valores que sean potencias de dos (1, 2, 4, 8, ...), mientras que las combinaciones de banderas no::

source: Giving a name to the "no flags set" condition does not change its boolean value::
es_us: Dar un nombre a la condición "sin banderas establecidas" no cambia su valor booleano:

source: :class:`Flag` members can also be iterated over::
es_us: Los miembros :class:`Flag` también se pueden iterar sobre:

source: For the majority of new code, :class:`Enum` and :class:`Flag` are strongly recommended, since :class:`IntEnum` and :class:`IntFlag` break some semantic promises of an enumeration (by being comparable to integers, and thus by transitivity to other unrelated enumerations). :class:`IntEnum` and :class:`IntFlag` should be used only in cases where :class:`Enum` and :class:`Flag` will not do; for example, when integer constants are replaced with enumerations, or for interoperability with other systems.
es_us: Para la mayoría del código nuevo, se recomienda encarecidamente :class:`Enum` y :class:`Flag`, ya que :class:`IntEnum` y :class:`IntFlag` rompen algunas promesas semánticas de una enumeración (al ser comparables con los números enteros y, por lo tanto, por la transitividad a otras enumeraciones no relacionadas). :class:`IntEnum` y :class:`IntFlag` deben usarse solo en los casos en que :class:`Enum` y :class:`Flag` no sirvan; por ejemplo, cuando las constantes enteras se reemplazan con enumeraciones, o para la interoperabilidad con otros sistemas.

source: Others
es_us: Otros

source: While :class:`IntEnum` is part of the :mod:`enum` module, it would be very simple to implement independently::
es_us: Si bien :class:`IntEnum` es parte del módulo :mod:`enum`, sería muy simple de implementar de forma independiente:

source: class IntEnum(int, ReprEnum): # or Enum instead of ReprEnum pass
es_us: class IntEnum(int, ReprEnum): # o Enum en lugar de ReprEnum pass

source: This demonstrates how similar derived enumerations can be defined; for example a :class:`FloatEnum` that mixes in :class:`float` instead of :class:`int`.
es_us: Esto demuestra cómo se pueden definir enumeraciones derivadas similares; por ejemplo, un :class:`FloatEnum` que se mezcla en :class:`float` en lugar de :class:`int`.

source: Some rules:
es_us: Algunas reglas:

source: When subclassing :class:`Enum`, mix-in types must appear before the :class:`Enum` class itself in the sequence of bases, as in the :class:`IntEnum` example above.
es_us: Al subclasificar :class:`Enum`, los tipos de combinación deben aparecer antes que :class:`Enum` en la secuencia de bases, como en el ejemplo anterior de :class:`IntEnum`.

source: Mix-in types must be subclassable. For example, :class:`bool` and :class:`range` are not subclassable and will throw an error during Enum creation if used as the mix-in type.
es_us: Los tipos mixtos deben ser subclasificables. Por ejemplo, :class:`bool` y :class:`range` no son subclasificables y generarán un error durante la creación de Enum si se usan como tipo de combinación.

source: While :class:`Enum` can have members of any type, once you mix in an additional type, all the members must have values of that type, e.g. :class:`int` above. This restriction does not apply to mix-ins which only add methods and don't specify another type.
es_us: Si bien :class:`Enum` puede tener miembros de cualquier tipo, una vez que mezcle un tipo adicional, todos los miembros deben tener valores de ese tipo, p. :class:`int` anterior. Esta restricción no se aplica a los complementos que solo agregan métodos y no especifican otro tipo.

source: When another data type is mixed in, the :attr:`value` attribute is *not the same* as the enum member itself, although it is equivalent and will compare equal.
es_us: Cuando se mezcla otro tipo de datos, el atributo :attr:`value` es *not the same* como el propio miembro de la enumeración, aunque es equivalente y se comparará igual.

source: A ``data type`` is a mixin that defines :meth:`__new__`, or a :class:`~dataclasses.dataclass`
es_us: Un ``data type`` es un mixin que define :meth:`__new__`, o una :class:`~dataclasses.dataclass`

source: %-style formatting: ``%s`` and ``%r`` call the :class:`Enum` class's :meth:`__str__` and :meth:`__repr__` respectively; other codes (such as ``%i`` or ``%h`` for IntEnum) treat the enum member as its mixed-in type.
es_us: Formato de estilo %: ``%s`` y ``%r`` llaman a :meth:`__str__` y :meth:`__repr__` de la clase :class:`Enum` respectivamente; otros códigos (como ``%i`` o ``%h`` para IntEnum) tratan el miembro de enumeración como su tipo mixto.

source: :ref:`Formatted string literals <f-strings>`, :meth:`str.format`, and :func:`format` will use the enum's :meth:`__str__` method.
es_us: :ref:`Formatted string literals <f-strings>`, :meth:`str.format` y :func:`format` usarán el método :meth:`__str__` de la enumeración.

source: Because :class:`IntEnum`, :class:`IntFlag`, and :class:`StrEnum` are designed to be drop-in replacements for existing constants, their :meth:`__str__` method has been reset to their data types' :meth:`__str__` method.
es_us: Dado que :class:`IntEnum`, :class:`IntFlag` y :class:`StrEnum` están diseñados para ser reemplazos directos de constantes existentes, su método :meth:`__str__` se ha restablecido al método :meth:`__str__` de sus tipos de datos.

source: When to use :meth:`__new__` vs. :meth:`__init__`
es_us: Cuándo usar :meth:`__new__` frente a :meth:`__init__`

source: :meth:`__new__` must be used whenever you want to customize the actual value of the :class:`Enum` member. Any other modifications may go in either :meth:`__new__` or :meth:`__init__`, with :meth:`__init__` being preferred.
es_us: :meth:`__new__` debe usarse siempre que desee personalizar el valor real del miembro :class:`Enum`. Cualquier otra modificación puede ir en :meth:`__new__` o :meth:`__init__`, siendo preferible :meth:`__init__`.

source: For example, if you want to pass several items to the constructor, but only want one of them to be the value::
es_us: Por ejemplo, si desea pasar varios elementos al constructor, pero solo desea que uno de ellos sea el valor:

source: >>> class Coordinate(bytes, Enum): ... """ ... Coordinate with binary codes that can be indexed by the int code. ... """ ... def __new__(cls, value, label, unit): ... obj = bytes.__new__(cls, [value]) ... obj._value_ = value ... obj.label = label ... obj.unit = unit ... return obj ... PX = (0, 'P.X', 'km') ... PY = (1, 'P.Y', 'km') ... VX = (2, 'V.X', 'km/s') ... VY = (3, 'V.Y', 'km/s') ... >>> print(Coordinate['PY']) Coordinate.PY >>> print(Coordinate(3)) Coordinate.VY
es_us: >>> class Coordinate(bytes, Enum): ... """ ... Coordenada con códigos binarios que pueden ser indexada por el código entero ... """ ... def __new__(cls, value, label, unit): ... obj = bytes.__new__(cls, [value]) ... obj._value_ = value ... obj.label = label ... obj.unit = unit ... return obj ... PX = (0, 'P.X', 'km') ... PY = (1, 'P.Y', 'km') ... VX = (2, 'V.X', 'km/s') ... VY = (3, 'V.Y', 'km/s') ... >>> print(Coordinate['PY']) Coordinate.PY >>> print(Coordinate(3)) Coordinate.VY

source: *Do not* call ``super().__new__()``, as the lookup-only ``__new__`` is the one that is found; instead, use the data type directly.
es_us: *No* llame a ``super().__new__()``, ya que encontrará el ``__new__`` de solo búsqueda; en su lugar, utilice directamente el tipo de datos.

source: Finer Points
es_us: Puntos más finos

source: Supported ``__dunder__`` names
es_us: Nombres ``__dunder__`` admitidos

source: :attr:`__members__` is a read-only ordered mapping of ``member_name``:``member`` items. It is only available on the class.
es_us: :attr:`__members__` es una asignación ordenada de solo lectura de elementos ``member_name``:``member``. Solo está disponible en la clase.

source: :meth:`__new__`, if specified, must create and return the enum members; it is also a very good idea to set the member's :attr:`_value_` appropriately. Once all the members are created it is no longer used.
es_us: :meth:`__new__`, si se especifica, debe crear y devolver los miembros de enumeración; también es una muy buena idea configurar correctamente el :attr:`_value_` del miembro. Una vez que se crean todos los miembros, ya no se utiliza.

source: Supported ``_sunder_`` names
es_us: Nombres ``_sunder_`` admitidos

source: :attr:`~Enum._name_` -- name of the member
es_us: :attr:`~Enum._name_` -- nombre del miembro

source: :attr:`~Enum._value_` -- value of the member; can be set in ``__new__``
es_us: :attr:`~Enum._value_` -- valor del miembro; se puede configurar/modificar en ``__new__``

source: :meth:`~Enum._missing_` -- a lookup function used when a value is not found; may be overridden
es_us: :meth:`~Enum._missing_` -- una función de búsqueda utilizada cuando no se encuentra un valor; puede ser anulado

source: :attr:`~Enum._ignore_` -- a list of names, either as a :class:`list` or a :class:`str`, that will not be transformed into members, and will be removed from the final class
es_us: :attr:`~Enum._ignore_` -- una lista de nombres, ya sea como :class:`list` o :class:`str`, que no se transformarán en miembros y se eliminarán de la clase final

source: :meth:`~Enum._generate_next_value_` -- used to get an appropriate value for an enum member; may be overridden
es_us: :meth:`~Enum._generate_next_value_` -- utilizado para obtener un valor apropiado para un miembro de enumeración; puede ser sobrescrito

source: :meth:`~Enum._add_alias_` -- adds a new name as an alias to an existing member.
es_us: :meth:`~Enum._add_alias_` -- añade un nombre nuevo como alias a un miembro existente.

source: :meth:`~Enum._add_value_alias_` -- adds a new value as an alias to an existing member. See `MultiValueEnum`_ for an example.
es_us: :meth:`~Enum._add_value_alias_` -- añade un valor nuevo como alias a un miembro existente. Vea `MultiValueEnum`_ para un ejemplo .

source: For standard :class:`Enum` classes the next value chosen is the highest value seen incremented by one.
es_us: Para las clases :class:`Enum` estándar, el siguiente valor elegido es el valor más alto incrementado en uno.

source: For :class:`Flag` classes the next value chosen will be the next highest power-of-two.
es_us: Para las clases :class:`Flag`, el siguiente valor elegido será la siguiente potencia de dos más alta.

source: Prior versions would use the last seen value instead of the highest value.
es_us: Versiones anteriores usarían el último valor visto en lugar del valor más alto.

source: To help keep Python 2 / Python 3 code in sync an :attr:`_order_` attribute can be provided. It will be checked against the actual order of the enumeration and raise an error if the two do not match::
es_us: Para ayudar a mantener sincronizado el código de Python 2/Python 3, se puede proporcionar un atributo :attr:`_order_`. Se comparará con el orden real de la enumeración y lanzará un error si los dos no coinciden:

source: In Python 2 code the :attr:`_order_` attribute is necessary as definition order is lost before it can be recorded.
es_us: En el código de Python 2, el atributo :attr:`_order_` es necesario ya que el orden de definición se pierde antes de que se pueda registrar.

source: :ref:`Private names <private-name-mangling>` are not converted to enum members, but remain normal attributes.
es_us: :ref:`Private names <private-name-mangling>` no se convierten en miembros de enumeración, sino que siguen siendo atributos normales.

source: ``Enum`` member type
es_us: Tipo de miembro ``Enum``

source: Enum members are instances of their enum class, and are normally accessed as ``EnumClass.member``. In certain situations, such as writing custom enum behavior, being able to access one member directly from another is useful, and is supported; however, in order to avoid name clashes between member names and attributes/methods from mixed-in classes, upper-case names are strongly recommended.
es_us: Los miembros de una enumeración son instancias de su clase de enumeración y se acceden normalmente como ``EnumClass.member``. En ciertas situaciones, como al escribir comportamiento personalizado para una enumeración, es útil poder acceder a un miembro directamente desde otro, y esto está soportado; sin embargo, para evitar conflictos de nombres entre los nombres de los miembros y los atributos/métodos de las clases mezcladas, se recomienda encarecidamente utilizar nombres en mayúsculas.

source: Creating members that are mixed with other data types
es_us: Creación de miembros que se mezclan con otros tipos de datos

source: When subclassing other data types, such as :class:`int` or :class:`str`, with an :class:`Enum`, all values after the ``=`` are passed to that data type's constructor. For example::
es_us: Al crear subclases de otros tipos de datos, como :class:`int` o :class:`str`, con un :class:`Enum`, todos los valores después de ``=`` se pasan al constructor de ese tipo de datos. Por ejemplo::

source: Boolean value of ``Enum`` classes and members
es_us: Valor booleano de clases y miembros ``Enum``

source: Enum classes that are mixed with non-:class:`Enum` types (such as :class:`int`, :class:`str`, etc.) are evaluated according to the mixed-in type's rules; otherwise, all members evaluate as :data:`True`. To make your own enum's boolean evaluation depend on the member's value add the following to your class::
es_us: Las clases de enumeración que se mezclan con tipos que no son :class:`Enum` (como :class:`int`, :class:`str`, etc.) se evalúan de acuerdo con las reglas del tipo combinado; de lo contrario, todos los miembros se evalúan como :data:`True`. Para hacer que la evaluación booleana de su propia enumeración dependa del valor del miembro, agregue lo siguiente a su clase:

source: Plain :class:`Enum` classes always evaluate as :data:`True`.
es_us: Las clases simples :class:`Enum` siempre se evalúan como :data:`True`.

source: ``Enum`` classes with methods
es_us: Clases ``Enum`` con métodos

source: If you give your enum subclass extra methods, like the `Planet`_ class below, those methods will show up in a :func:`dir` of the member, but not of the class::
es_us: Si le da a su subclase de enumeración métodos adicionales, como la clase `Planet`_ a continuación, esos métodos aparecerán en un :func:`dir` del miembro, pero no de la clase:

source: Combining members of ``Flag``
es_us: Combinación de miembros de ``Flag``

source: Iterating over a combination of :class:`Flag` members will only return the members that are comprised of a single bit::
es_us: La iteración sobre una combinación de miembros :class:`Flag` solo devolverá los miembros que se componen de un solo bit:

source: >>> class Color(Flag): ... RED = auto() ... GREEN = auto() ... BLUE = auto() ... MAGENTA = RED | BLUE ... YELLOW = RED | GREEN ... CYAN = GREEN | BLUE ... >>> Color(3) # named combination <Color.YELLOW: 3> >>> Color(7) # not named combination <Color.RED|GREEN|BLUE: 7>
es_us: >>> class Color(Flag): ... RED = auto() ... GREEN = auto() ... BLUE = auto() ... MAGENTA = RED | BLUE ... YELLOW = RED | GREEN ... CYAN = GREEN | BLUE ... >>> Color(3) #combinación con nombre <Color.YELLOW: 3> >>> Color(7) # combinación sin nombre <Color.RED|GREEN|BLUE: 7>

source: ``Flag`` and ``IntFlag`` minutia
es_us: Minuciosidades ``Flag`` y ``IntFlag``

source: Using the following snippet for our examples::
es_us: Usando el siguiente fragmento para nuestros ejemplos:

source: the following are true:
es_us: lo siguiente es cierto:

source: single-bit flags are canonical
es_us: las banderas de un solo bit son canónicas

source: multi-bit and zero-bit flags are aliases
es_us: las banderas multibit y zero-bit son alias
