Repository: taicoding/python-docs-es
Catalog: howto/instrumentation.po
Languages: es

source: Instrumenting CPython with DTrace and SystemTap
es: Instrumentación de CPython con DTrace y SystemTap

source: author
es: autor

source: DTrace and SystemTap are monitoring tools, each providing a way to inspect what the processes on a computer system are doing. They both use domain-specific languages allowing a user to write scripts which:
es: DTrace y SystemTap son herramientas de monitoreo, cada una de las cuales proporciona una forma de inspeccionar lo que están haciendo los procesos en un sistema informático. Ambos usan lenguajes específicos de dominio que permiten al usuario escribir scripts que:

source: filter which processes are to be observed
es: filtrar qué procesos deben observarse

source: gather data from the processes of interest
es: recopilar datos de los procesos de interés

source: generate reports on the data
es: generar reportes sobre los datos

source: As of Python 3.6, CPython can be built with embedded "markers", also known as "probes", that can be observed by a DTrace or SystemTap script, making it easier to monitor what the CPython processes on a system are doing.
es: A partir de Python 3.6, CPython se puede construir con "marcadores" incrustados, también conocidos como "sondas", que se pueden observar mediante un script de DTrace o SystemTap, lo que facilita la supervisión de lo que hacen los procesos de CPython en un sistema.

source: DTrace markers are implementation details of the CPython interpreter. No guarantees are made about probe compatibility between versions of CPython. DTrace scripts can stop working or work incorrectly without warning when changing CPython versions.
es: Los marcadores de DTrace son detalles de implementación del intérprete CPython. No se ofrecen garantías sobre la compatibilidad de la sonda entre versiones de CPython. Los scripts de DTrace pueden dejar de funcionar o funcionar incorrectamente sin previo aviso al cambiar las versiones de CPython.

source: Enabling the static markers
es: Habilitando los marcadores estáticos

source: macOS comes with built-in support for DTrace. On Linux, in order to build CPython with the embedded markers for SystemTap, the SystemTap development tools must be installed.
es: macOS viene con soporte integrado para DTrace. En Linux, para construir CPython con los marcadores incrustados para SystemTap, se deben instalar las herramientas de desarrollo de SystemTap.

source: On a Linux machine, this can be done via::
es: En una máquina Linux, esto se puede hacer a través de::

source: or::
es: o::

source: CPython must then be :option:`configured with the --with-dtrace option <--with-dtrace>`:
es: CPython debe ser :option:`configurado con la opción --with-dtrace <--with-dtrace>`:

source: On macOS, you can list available DTrace probes by running a Python process in the background and listing all probes made available by the Python provider::
es: En macOS, puede enumerar las sondas disponibles de DTrace ejecutando un proceso de Python en segundo plano y listando todas las sondas disponibles por el proveedor de Python::

source: On Linux, you can verify if the SystemTap static markers are present in the built binary by seeing if it contains a ".note.stapsdt" section.
es: En Linux, puede verificar si los marcadores estáticos SystemTap están presentes en el binario construido al ver si contiene una sección ".note.stapsdt".

source: If you've built Python as a shared library (with the :option:`--enable-shared` configure option), you need to look instead within the shared library. For example::
es: Si ha creado Python como una biblioteca compartida (con la opción de configuración :option:`--enable-shared`), debe buscar en la biblioteca compartida. Por ejemplo::

source: Sufficiently modern readelf can print the metadata::
es: Un lector de formato ELF suficientemente moderno puede imprimir los metadatos::

source: Static DTrace probes
es: Sondas estáticas DTrace

source: The following example DTrace script can be used to show the call/return hierarchy of a Python script, only tracing within the invocation of a function called "start". In other words, import-time function invocations are not going to be listed:
es: El siguiente ejemplo de script DTrace se puede utilizar para mostrar la jerarquía de llamada/retorno de un script de Python, solo rastreando dentro de la invocación de una función llamada "start". En otras palabras, las llamadas a funciones durante la importación aparecerán en la lista:

source: It can be invoked like this::
es: Se puede invocar así::

source: The output looks like this:
es: La salida se verá así:

source: Static SystemTap markers
es: Marcadores estáticos SystemTap

source: The low-level way to use the SystemTap integration is to use the static markers directly. This requires you to explicitly state the binary file containing them.
es: La forma de bajo nivel para utilizar la integración de SystemTap es utilizar los marcadores estáticos directamente. Esto requiere que indique explícitamente el archivo binario que los contiene.

source: For example, this SystemTap script can be used to show the call/return hierarchy of a Python script:
es: Por ejemplo, este script SystemTap se puede utilizar para mostrar la jerarquía de llamada/retorno de un script de Python:

source: where the columns are:
es: donde las columnas son:

source: time in microseconds since start of script
es: tiempo en microsegundos desde el inicio del script

source: name of executable
es: nombre del ejecutable

source: PID of process
es: PID de proceso

source: and the remainder indicates the call/return hierarchy as the script executes.
es: y el resto indica la jerarquía de llamada/retorno a medida que se ejecuta el script.

source: For a :option:`--enable-shared` build of CPython, the markers are contained within the libpython shared library, and the probe's dotted path needs to reflect this. For example, this line from the above example:
es: Para una compilación :option:`--enable-shared` de CPython, los marcadores están contenidos dentro de la biblioteca compartida libpython, y la ruta de puntos de la sonda debe reflejar esto. Por ejemplo, esta línea del ejemplo anterior:

source: should instead read:
es: en su lugar debería leer:

source: (assuming a :ref:`debug build <debug-build>` of CPython 3.6)
es: (asumiendo una :ref:`compilación de depuración <debug-build>` de CPython 3.6)

source: Available static markers
es: Marcadores estáticos disponibles

source: This marker indicates that execution of a Python function has begun. It is only triggered for pure-Python (bytecode) functions.
es: Este marcador indica que ha comenzado la ejecución de una función de Python. Solo se activa para funciones de Python puro (código de bytes).

source: The filename, function name, and line number are provided back to the tracing script as positional arguments, which must be accessed using ``$arg1``, ``$arg2``, ``$arg3``:
es: El nombre del archivo, el nombre de la función y el número de línea se retornan al script de rastreo como argumentos posicionales, a los que se debe acceder usando ``$arg1``, ``$arg2``, ``$arg3``:

source: ``$arg1`` : ``(const char *)`` filename, accessible using ``user_string($arg1)``
es: ``$arg1`` : ``(const char *)`` nombre del archivo, accesible usando ``user_string($arg1)``

source: ``$arg2`` : ``(const char *)`` function name, accessible using ``user_string($arg2)``
es: ``$arg2`` : ``(const char *)`` nombre de la función, accesible usando ``user_string($arg2)``

source: ``$arg3`` : ``int`` line number
es: ``$arg3`` : ``int`` número de linea

source: This marker indicates a Python line is about to be executed. It is the equivalent of line-by-line tracing with a Python profiler. It is not triggered within C functions.
es: Este marcador indica que una línea de Python está a punto de ejecutarse. Es el equivalente al rastreo línea por línea con un generador de perfiles de Python. No se activa con las funciones de C.

source: Fires when the Python interpreter finishes a garbage collection cycle. ``arg0`` is the number of collected objects.
es: Se activa cuando el intérprete de Python finaliza un ciclo de recolección de basura. ``arg0`` es el número de objetos recopilados.

source: Fires before :mod:`importlib` attempts to find and load the module. ``arg0`` is the module name.
es: Se activa antes :mod:`importlib` e intenta encontrar y cargar el módulo. ``arg0`` es el nombre del módulo.

source: Fires after :mod:`importlib`'s find_and_load function is called. ``arg0`` is the module name, ``arg1`` indicates if module was successfully loaded.
es: Se activa después de que la función *find_and_load* de :mod:`importlib` es llamada. ``arg0`` es el nombre del módulo, ``arg1`` indica si el módulo se cargó correctamente.

source: Fires when :func:`sys.audit` or :c:func:`PySys_Audit` is called. ``arg0`` is the event name as C string, ``arg1`` is a :c:type:`PyObject` pointer to a tuple object.
es: Se activa cuando se llama :func:`sys.audit` o :c:func:`PySys_Audit`. ``arg0`` es el nombre del evento como cadena C, ``arg1`` es un puntero :c:type:`PyObject` a un objeto tupla.

source: The higher-level way to use the SystemTap integration is to use a "tapset": SystemTap's equivalent of a library, which hides some of the lower-level details of the static markers.
es: La forma de nivel superior de utilizar la integración de SystemTap es utilizar un "tapset": el equivalente de SystemTap a una biblioteca, que oculta algunos de los detalles de bajo nivel de los marcadores estáticos.

source: Here is a tapset file, based on a non-shared build of CPython:
es: A continuación un archivo de tapset, basado en una compilación no compartida de CPython:

source: If this file is installed in SystemTap's tapset directory (e.g. ``/usr/share/systemtap/tapset``), then these additional probepoints become available:
es: Si este archivo está instalado en el directorio de tapset de SystemTap (por ejemplo, ``/usr/share/systemtap/tapset``), estos puntos de sonda adicionales estarán disponibles:

source: This probe point indicates that execution of a Python function has begun. It is only triggered for pure-Python (bytecode) functions.
es: Este punto de sonda indica que ha comenzado la ejecución de una función de Python. Solo se activa para funciones de Python puro (código de bytes).

source: This probe point is the converse of ``python.function.return``, and indicates that execution of a Python function has ended (either via ``return``, or via an exception). It is only triggered for pure-Python (bytecode) functions.
es: Este punto de prueba es el inverso de ``python.function.return``, e indica que la ejecución de una función de Python ha finalizado (ya sea mediante ``return`` o mediante una excepción). Solo se activa para funciones de Python puro (código de bytes).

source: Examples
es: Ejemplos

source: This SystemTap script uses the tapset above to more cleanly implement the example given above of tracing the Python function-call hierarchy, without needing to directly name the static markers:
es: Este script de SystemTap utiliza el tapset anterior para implementar de manera más limpia el ejemplo de rastrear la jerarquía de llamadas a funciones de Python, sin necesidad de nombrar directamente los marcadores estáticos:
