Repository: taicoding/python-docs-es
Catalog: howto/unicode.po
Languages: es

source: Unicode HOWTO
es: CÓMO (*HOWTO*) Unicode

source: Release
es: Lanzamiento

source: This HOWTO discusses Python's support for the Unicode specification for representing textual data, and explains various problems that people commonly encounter when trying to work with Unicode.
es: Este CÓMO (*HOWTO*) debate el soporte de Python para la especificación Unicode para representar datos textuales, y explica varios problemas que comúnmente encuentra la gente cuando tratan de trabajar con Unicode.

source: Introduction to Unicode
es: Introducción a Unicode

source: Definitions
es: Definiciones

source: Today's programs need to be able to handle a wide variety of characters. Applications are often internationalized to display messages and output in a variety of user-selectable languages; the same program might need to output an error message in English, French, Japanese, Hebrew, or Russian. Web content can be written in any of these languages and can also include a variety of emoji symbols. Python's string type uses the Unicode Standard for representing characters, which lets Python programs work with all these different possible characters.
es: Los programas de hoy necesitan poder manejar una amplia variedad de caracteres. Las aplicaciones son a menudo internacionalizadas para mostrar mensajes y resultados en una variedad de idiomas seleccionables por el usuario; Es posible que el mismo programa necesite generar un mensaje de error en inglés, francés, japonés, hebreo o ruso. El contenido web se puede escribir en cualquiera de estos idiomas y también puede incluir una variedad de símbolos *emoji*. El tipo cadena de Python utiliza el estándar Unicode para representar caracteres, lo que permite a los programas de Python trabajar con todos estos caracteres posibles diferentes.

source: Unicode (https://www.unicode.org/) is a specification that aims to list every character used by human languages and give each character its own unique code. The Unicode specifications are continually revised and updated to add new languages and symbols.
es: Unicode (https://www.unicode.org/) es una especificación que apunta a listar cada carácter usado por lenguajes humanos y darle a cada carácter su propio código único. La especificación Unicode es continuamente revisada y actualizada para añadir nuevos lenguajes y símbolos.

source: A **character** is the smallest possible component of a text. 'A', 'B', 'C', etc., are all different characters. So are 'È' and 'Í'. Characters vary depending on the language or context you're talking about. For example, there's a character for "Roman Numeral One", 'Ⅰ', that's separate from the uppercase letter 'I'. They'll usually look the same, but these are two different characters that have different meanings.
es: Un **carácter** es el componente mas pequeño posible de un texto. 'A', 'B', 'C', etc., son todos diferentes caracteres. También lo son *'È'* e *'Í'*. Los caracteres varían dependiendo del lenguaje o del contexto en el que estás hablando. Por ejemplo, Existe un carácter para el "Número Uno Romano", 'I', que es distinto de la letra 'I' mayúscula. Estos usualmente lucen igual, pero son dos caracteres diferentes que tienen distintos significados.

source: The Unicode standard describes how characters are represented by **code points**. A code point value is an integer in the range 0 to 0x10FFFF (about 1.1 million values, the `actual number assigned <https://www.unicode.org/versions/latest/#Summary>`_ is less than that). In the standard and in this document, a code point is written using the notation ``U+265E`` to mean the character with value ``0x265e`` (9,822 in decimal).
es: El estándar Unicode describe cómo se representan los caracteres mediante **puntos de código**. Un valor de punto de código es un número entero en el rango de 0 a 0x10FFFF (aproximadamente 1.1 millones de valores, el `número real asignado <https://www.unicode.org/versions/latest/#Summary>`_ es menor que eso). En el estándar y en este documento, un punto de código se escribe usando la notación ``U+265E`` para significar el carácter con valor ``0x265e`` (9,822 en decimal).

source: The Unicode standard contains a lot of tables listing characters and their corresponding code points:
es: El estándar Unicode contiene muchas tablas que enumeran caracteres y sus puntos de código correspondientes:

source: Strictly, these definitions imply that it's meaningless to say 'this is character ``U+265E``'. ``U+265E`` is a code point, which represents some particular character; in this case, it represents the character 'BLACK CHESS KNIGHT', '♞'. In informal contexts, this distinction between code points and characters will sometimes be forgotten.
es: Estrictamente, estas definiciones implican que no tiene sentido decir 'este es el carácter ``U+265E``. ``U+265E`` es un punto de código, que representa algún carácter en particular; en este caso, representa el carácter 'CABALLERO AJEDREZ NEGRO', '♞'. En contextos informales, esta distinción entre puntos de código y caracteres a veces se olvidará.

source: A character is represented on a screen or on paper by a set of graphical elements that's called a **glyph**. The glyph for an uppercase A, for example, is two diagonal strokes and a horizontal stroke, though the exact details will depend on the font being used. Most Python code doesn't need to worry about glyphs; figuring out the correct glyph to display is generally the job of a GUI toolkit or a terminal's font renderer.
es: Un carácter es representado en una pantalla o en papel por un conjunto de elementos gráficos llamado **glifo**. El glifo para una A mayúscula, por ejemplo, es dos trazos diagonales y uno horizontal, aunque los detalles exactos van a depender de la fuente utilizada. La mayoría del código de Python no necesita preocuparse por los glifos; averiguar el glifo correcto para mostrar es generalmente el trabajo de un kit de herramientas GUI o el renderizador de fuentes de una terminal.

source: Encodings
es: Codificaciones

source: To summarize the previous section: a Unicode string is a sequence of code points, which are numbers from 0 through ``0x10FFFF`` (1,114,111 decimal). This sequence of code points needs to be represented in memory as a set of **code units**, and **code units** are then mapped to 8-bit bytes. The rules for translating a Unicode string into a sequence of bytes are called a **character encoding**, or just an **encoding**.
es: Para resumir la sección anterior: Una cadena Unicode es una secuencia de código de posiciones que son números desde 0 hasta ``0x10FFFF`` (1114111 decimal). Esta secuencia de código de posiciones necesita ser representada en memoria como un conjunto de **unidades de código**, y las **unidades de código** son mapeadas a bytes de 8 bits. Las reglas para traducir una cadena Unicode a una secuencia de bytes son llamadas **Codificación de carácter**, o sólo una **codificación**.

source: The first encoding you might think of is using 32-bit integers as the code unit, and then using the CPU's representation of 32-bit integers. In this representation, the string "Python" might look like this:
es: La primera codificación en que podrías pensar es usar enteros de 32 bits como unidad de código, y luego usar la representación de la CPU de enteros de 32 bits. En esta representación, la cadena "Python" podría verse así:

source: This representation is straightforward but using it presents a number of problems.
es: Esta representación es sencilla pero utilizarla presenta una serie de problemas.

source: It's not portable; different processors order the bytes differently.
es: No es portable; diferentes procesadores ordenan los bytes de manera diferente.

source: It's very wasteful of space. In most texts, the majority of the code points are less than 127, or less than 255, so a lot of space is occupied by ``0x00`` bytes. The above string takes 24 bytes compared to the 6 bytes needed for an ASCII representation. Increased RAM usage doesn't matter too much (desktop computers have gigabytes of RAM, and strings aren't usually that large), but expanding our usage of disk and network bandwidth by a factor of 4 is intolerable.
es: Es un desperdicio de espacio. En la mayoría de los textos, la mayoría de los códigos de posición son menos de 127, o menos de 255, por lo que una gran cantidad de espacio está ocupado por bytes ``0x00``. La cadena anterior toma 24 bytes en comparación con los 6 bytes necesarios para una representación ASCII. El aumento en el uso de RAM no importa demasiado (las computadoras de escritorio tienen *gigabytes* de RAM, y las cadenas no suelen ser tan grandes), pero expandir nuestro uso del disco y el ancho de banda de la red en un factor de 4 es intolerable.

source: It's not compatible with existing C functions such as ``strlen()``, so a new family of wide string functions would need to be used.
es: No es compatible con funciones existentes en C como ``strlen()``, para eso se necesitaría una nueva familia de funciones de cadenas.

source: Therefore this encoding isn't used very much, and people instead choose other encodings that are more efficient and convenient, such as UTF-8.
es: Por lo tanto esta codificación no es muy utilizada, y la gente prefiere elegir codificaciones que son mas eficientes y convenientes, como UTF-8.

source: UTF-8 is one of the most commonly used encodings, and Python often defaults to using it. UTF stands for "Unicode Transformation Format", and the '8' means that 8-bit values are used in the encoding. (There are also UTF-16 and UTF-32 encodings, but they are less frequently used than UTF-8.) UTF-8 uses the following rules:
es: UTF-8 es una de las codificaciones mas utilizadas, y Python generalmente la usa de forma predeterminada. UTF significa *"Unicode Transformation Format"*, y el "8" significa que se utilizan valores de 8 bits en la codificación. (También hay codificaciones UTF-16 y UTF-32, pero son menos frecuentes que UTF-8.) UTF-8 usa las siguientes reglas:

source: If the code point is < 128, it's represented by the corresponding byte value.
es: Si el código de posición is < 128, es representado por el valor de byte correspondiente.

source: If the code point is >= 128, it's turned into a sequence of two, three, or four bytes, where each byte of the sequence is between 128 and 255.
es: Si el código de posición es >= 128, se transforma en una secuencia de dos, tres, o cuatro bytes, donde cada byte de la secuencia está entre 128 y 255.

source: UTF-8 has several convenient properties:
es: UTF-8 tiene varias propiedades convenientes:

source: It can handle any Unicode code point.
es: Puede manejar cualquier punto de código Unicode.

source: A Unicode string is turned into a sequence of bytes that contains embedded zero bytes only where they represent the null character (U+0000). This means that UTF-8 strings can be processed by C functions such as ``strcpy()`` and sent through protocols that can't handle zero bytes for anything other than end-of-string markers.
es: Una cadena Unicode se convierte en una secuencia de bytes que contiene cero bytes incrustados solo donde representan el carácter nulo (U+0000). Esto significa que las cadenas UTF-8 pueden ser procesadas por funciones C como ``strcpy()`` y enviadas a través de protocolos que no pueden manejar cero bytes para nada más que marcadores de fin de cadena de caracteres.

source: A string of ASCII text is also valid UTF-8 text.
es: Una cadena de texto ASCII es también texto UTF-8.

source: UTF-8 is fairly compact; the majority of commonly used characters can be represented with one or two bytes.
es: UTF-8 es bastante compacto; La mayoría de los caracteres comúnmente usados pueden ser representados con uno o dos bytes.

source: If bytes are corrupted or lost, it's possible to determine the start of the next UTF-8-encoded code point and resynchronize. It's also unlikely that random 8-bit data will look like valid UTF-8.
es: Si los bytes están corruptos o perdidos, es posible determinar el comienzo del próximo código de posición y re-sincronizar. También es poco probable que datos aleatorios de 8 bit se vean como UTF-8 válido.

source: UTF-8 is a byte oriented encoding. The encoding specifies that each character is represented by a specific sequence of one or more bytes. This avoids the byte-ordering issues that can occur with integer and word oriented encodings, like UTF-16 and UTF-32, where the sequence of bytes varies depending on the hardware on which the string was encoded.
es: UTF-8 es una codificación orientada a bytes. La codificación especifica que cada carácter está representado por una secuencia específica de uno o más bytes. Esto evita los problemas de ordenamiento de bytes que pueden ocurrir con codificaciones orientadas a números enteros y palabras, como UTF-16 y UTF-32, donde la secuencia de bytes varía según el hardware en el que se codificó la cadena.

source: References
es: Referencias

source: The `Unicode Consortium site <https://www.unicode.org>`_ has character charts, a glossary, and PDF versions of the Unicode specification. Be prepared for some difficult reading. `A chronology <https://www.unicode.org/history/>`_ of the origin and development of Unicode is also available on the site.
es: El `sitio del Consorcio Unicode <https://www.unicode.org>`_ tiene gráficos de caracteres, un glosario y versiones en PDF de la especificación Unicode. Esté preparado para una lectura difícil. `Una cronología <https://www.unicode.org/history/>`_ del origen y desarrollo de Unicode también está disponible en el sitio.

source: On the Computerphile Youtube channel, Tom Scott briefly `discusses the history of Unicode and UTF-8 <https://www.youtube.com/watch?v=MijmeoH9LT4>`_ (9 minutes 36 seconds).
es: En el canal de *Youtube* *Computerphile*, *Tom Scott* `discute brevemente la historia de Unicode y UTF-8 <https://www.youtube.com/watch?v=MijmeoH9LT4>`_ (9 minutos 36 segundos).

source: Another `good introductory article <https://www.joelonsoftware.com/2003/10/08/the-absolute-minimum-every-software-developer-absolutely-positively-must-know-about-unicode-and-character-sets-no-excuses/>`_ was written by Joel Spolsky. If this introduction didn't make things clear to you, you should try reading this alternate article before continuing.
es: Otro `buen articulo introductorio <https://www.joelonsoftware.com/2003/10/08/the-absolute-minimum-every-software-developer-absolutely-positively-must-know-about-unicode-and-character-sets-no-excuses/>`_ fue escrito por *Joel Spolsky*. Si esta introducción no aclara las cosas para usted, debería tratar leyendo este articulo alternativo antes de continuar.

source: Wikipedia entries are often helpful; see the entries for "`character encoding <https://en.wikipedia.org/wiki/Character_encoding>`_" and `UTF-8 <https://en.wikipedia.org/wiki/UTF-8>`_, for example.
es: Artículos de *Wikipedia* son a menudo útiles. Mire los artículos para "`codificación de caracteres <https://es.wikipedia.org/wiki/Codificaci%C3%B3n_de_caracteres>`_" y `UTF-8 <https://es.wikipedia.org/wiki/UTF-8>`_, por ejemplo.

source: Python's Unicode Support
es: Soporte Unicode de Python

source: Now that you've learned the rudiments of Unicode, we can look at Python's Unicode features.
es: Ahora que ya ha aprendido los rudimentos de Unicode, podemos mirar las características de Unicode de Python.

source: The String Type
es: El tipo cadena

source: Since Python 3.0, the language's :class:`str` type contains Unicode characters, meaning any string created using ``"unicode rocks!"``, ``'unicode rocks!'``, or the triple-quoted string syntax is stored as Unicode.
es: Desde Python 3.0, el tipo :class:`str` del lenguaje contiene caracteres Unicode, lo que significa que cualquier cadena creada usando ``"unicode rocks!"``, ``'unicode rocks!'``, o la sintaxis de cadena entre comillas triples es almacenado como Unicode.

source: The default encoding for Python source code is UTF-8, so you can simply include a Unicode character in a string literal::
es: La codificación predeterminada para el código fuente de Python es UTF-8, por lo que simplemente puede incluir un carácter Unicode en un literal de cadena de caracteres::

source: Side note: Python 3 also supports using Unicode characters in identifiers::
es: Nota al margen: Python 3 también soporta el uso de caracteres Unicode en identificadores::

source: If you can't enter a particular character in your editor or want to keep the source code ASCII-only for some reason, you can also use escape sequences in string literals. (Depending on your system, you may see the actual capital-delta glyph instead of a \u escape.) ::
es: Si no puede ingresar un carácter en particular en su editor o desea mantener el código fuente solo ASCII por alguna razón, también puede usar secuencias de escape en cadenas de caracteres literales. (Dependiendo de su sistema, es posible que vea el glifo delta de mayúsculas en lugar de un escape \u)::

source: In addition, one can create a string using the :func:`~bytes.decode` method of :class:`bytes`. This method takes an *encoding* argument, such as ``UTF-8``, and optionally an *errors* argument.
es: Además, uno puede crear una cadena usando el método :func:`~bytes.decode` de la clase :class:`bytes`. Este método recibe una *codificación* como argumento, como ``UTF-8``, y opcionalmente un argumento *errores*.

source: The *errors* argument specifies the response when the input string can't be converted according to the encoding's rules. Legal values for this argument are ``'strict'`` (raise a :exc:`UnicodeDecodeError` exception), ``'replace'`` (use ``U+FFFD``, ``REPLACEMENT CHARACTER``), ``'ignore'`` (just leave the character out of the Unicode result), or ``'backslashreplace'`` (inserts a ``\xNN`` escape sequence). The following examples show the differences::
es: El argumento *errores* especifica la respuesta cuando la cadena ingresada no puede ser convertida de acuerdo a las reglas de codificación. Los posibles valores para este argumento son ``'strict'`` (levanta una excepción :exc:`UnicodeDecodeError`), ``'replace'`` (use ``U+FFFD``, ``CARACTER DE REEMPLAZO``), ``'ignore'`` (solo deje el carácter fuera del resultado Unicode), o ``'backslahsreplace'`` (inserta una secuencia de escape ``\xNN``). Los siguientes ejemplos muestran las diferencias ::

source: Encodings are specified as strings containing the encoding's name. Python comes with roughly 100 different encodings; see the Python Library Reference at :ref:`standard-encodings` for a list. Some encodings have multiple names; for example, ``'latin-1'``, ``'iso_8859_1'`` and ``'8859``' are all synonyms for the same encoding.
es: Las codificaciones son especificadas como cadenas que contienen el nombre de la codificación. Python viene con cerca de 100 codificaciones diferentes; consulta la referencia de la biblioteca de Python en :ref:`standard-encodings` para una lista. Algunas codificaciones tienen múltiples nombres; por ejemplo, ``'latin-1'``, ``'iso_8859_1'`` y ``'8859``' son sinónimos para la misma codificación.

source: One-character Unicode strings can also be created with the :func:`chr` built-in function, which takes integers and returns a Unicode string of length 1 that contains the corresponding code point. The reverse operation is the built-in :func:`ord` function that takes a one-character Unicode string and returns the code point value::
es: Las cadenas de un solo carácter pueden ser creadas también con la función incorporada :func:`chr`, que toma un entero y retorna una cadena Unicode de longitud 1 que contiene el correspondiente código de posición. La operación inversa es la función incorporada :func:`ord` que toma una cadena Unicode de un carácter y retorna el código de posición::

source: Converting to Bytes
es: Convirtiendo a Bytes

source: The opposite method of :meth:`bytes.decode` is :meth:`str.encode`, which returns a :class:`bytes` representation of the Unicode string, encoded in the requested *encoding*.
es: El método opuesto a :meth:`bytes.decode` es :meth:`str.encode`, que retorna una representación de :class:`bytes` de la cadena Unicode, codificada en la codificación solicitada.

source: The *errors* parameter is the same as the parameter of the :meth:`~bytes.decode` method but supports a few more possible handlers. As well as ``'strict'``, ``'ignore'``, and ``'replace'`` (which in this case inserts a question mark instead of the unencodable character), there is also ``'xmlcharrefreplace'`` (inserts an XML character reference), ``backslashreplace`` (inserts a ``\uNNNN`` escape sequence) and ``namereplace`` (inserts a ``\N{...}`` escape sequence).
es: El parámetro *errores* es el mismo que el parámetro del método :meth:`~bytes.decode` pero soporta algunos manejadores mas.

source: The following example shows the different results::
es: El siguiente ejemplo muestra los diferentes resultados::

source: The low-level routines for registering and accessing the available encodings are found in the :mod:`codecs` module. Implementing new encodings also requires understanding the :mod:`codecs` module. However, the encoding and decoding functions returned by this module are usually more low-level than is comfortable, and writing new encodings is a specialized task, so the module won't be covered in this HOWTO.
es: Las rutinas de bajo nivel para registrar y acceder a las codificaciones disponibles se encuentran en el módulo :mod:`codecs`. La implementación de nuevas codificaciones también requiere comprender el módulo :mod:`codecs`. Sin embargo, las funciones de codificación y decodificación retornadas por este módulo generalmente son de nivel más bajo de lo que es cómodo, y escribir nuevas codificaciones es una tarea especializada, por lo que el módulo no se cubrirá en este CÓMO.

source: Unicode Literals in Python Source Code
es: Literales Unicode en código fuente Python

source: In Python source code, specific Unicode code points can be written using the ``\u`` escape sequence, which is followed by four hex digits giving the code point. The ``\U`` escape sequence is similar, but expects eight hex digits, not four::
es: En el código fuente de Python, se pueden escribir puntos de código Unicode específicos utilizando la secuencia de escape ``\u``, que es seguida por cuatro dígitos hexadecimales que dan el punto de código. La secuencia de escape ``\U`` es similar, pero espera ocho dígitos hexadecimales, no cuatro::

source: Using escape sequences for code points greater than 127 is fine in small doses, but becomes an annoyance if you're using many accented characters, as you would in a program with messages in French or some other accent-using language. You can also assemble strings using the :func:`chr` built-in function, but this is even more tedious.
es: El uso de secuencias de escape para puntos de código superiores a 127 está bien en pequeñas dosis, pero se convierte en una molestia si está utilizando muchos caracteres acentuados, como lo haría en un programa con mensajes en francés o algún otro lenguaje que utilice acento. También puede ensamblar cadenas usando la función incorporada :func:`chr`, pero esto es aún más tedioso.

source: Ideally, you'd want to be able to write literals in your language's natural encoding. You could then edit Python source code with your favorite editor which would display the accented characters naturally, and have the right characters used at runtime.
es: Idealmente, desearía poder escribir literales en la codificación natural de su idioma. Luego, puede editar el código fuente de Python con su editor favorito, que mostrará los caracteres acentuados de forma natural y tendrá los caracteres correctos utilizados en tiempo de ejecución.
