Repository: taicoding/python-docs-es
Catalog: howto/unicode.po
Languages: es

source: Python supports writing source code in UTF-8 by default, but you can use almost any encoding if you declare the encoding being used. This is done by including a special comment as either the first or second line of the source file::
es: Python soporta la escritura de código fuente en UTF-8 de forma predeterminada, pero puede usar casi cualquier codificación si declara la codificación que está utilizando. Esto se hace mediante la inclusión de un comentario especial en la primera o segunda línea del archivo fuente::

source: The syntax is inspired by Emacs's notation for specifying variables local to a file. Emacs supports many different variables, but Python only supports 'coding'. The ``-*-`` symbols indicate to Emacs that the comment is special; they have no significance to Python but are a convention. Python looks for ``coding: name`` or ``coding=name`` in the comment.
es: La sintaxis está inspirada en la notación de Emacs para especificar variables locales a un archivo. Emacs admite muchas variables diferentes, pero Python solo admite *'coding'*. Los símbolos ``- * -`` indican a Emacs que el comentario es especial; no tienen importancia para Python pero son una convención. Python busca ``coding: name`` o ``coding=name`` en el comentario.

source: If you don't include such a comment, the default encoding used will be UTF-8 as already mentioned. See also :pep:`263` for more information.
es: Si no incluye dicho comentario, la codificación predeterminada utilizada será UTF-8 como ya se mencionó. Ver también :pep:`263` para más información.

source: Unicode Properties
es: Propiedades Unicode

source: The Unicode specification includes a database of information about code points. For each defined code point, the information includes the character's name, its category, the numeric value if applicable (for characters representing numeric concepts such as the Roman numerals, fractions such as one-third and four-fifths, etc.). There are also display-related properties, such as how to use the code point in bidirectional text.
es: La especificación Unicode incluye una base de datos de información sobre puntos de código. Para cada punto de código definido, la información incluye el nombre del carácter, su categoría, el valor numérico si corresponde (para caracteres que representan conceptos numéricos como los números romanos, fracciones como un tercio y cuatro quintos, etc.). También hay propiedades relacionadas con la visualización, como cómo usar el punto de código en texto bidireccional.

source: The following program displays some information about several characters, and prints the numeric value of one particular character::
es: El siguiente programa muestra información sobre varios caracteres e imprime el valor numérico de un carácter en particular::

source: When run, this prints:
es: Cuando se ejecuta, este imprime:

source: The category codes are abbreviations describing the nature of the character. These are grouped into categories such as "Letter", "Number", "Punctuation", or "Symbol", which in turn are broken up into subcategories. To take the codes from the above output, ``'Ll'`` means 'Letter, lowercase', ``'No'`` means "Number, other", ``'Mn'`` is "Mark, nonspacing", and ``'So'`` is "Symbol, other". See `the General Category Values section of the Unicode Character Database documentation <https://www.unicode.org/reports/tr44/#General_Category_Values>`_ for a list of category codes.
es: Los códigos de categoría son abreviaturas que describen la naturaleza del personaje. Estos se agrupan en categorías como "Letra", "Número", "Puntuación" o "Símbolo", que a su vez se dividen en subcategorías. Para tomar los códigos de la salida anterior, ``'Ll'`` significa 'Letra, minúscula ', ``'No'`` significa "Número, otro", ``'Mn'`` es "Marca, sin espacios" , y ``'So'`` es "Símbolo, otro". Consulte `la sección Valores de categoría generales de la documentación de la base de datos de caracteres Unicode <https://www.unicode.org/reports/tr44/#General_Category_Values>`_ para obtener una lista de códigos de categoría.

source: Comparing Strings
es: Comparando cadenas

source: Unicode adds some complication to comparing strings, because the same set of characters can be represented by different sequences of code points. For example, a letter like 'ê' can be represented as a single code point U+00EA, or as U+0065 U+0302, which is the code point for 'e' followed by a code point for 'COMBINING CIRCUMFLEX ACCENT'. These will produce the same output when printed, but one is a string of length 1 and the other is of length 2.
es: Unicode agrega algunas complicaciones a la comparación de cadenas, porque el mismo conjunto de caracteres puede representarse mediante diferentes secuencias de puntos de código. Por ejemplo, una letra como 'ê' puede representarse como un único punto de código U+00EA, o como U+0065 U+0302, que es el punto de código para 'e' seguido de un punto de código para 'COMBINING CIRCUMFLEX ACCENT' . Estos producirán la misma salida cuando se impriman, pero uno es una cadena de longitud 1 y el otro es de longitud 2.

source: One tool for a case-insensitive comparison is the :meth:`~str.casefold` string method that converts a string to a case-insensitive form following an algorithm described by the Unicode Standard. This algorithm has special handling for characters such as the German letter 'ß' (code point U+00DF), which becomes the pair of lowercase letters 'ss'.
es: Una herramienta para una comparación que no distingue entre mayúsculas y minúsculas es el método :meth:`~str.casefold` que convierte una cadena en una forma que no distingue entre mayúsculas y minúsculas siguiendo un algoritmo descrito por el estándar Unicode. Este algoritmo tiene un manejo especial para caracteres como la letra Alemana 'ß' (punto de código U+00DF), que se convierte en el par de letras minúsculas 'ss'.

source: When run, this outputs:
es: Cuando se ejecuta, esto genera:

source: The first argument to the :func:`~unicodedata.normalize` function is a string giving the desired normalization form, which can be one of 'NFC', 'NFKC', 'NFD', and 'NFKD'.
es: El primer argumento para la función :func:`~unicodedata.normalize` es una cadena que proporciona la forma de normalización deseada, que puede ser una de 'NFC', 'NFKC', 'NFD' y 'NFKD'.

source: The Unicode Standard also specifies how to do caseless comparisons::
es: El estándar Unicode también especifica cómo hacer comparaciones sin mayúsculas y minúsculas::

source: Unicode Regular Expressions
es: Expresiones regulares Unicode

source: The regular expressions supported by the :mod:`re` module can be provided either as bytes or strings. Some of the special character sequences such as ``\d`` and ``\w`` have different meanings depending on whether the pattern is supplied as bytes or a string. For example, ``\d`` will match the characters ``[0-9]`` in bytes but in strings will match any character that's in the ``'Nd'`` category.
es: Las expresiones regulares soportadas por el módulo :mod:`re` se pueden proporcionar como bytes o cadenas. Algunas de las secuencias de caracteres especiales como ``\d`` y ``\w`` tienen diferentes significados dependiendo de si el patrón se suministra como bytes o una cadena. Por ejemplo, ``\d`` coincidirá con los caracteres ``[0-9]`` en bytes, pero en las cadenas coincidirá con cualquier carácter que esté en la categoría ``'Nd'``.

source: The string in this example has the number 57 written in both Thai and Arabic numerals::
es: La cadena en este ejemplo tiene el número 57 escrito en números tailandeses y árabes::

source: When executed, ``\d+`` will match the Thai numerals and print them out. If you supply the :const:`re.ASCII` flag to :func:`~re.compile`, ``\d+`` will match the substring "57" instead.
es: Cuando se ejecuta, ``\d+`` coincidirá con los números tailandeses y los imprimirá. Si proporciona el indicador :const:`re.ASCII` a :func:`~re.compile`, ``\d+`` coincidirá con la subcadena "57" en su lugar.

source: Similarly, ``\w`` matches a wide variety of Unicode characters but only ``[a-zA-Z0-9_]`` in bytes or if :const:`re.ASCII` is supplied, and ``\s`` will match either Unicode whitespace characters or ``[ \t\n\r\f\v]``.
es: Del mismo modo, ``\w`` coincide con una amplia variedad de caracteres Unicode pero solo ``[a-zA-Z0-9_]`` en bytes o si :const:`re.ASCII` se suministra, y ``\s`` coincidirá con los caracteres de espacio en blanco Unicode o ``[ \t\n\r\f\v]``.

source: Some good alternative discussions of Python's Unicode support are:
es: Algunas buenas discusiones alternativas sobre el soporte Unicode de Python son:

source: `Pragmatic Unicode <https://nedbatchelder.com/text/unipain.html>`_, a PyCon 2012 presentation by Ned Batchelder.
es: `Pragmatic Unicode <https://nedbatchelder.com/text/unipain.html>`_, una presentación de *Ned Batchelder* en PyCon 2012.

source: The :class:`str` type is described in the Python library reference at :ref:`textseq`.
es: El tipo :class:`str` se describe en la referencia de la biblioteca de Python en :ref:`textseq`.

source: The documentation for the :mod:`unicodedata` module.
es: La documentación para el módulo :mod:`unicodedata`.

source: The documentation for the :mod:`codecs` module.
es: La documentación para el módulo :mod:`codecs`.

source: Marc-André Lemburg gave `a presentation titled "Python and Unicode" (PDF slides) <https://downloads.egenix.com/python/Unicode-EPC2002-Talk.pdf>`_ at EuroPython 2002. The slides are an excellent overview of the design of Python 2's Unicode features (where the Unicode string type is called ``unicode`` and literals start with ``u``).
es: *Marc-André Lemburg* hizo `una presentación titulada "Python and Unicode" (diapositivas en PDF) <https://downloads.egenix.com/python/Unicode-EPC2002-Talk.pdf>`_ en EuroPython 2002. Las diapositivas son una excelente descripción general del diseño de las características Unicode de Python 2 (donde el tipo de cadena Unicode se llama ``unicode`` y los literales comienzan con ``u``).

source: Reading and Writing Unicode Data
es: Leyendo y escribiendo datos Unicode

source: Once you've written some code that works with Unicode data, the next problem is input/output. How do you get Unicode strings into your program, and how do you convert Unicode into a form suitable for storage or transmission?
es: Una vez que haya escrito un código que funcione con datos Unicode, el siguiente problema es la entrada/salida. ¿Cómo obtiene cadenas Unicode en su programa y cómo convierte Unicode en una forma adecuada para almacenamiento o transmisión?

source: It's possible that you may not need to do anything depending on your input sources and output destinations; you should check whether the libraries used in your application support Unicode natively. XML parsers often return Unicode data, for example. Many relational databases also support Unicode-valued columns and can return Unicode values from an SQL query.
es: Es posible que no necesite hacer nada dependiendo de sus fuentes de entrada y destinos de salida; debe verificar si las bibliotecas utilizadas en su aplicación son compatibles con Unicode de forma nativa. Los analizadores XML a menudo retornan datos Unicode, por ejemplo. Muchas bases de datos relacionales también admiten columnas con valores Unicode y pueden retornar valores Unicode de una consulta SQL.

source: Unicode data is usually converted to a particular encoding before it gets written to disk or sent over a socket. It's possible to do all the work yourself: open a file, read an 8-bit bytes object from it, and convert the bytes with ``bytes.decode(encoding)``. However, the manual approach is not recommended.
es: Los datos Unicode generalmente se convierten a una codificación particular antes de escribirse en el disco o enviarse a través de un socket. Es posible hacer todo el trabajo usted mismo: abra un archivo, lea un objeto de bytes de 8 bits y convierta los bytes con ``bytes.decode(codificación)``. Sin embargo, no se recomienda el enfoque manual.

source: One problem is the multi-byte nature of encodings; one Unicode character can be represented by several bytes. If you want to read the file in arbitrary-sized chunks (say, 1024 or 4096 bytes), you need to write error-handling code to catch the case where only part of the bytes encoding a single Unicode character are read at the end of a chunk. One solution would be to read the entire file into memory and then perform the decoding, but that prevents you from working with files that are extremely large; if you need to read a 2 GiB file, you need 2 GiB of RAM. (More, really, since for at least a moment you'd need to have both the encoded string and its Unicode version in memory.)
es: Un problema es la naturaleza de múltiples bytes de las codificaciones; Un carácter Unicode puede ser representado por varios bytes. Si desea leer el archivo en fragmentos de tamaño arbitrario (por ejemplo, 1024 o 4096 bytes), debe escribir un código de manejo de errores para detectar el caso en el que solo una parte de los bytes que codifican un solo carácter Unicode se leen al final de Un trozo. Una solución sería leer todo el archivo en la memoria y luego realizar la decodificación, pero eso le impide trabajar con archivos que son extremadamente grandes; si necesita leer un archivo de 2 GB, necesita 2 GB de RAM. (Más, realmente, ya que por al menos un momento necesitarías tener tanto la cadena codificada como su versión Unicode en la memoria).

source: The solution would be to use the low-level decoding interface to catch the case of partial coding sequences. The work of implementing this has already been done for you: the built-in :func:`open` function can return a file-like object that assumes the file's contents are in a specified encoding and accepts Unicode parameters for methods such as :meth:`~io.TextIOBase.read` and :meth:`~io.TextIOBase.write`. This works through :func:`open`\'s *encoding* and *errors* parameters which are interpreted just like those in :meth:`str.encode` and :meth:`bytes.decode`.
es: La solución sería utilizar la interfaz de decodificación de bajo nivel para detectar el caso de secuencias de codificación parcial. El trabajo de implementar esto ya se ha realizado para usted: la función incorporada :func:`open` puede retornar un objeto similar a un archivo que asume que el contenido del archivo está en una codificación especificada y acepta parámetros Unicode para métodos como :meth:`~io.TextIOBase.read` y :meth:`~io.TextIOBase.write`. Esto funciona a través de los parámetros *enconding* y *errors* de :func:`open` que se interpretan como los de :meth:`str.encode` y :meth:`bytes.decode`.

source: Reading Unicode from a file is therefore simple::
es: Por lo tanto, leer Unicode de un archivo es simple::

source: It's also possible to open files in update mode, allowing both reading and writing::
es: También es posible abrir archivos en modo de actualización, lo que permite leer y escribir::

source: The Unicode character ``U+FEFF`` is used as a byte-order mark (BOM), and is often written as the first character of a file in order to assist with autodetection of the file's byte ordering. Some encodings, such as UTF-16, expect a BOM to be present at the start of a file; when such an encoding is used, the BOM will be automatically written as the first character and will be silently dropped when the file is read. There are variants of these encodings, such as 'utf-16-le' and 'utf-16-be' for little-endian and big-endian encodings, that specify one particular byte ordering and don't skip the BOM.
es: El carácter Unicode ``U+FEFF`` se usa como marca de orden de bytes (BOM), y a menudo se escribe como el primer carácter de un archivo para ayudar a la auto detección del orden de bytes del archivo. Algunas codificaciones, como UTF-16, esperan que haya una BOM al comienzo de un archivo; cuando se utiliza dicha codificación, la BOM se escribirá automáticamente como el primer carácter y se descartará en silencio cuando se lea el archivo. Existen variantes de estas codificaciones, como 'utf-16-le' y 'utf-16-be' para codificaciones 'little-endian' y 'big-endian', que especifican un orden de bytes particular y no omiten la BOM.

source: In some areas, it is also convention to use a "BOM" at the start of UTF-8 encoded files; the name is misleading since UTF-8 is not byte-order dependent. The mark simply announces that the file is encoded in UTF-8. For reading such files, use the 'utf-8-sig' codec to automatically skip the mark if present.
es: En algunas áreas, también es convencional usar una "BOM" al comienzo de los archivos codificados UTF-8; el nombre es engañoso ya que UTF-8 no depende del orden de bytes. La marca simplemente anuncia que el archivo está codificado en UTF-8. Para leer dichos archivos, use el códec 'utf-8-sig' para omitir automáticamente la marca si está presente.

source: Unicode filenames
es: Nombres de archivos Unicode

source: Most of the operating systems in common use today support filenames that contain arbitrary Unicode characters. Usually this is implemented by converting the Unicode string into some encoding that varies depending on the system. Today Python is converging on using UTF-8: Python on MacOS has used UTF-8 for several versions, and Python 3.6 switched to using UTF-8 on Windows as well. On Unix systems, there will only be a :term:`filesystem encoding <filesystem encoding and error handler>`. if you've set the ``LANG`` or ``LC_CTYPE`` environment variables; if you haven't, the default encoding is again UTF-8.
es: La mayoría de los sistemas operativos de uso común en la actualidad admiten nombres de archivo que contienen caracteres Unicode arbitrarios. Por lo general, esto se implementa convirtiendo la cadena Unicode en una codificación que varía según el sistema. Hoy Python está convergiendo en el uso de UTF-8: Python en MacOS ha usado UTF-8 para varias versiones, y Python 3.6 también ha cambiado a usar UTF-8 en Windows. En los sistemas Unix, solo habrá un :term:`filesystem encoding <filesystem encoding and error handler>`. si ha configurado las variables de entorno ``LANG`` o ``LC_CTYPE``; si no lo ha hecho, la codificación predeterminada es nuevamente UTF-8.

source: The :func:`sys.getfilesystemencoding` function returns the encoding to use on your current system, in case you want to do the encoding manually, but there's not much reason to bother. When opening a file for reading or writing, you can usually just provide the Unicode string as the filename, and it will be automatically converted to the right encoding for you::
es: La función :func:`sys.getfilesystemencoding` retorna la codificación para usar en su sistema actual, en caso de que desee realizar la codificación manualmente, pero no hay muchas razones para molestarse. Al abrir un archivo para leer o escribir, generalmente puede proporcionar la cadena Unicode como nombre de archivo, y se convertirá automáticamente a la codificación correcta para usted::

source: Functions in the :mod:`os` module such as :func:`os.stat` will also accept Unicode filenames.
es: Las funciones en el módulo :mod:`os` como :func:`os.stat` también aceptarán nombres de archivo Unicode.

source: The :func:`os.listdir` function returns filenames, which raises an issue: should it return the Unicode version of filenames, or should it return bytes containing the encoded versions? :func:`os.listdir` can do both, depending on whether you provided the directory path as bytes or a Unicode string. If you pass a Unicode string as the path, filenames will be decoded using the filesystem's encoding and a list of Unicode strings will be returned, while passing a byte path will return the filenames as bytes. For example, assuming the default :term:`filesystem encoding <filesystem encoding and error handler>` is UTF-8, running the following program::
es: La función :func:`os.listdir` retorna nombres de archivo, lo que plantea un problema: ¿debería devolver la versión Unicode de los nombres de archivo o debería devolver bytes que contienen las versiones codificadas? :func:`os.listdir` puede hacer ambas cosas, dependiendo de si proporcionó la ruta del directorio como bytes o una cadena Unicode. Si pasa una cadena Unicode como ruta, los nombres de archivo se decodificarán utilizando la codificación del sistema de archivos y se devolverá una lista de cadenas Unicode, mientras que pasar una ruta de bytes devolverá los nombres de archivo como bytes. Por ejemplo, suponiendo que el :term:`filesystem encoding <filesystem encoding and error handler>` predeterminado es UTF-8, al ejecutar el siguiente programa:

source: will produce the following output:
es: producirá la siguiente salida:

source: The first list contains UTF-8-encoded filenames, and the second list contains the Unicode versions.
es: La primera lista contiene nombres de archivos codificados con UTF-8, y la segunda lista contiene las versiones Unicode.

source: Note that on most occasions, you should can just stick with using Unicode with these APIs. The bytes APIs should only be used on systems where undecodable file names can be present; that's pretty much only Unix systems now.
es: Tenga en cuenta que en la mayoría de las ocasiones, debe seguir usando Unicode con estas API. Las API de bytes solo deben usarse en sistemas donde pueden estar presentes nombres de archivo no codificables; eso es prácticamente solo sistemas Unix ahora.

source: Tips for Writing Unicode-aware Programs
es: Consejos para escribir programas compatibles con Unicode

source: This section provides some suggestions on writing software that deals with Unicode.
es: Esta sección proporciona algunas sugerencias sobre cómo escribir software que maneje Unicode.

source: The most important tip is:
es: El consejo más importante es:

source: Software should only work with Unicode strings internally, decoding the input data as soon as possible and encoding the output only at the end.
es: El software solo debería funcionar con cadenas Unicode internamente, decodificando los datos de entrada lo antes posible y codificando la salida solo al final.

source: If you attempt to write processing functions that accept both Unicode and byte strings, you will find your program vulnerable to bugs wherever you combine the two different kinds of strings. There is no automatic encoding or decoding: if you do e.g. ``str + bytes``, a :exc:`TypeError` will be raised.
es: Si intenta escribir funciones de procesamiento que acepten cadenas Unicode y de bytes, encontrará que su programa es vulnerable a errores dondequiera que combine los dos tipos diferentes de cadenas. No hay codificación o decodificación automática: si hace, por ejemplo: ``str+bytes``, un :exc:`TypeError` se generará.
